Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/gui.tooltips.po
Languages: es, ru

source: Output command line options to the console
es: Devuelve las opciones de la línea de comandos a la consola
ru: Вывод опций командной строки в консоль

source: Run the {} script
es: Ejecuta el script {}
ru: Запуск сценария {}

source: Select a folder...
ru: Выбрать папку...

source: Select a file...
ru: Выбрать файл...

source: Select a folder of images...
ru: Выбрать папку с изображениями...

source: Select a video...
ru: Выбрать видео...

source: Select a model folder...
ru: Выбрать папку с моделью...

source: Select one or more files...
ru: Выбрать один или несколько файлов...

source: Select a file or folder...
ru: Выбрать файл или папку...

source: Select a save location...
ru: Выбрать место сохранения...

source: Summary statistics for each training session
es: Resumen de estadísticas para cada sesión de entrenamiento
ru: Сводная статистика для каждой тренировки

source: Preview updates every 5 seconds
es: Previsualiza actualizaciones cada 5 segundos
ru: Предпросмотр обновляется каждые 5 секунд

source: Graph showing Loss vs Iterations
es: Gráfico mostrando Pérdida contra iteraciones
ru: График зависимости потерь от количества итераций

source: Training preview. Updated on every save iteration
es: Previsualización del entrenamiento. Actualizado en cada iteración de guardado
ru: Предпросмотр тренировки. Обновляется каждую сохраняющую итерацию

source: Load/Refresh stats for the currently training session
es: Carga/Refresca estadísticas para la sesión actual de entrenamiento
ru: Загрузить/обновить статистику для текущей тренировки

source: Clear currently displayed session stats
es: Borra las estadísticas mostradas de la sesión
ru: Очистить отображаемую статистику сессии

source: Save session stats to csv
es: Guarda las estadísticas de la sesión a un archivo csv
ru: Сохранить статистику сессии в csv файл

source: Load saved session stats
es: Carga estadísticas de sesión ya guardadas
ru: Загрузить сохраненную статистику

source: Preview updates at every model save. Click to refresh now.
es: Previsualización de actualizaciones cada guardado de modelo. Pulsar para actualizar ahora.
ru: Предпросмотр обновляется при каждом сохранении модели. Нажмите, чтобы обновить сейчас.

source: Graph updates at every model save. Click to refresh now.
es: Previsualización de gráficos cada guardado de modelo. Pulsar para actualizar ahora.
ru: График обновляется при каждом сохранении модели. Нажмите, чтобы обновить сейчас.

source: Display the raw loss data
es: Muestra los datos de pérdida sin procesar
ru: Показать необработанные данные о потерях

source: Display the smoothed loss data
es: Muestra los datos de pérdida regularizados
ru: Показать сглаженные данные о потерях

source: Set the smoothing amount. 0 is no smoothing, 0.99 is maximum smoothing.
es: Ajusta el nivel de regularización. 0 es sin regularización, 0.99 es máxima regularización.
ru: Установите величину сглаживания. 0 - нет сглаживания, 0.99 - максимальное сглаживание.

source: Set the number of iterations to display. 0 displays the full session.
es: Ajusta el número de iteraciones a mostrar. 0 muestra la sesión completa.
ru: Установите количество итераций для отображения. 0 отображает полный сеанс.

source: Save {}(s) to file
es: Grabar {} a un fichero
ru: Сохранить {}(ы) в файл

source: Enable or disable {} display
es: Activar o desactivar la muestra de {}
ru: Включить или выключить отображение {}

source: faceswap.dev - Guides and Forum
es: faceswap.dev - Guías y foro
ru: faceswap.dev - Руководства и Форум

source: Patreon - Support this project
es: Patreon - Apoya este proyecto
ru: Patreon - Поддержите этот проект

source: Discord - The FaceSwap Discord server
es: Discord - El servidor de Discord de FaceSwap
ru: Discord - Discord сервер Faceswap

source: Github - Our Source Code
es: Github - Nuestro código fuente
ru: Github - Наш исходный код

source: Configure {} settings...
es: Configurar los ajustes de {}...
ru: Настройка параметров {}...

source: Project
es: Proyecto
ru: Проект

source: currently selected Task
es: tarea actualmente seleccionada
ru: текущая выбранная задача

source: Reload {} from disk
es: Recargar {} del disco
ru: Перезагрузить {} из диска

source: Create a new {}...
es: Crear un nuevo {}...
ru: Создать новый {}...

source: Reset {} to default
es: Reiniciar {} a los ajustes por defecto
ru: Сбросить {} по умолчанию

source: Save {}
es: Guardar {}
ru: Сохранить {}

source: Save {} as...
es: Guardar {} como...
ru: Сохранить {} как...

source: from a task or project file
es: de un archivo de tarea o proyecto
ru: из файла задачи или проекта

source: Load {}...
es: Cargar {}...
ru: Загрузить {}...

source: Close without saving
es: Cerrar sin guardar
ru: Закрыть без сохранения

source: Save this page's config
es: Guardar la configuración de esta página
ru: Сохранить конфигурацию этой страницы

source: Reset this page's config to default values
es: Reiniciar la configuración de esta página a sus valores por defecto
ru: Сбросить конфигурацию этой страницы до заводских значений

source: Save all settings for the currently selected config
es: Guardar todos los ajustes para la configuración seleccionada
ru: Сохранить все настройки для текущей выбранной конфигурации

source: Reset all settings for the currently selected config to default values
es: Reiniciar todos los ajustes de la configuración seleccionada a sus ajustes por defecto
ru: Сбросить все настройки для текущей выбранной конфигурации до заводских значений

source: Select a plugin to configure:
ru: Выбрать плагин для настройки:

source: Display {}
es: Mostrar {}
ru: Показать {}

source: Refresh graph
es: Resfrescar gráfico
ru: Обновить график

source: Save display data to csv
es: Guardar datos de muestra a un archivo csv
ru: Сохранить данные дисплея в csv файл

source: Number of data points to sample for rolling average
es: Número de puntos de datos a muestrear para la media móvil
ru: Количество точек данных для выборки среднего значения

source: Set the smoothing amount. 0 is no smoothing, 0.99 is maximum smoothing
es: Establezca la cantidad de regularización. 0 es sin regularización, 0,99 es máxima regularización
ru: Установите величину сглаживания. 0 - нет сглаживания, 0.99 - максимальное сглаживание

source: Flatten data points that fall more than 1 standard deviation from the mean to the mean value.
es: Aplanar los puntos de datos que se alejan más de 1 desviación estándar de la media al valor medio.
ru: Сглаживание точек данных, которые отклоняются от среднего значения более чем на 1 стандартное отклонение, до среднего значения.

source: Display rolling average of the data
es: Mostrar la media móvil de los datos
ru: Показать среднее значение данных

source: Smooth the data
es: Regularizar los datos
ru: Сгладить данные

source: Display raw data
es: Mostrar los datos sin procesar
ru: Показать необработанные данные

source: Display polynormal data trend
es: Mostrar la tendencia de los datos polinormales
ru: Отображение полинормальной тенденции данных

source: Set the data to display
es: Ajustar los datos a mostrar
ru: Указать данные для отображения

source: Change y-axis scale
es: Cambiar la escala del eje Y
ru: Изменить масштаб оси y
