Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/lib.cli.args.po
Languages: es, kr, ru

source: For use with the optional nfilter/filter files. Threshold for positive face recognition. Higher values are stricter.
es: Para usar con los archivos nfilter/filter opcionales. Umbral para el reconocimiento facial positivo. Los valores más altos son más estrictos.
kr: 옵션인 nfilter/filter 파일과 함께 사용합니다. 긍정적인 얼굴 인식을 위한 임계값. 값이 높을수록 엄격합니다.
ru: Для использования с дополнительными файлами nfilter/filter. Порог для положительного распознавания лица. Более высокие значения являются более строгими.

source: output
es: salida
kr: 출력
ru: вывод

source: The output size of extracted faces. Make sure that the model you intend to train supports your required size. This will only need to be changed for hi-res models.
es: El tamaño de salida de las caras extraídas. Asegúrese de que el modelo que pretende entrenar admite el tamaño deseado. Esto sólo tendrá que ser cambiado para los modelos de alta resolución.
kr: 추출된 얼굴의 출력 크기입니다. 훈련하려는 모델이 필요한 크기를 지원하는지 꼭 확인하세요. 이것은 고해상도 모델에 대해서만 변경하면 됩니다.
ru: Выходной размер извлеченных лиц. Убедитесь, что модель, которую вы собираетесь тренировать, поддерживает требуемый размер. Это необходимо изменить только для моделей высокого разрешения.

source: Extract every 'nth' frame. This option will skip frames when extracting faces. For example a value of 1 will extract faces from every frame, a value of 10 will extract faces from every 10th frame.
es: Extraer cada 'enésimo' fotograma. Esta opción omitirá los fotogramas al extraer las caras. Por ejemplo, un valor de 1 extraerá las caras de cada fotograma, un valor de 10 extraerá las caras de cada 10 fotogramas.
kr: 모든 'n번째' 프레임을 추출합니다. 이 옵션은 얼굴을 추출할 때 건너뛸 프레임을 설정합니다. 예를 들어, 값이 1이면 모든 프레임에서 얼굴이 추출되고, 값이 10이면 모든 10번째 프레임에서 얼굴이 추출됩니다.
ru: Извлекать каждый 'n-й' кадр. Этот параметр пропускает кадры при извлечении лиц. Например, значение 1 будет извлекать лица из каждого кадра, значение 10 будет извлекать лица из каждого 10-го кадра.

source: Automatically save the alignments file after a set amount of frames. By default the alignments file is only saved at the end of the extraction process. NB: If extracting in 2 passes then the alignments file will only start to be saved out during the second pass. WARNING: Don't interrupt the script when writing the file because it might get corrupted. Set to 0 to turn off
es: Guardar automáticamente el archivo de alineaciones después de una cantidad determinada de cuadros. Por defecto, el archivo de alineaciones sólo se guarda al final del proceso de extracción. Nota: Si se extrae en 2 pases, el archivo de alineaciones sólo se empezará a guardar durante el segundo pase. ADVERTENCIA: No interrumpa el script al escribir el archivo porque podría corromperse. Poner a 0 para desactivar
kr: 프레임 수가 설정된 후 alignments 파일을 자동으로 저장합니다. 기본적으로 alignments 파일은 추출 프로세스가 끝날 때만 저장됩니다. NB: 2번째 추출에서 성공하면 두 번째 추출 중에만 alignments 파일이 저장되기 시작합니다. 경고: 파일을 쓸 때 스크립트가 손상될 수 있으므로 스크립트를 중단하지 마십시오. 해제하려면 0으로 설정
ru: Автоматическое сохранение файла выравнивания после заданного количества кадров. По умолчанию файл выравнивания сохраняется только в конце процесса извлечения. Примечание: Если извлечение выполняется в 2 прохода, то файл выравнивания начнет сохраняться только во время второго прохода. ПРЕДУПРЕЖДЕНИЕ: Не прерывайте работу скрипта при записи файла, так как он может быть поврежден. Установите значение 0, чтобы отключить

source: Draw landmarks on the ouput faces for debugging purposes.
es: Dibujar puntos de referencia en las caras de salida para fines de depuración.
kr: 디버깅을 위해 출력 얼굴에 특징점을 그립니다.
ru: Нарисуйте ориентиры на выходящих гранях для отладки.

source: settings
es: ajustes
kr: 설정
ru: настройки

source: Don't run extraction in parallel. Will run each part of the extraction process separately (one after the other) rather than all at the same time. Useful if VRAM is at a premium.
es: No ejecute la extracción en paralelo. Ejecutará cada parte del proceso de extracción por separado (una tras otra) en lugar de hacerlo todo al mismo tiempo. Útil si la VRAM es escasa.
kr: 추출을 병렬로 실행하지 마십시오. 추출 프로세스의 각 부분을 동시에 모두 실행하는 것이 아니라 개별적으로(하나씩) 실행합니다. VRAM이 프리미엄인 경우 유용합니다.
ru: Не запускать извлечение параллельно. Каждая часть процесса извлечения будет выполняться отдельно (одна за другой), а не одновременно. Полезно, если память VRAM ограничена.

source: Skips frames that have already been extracted and exist in the alignments file
es: Omite los fotogramas que ya han sido extraídos y que existen en el archivo de alineaciones
kr: 이미 추출되었거나 alignments 파일에 존재하는 프레임들을 스킵합니다
ru: Пропускает кадры, которые уже были извлечены и существуют в файле выравнивания

source: Skip frames that already have detected faces in the alignments file
es: Omitir los fotogramas que ya tienen caras detectadas en el archivo de alineaciones
kr: 이미 얼굴을 탐지하여 alignments 파일에 존재하는 프레임들을 스킵합니다
ru: Пропустить кадры, в которых уже есть обнаруженные лица в файле выравнивания

source: Skip saving the detected faces to disk. Just create an alignments file
es: No guardar las caras detectadas en el disco. Crear sólo un archivo de alineaciones
kr: 탐지된 얼굴을 디스크에 저장하지 않습니다. 그저 alignments 파일을 만듭니다
ru: Не сохранять обнаруженные лица на диск. Просто создать файл выравнивания

source: Swap the original faces in a source video/images to your final faces. Conversion plugins can be configured in the 'Settings' Menu
es: Cambia las caras originales de un vídeo/imágenes de origen por las caras finales. Los plugins de conversión pueden ser configurados en el menú "Configuración"
kr: 원본 비디오/이미지의 원래 얼굴을 최종 얼굴으로 바꿉니다. 변환 플러그인은 '설정' 메뉴에서 구성할 수 있습니다
ru: Поменять исходные лица в исходном видео/изображении на ваши конечные лица. Плагины конвертирования можно настроить в меню "Настройки"

source: Only required if converting from images to video. Provide The original video that the source frames were extracted from (for extracting the fps and audio).
es: Sólo es necesario si se convierte de imágenes a vídeo. Proporcione el vídeo original del que se extrajeron los fotogramas de origen (para extraer los fps y el audio).
kr: 이미지에서 비디오로 변환하는 경우에만 필요합니다. 소스 프레임이 추출된 원본 비디오(fps 및 오디오 추출용)를 입력하세요.
ru: Требуется только при преобразовании из изображений в видео. Предоставьте исходное видео, из которого были извлечены исходные кадры (для извлечения кадров в секунду и звука).

source: Model directory. The directory containing the trained model you wish to use for conversion.
es: Directorio del modelo. El directorio que contiene el modelo entrenado que desea utilizar para la conversión.
kr: 모델 폴더. 당신이 변환에 사용하고자 하는 훈련된 모델을 가진 폴더입니다.
ru: Папка модели. Папка, содержащая обученную модель, которую вы хотите использовать для преобразования.

source: R|Performs color adjustment to the swapped face. Some of these options have configurable settings in '/config/convert.ini' or 'Settings > Configure Convert Plugins': L|avg-color: Adjust the mean of each color channel in the swapped reconstruction to equal the mean of the masked area in the original image. L|color-transfer: Transfers the color distribution from the source to the target image using the mean and standard deviations of the L*a*b* color space. L|manual-balance: Manually adjust the balance of the image in a variety of color spaces. Best used with the Preview tool to set correct values. L|match-hist: Adjust the histogram of each color channel in the swapped reconstruction to equal the histogram of the masked area in the original image. L|seamless-clone: Use cv2's seamless clone function to remove extreme gradients at the mask seam by smoothing colors. Generally does not give very satisfactory results. L|none: Don't perform color adjustment.
es: R|Realiza un ajuste de color a la cara intercambiada. Algunas de estas opciones tienen ajustes configurables en '/config/convert.ini' o 'Ajustes > Configurar Extensiones de Conversión': L|avg-color: Ajuste la media de cada canal de color en la reconstrucción intercambiada para igualar la media del área enmascarada en la imagen original. L|color-transfer: Transfiere la distribución del color de la imagen de origen a la de destino utilizando la media y las desviaciones estándar del espacio de color L*a*b*. L|manual-balance: Ajuste manualmente el equilibrio de la imagen en una variedad de espacios de color. Se utiliza mejor con la herramienta de vista previa para establecer los valores correctos. L|match-hist: Ajuste el histograma de cada canal de color en la reconstrucción intercambiada para igualar el histograma del área enmascarada en la imagen original. L|seamless-clone: Utilice la función de clonación sin costuras de cv2 para eliminar los gradientes extremos en la costura de la máscara, suavizando los colores. Generalmente no da resultados muy satisfactorios. L|none: No realice el ajuste de color.
kr: R|스왑된 얼굴의 색상 조정을 수행합니다. 이러한 옵션 중 일부에는 '/config/convert.ini' 또는 '설정 > 변환 플러그인 구성'에서 구성 가능한 설정이 있습니다. L|avg-color: 스왑된 재구성에서 각 색상 채널의 평균이 원본 영상에서 마스킹된 영역의 평균과 동일하도록 조정합니다. L|color-transfer: L*a*b* 색 공간의 평균 및 표준 편차를 사용하여 소스에서 대상 이미지로 색 분포를 전송합니다. L|manual-balance: 다양한 색 공간에서 이미지의 밸런스를 수동으로 조정합니다. 올바른 값을 설정하려면 미리 보기 도구와 함께 사용하는 것이 좋습니다. L|match-hist: 스왑된 재구성에서 각 색상 채널의 히스토그램을 조정하여 원래 영상에서 마스킹된 영역의 히스토그램과 동일하게 만듭니다. L|seamless-clone: cv2의 원활한 복제 기능을 사용하여 색상을 평활화하여 마스크 심에서 극단적인 gradients을 제거합니다. 일반적으로 매우 만족스러운 결과를 제공하지 않습니다. L|none: 색상 조정을 수행하지 않습니다.
ru: R|Производит корректировку цвета поменявшегося лица. Некоторые из этих параметров настраиваются в '/config/convert.ini' или 'Настройки > Настроить плагины конвертации': L|avg-color: корректирует среднее значение каждого цветового канала в реконструкции, чтобы оно было равно среднему значению маскированной области в исходном изображении. L|color-transfer: Переносит распределение цветов с исходного изображения на целевое, используя среднее и стандартные отклонения цветового пространства L*a*b*. L|manual-balance: Ручная настройка баланса изображения в различных цветовых пространствах. Лучше всего использовать с инструментом предварительного просмотра для установки правильных значений. L|match-hist: Настроить гистограмму каждого цветового канала в измененном восстановлении так, чтобы она соответствовала гистограмме маскированной области исходного изображения. L|seamless-clone: Используйте функцию бесшовного клонирования cv2 для удаления экстремальных градиентов на шве маски путем сглаживания цветов. Обычно дает не очень удовлетворительные результаты. L|none: Не выполнять коррекцию цвета.

source: R|Masker to use. NB: The mask you require must exist within the alignments file. You can add additional masks with the Mask Tool. L|none: Don't use a mask. L|bisenet-fp_face: Relatively lightweight NN based mask that provides more refined control over the area to be masked (configurable in mask settings). Use this version of bisenet-fp if your model is trained with 'face' or 'legacy' centering. L|bisenet-fp_head: Relatively lightweight NN based mask that provides more refined control over the area to be masked (configurable in mask settings). Use this version of bisenet-fp if your model is trained with 'head' centering. L|custom_face: Custom user created, face centered mask. L|custom_head: Custom user created, head centered mask. L|components: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks to create a mask. L|extended: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks and the mask is extended upwards onto the forehead. L|vgg-clear: Mask designed to provide smart segmentation of mostly frontal faces clear of obstructions. Profile faces and obstructions may result in sub-par performance. L|vgg-obstructed: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been specifically trained to recognize some facial obstructions (hands and eyeglasses). Profile faces may result in sub-par performance. L|unet-dfl: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been trained by community members and will need testing for further description. Profile faces may result in sub-par performance. L|predicted: If the 'Learn Mask' option was enabled during training, this will use the mask that was created by the trained model.
es: R|Máscara a utilizar. NB: La máscara que necesita debe existir en el archivo de alineaciones. Puede añadir máscaras adicionales con la herramienta de máscaras. L|none: No utilizar una máscara. L|bisenet-fp-face: Máscara relativamente ligera basada en NN que proporciona un control más refinado sobre el área a enmascarar (configurable en la configuración de la máscara). Utilice esta versión de bisenet-fp si su modelo está entrenado con centrado 'face' o 'legacy'. L|bisenet-fp-head: Máscara relativamente ligera basada en NN que proporciona un control más refinado sobre el área a enmascarar (configurable en la configuración de la máscara). Utilice esta versión de bisenet-fp si su modelo está entrenado con centrado de 'cabeza'. L|custom_face: Máscara personalizada creada por el usuario y centrada en el rostro.. L|custom_head: Máscara personalizada centrada en la cabeza creada por el usuario. L|components: Máscara diseñada para proporcionar una segmentación facial basada en el posicionamiento de las ubicaciones de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia para crear una máscara. L|extended: Máscara diseñada para proporcionar una segmentación facial basada en el posicionamiento de las ubicaciones de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia y la máscara se extiende hacia arriba en la frente. L|vgg-clear: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales y libres de obstrucciones. Los rostros de perfil y las obstrucciones pueden dar lugar a un rendimiento inferior. L|vgg-obstructed: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de la máscara ha sido entrenado específicamente para reconocer algunas obstrucciones faciales (manos y gafas). Los rostros de perfil pueden dar lugar a un rendimiento inferior. L|unet-dfl: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de máscara ha sido entrenado por los miembros de la comunidad y necesitará ser probado para una mayor descripción. Los rostros de perfil pueden dar lugar a un rendimiento inferior. L|predicted: Si la opción 'Learn Mask' se habilitó durante el entrenamiento, esto usará la máscara que fue creada por el modelo entrenado.
kr: R|사용할 마스크. NB: 필요한 마스크는 alignments 파일 내에 있어야 합니다. 마스크 도구를 사용하여 마스크를 추가할 수 있습니다. L|none: 마스크 쓰지 마세요. L|bisnet-fp_face: 마스크할 영역을 보다 정교하게 제어할 수 있는 비교적 가벼운 NN 기반 마스크입니다(마스크 설정에서 구성 가능). 모델이 '얼굴' 또는 '레거시' 중심으로 훈련된 경우 이 버전의 bisnet-fp를 사용하십시오. L|bisnet-fp_head: 마스크할 영역을 보다 정교하게 제어할 수 있는 비교적 가벼운 NN 기반 마스크입니다(마스크 설정에서 구성 가능). 모델이 '헤드' 중심으로 훈련된 경우 이 버전의 bisnet-fp를 사용하십시오. L|custom_face: 사용자 지정 사용자가 생성한 얼굴 중심 마스크입니다. L|custom_head: 사용자 지정 사용자가 생성한 머리 중심 마스크입니다. L|components: 특징점 위치의 배치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 특징점의 외부에는 마스크를 만들기 위해 convex hull가 형성되어 있습니다. L|extended: 특징점 위치의 배치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 지형지물의 외부에는 convex hull가 형성되어 있으며, 마스크는 이마 위로 뻗어 있습니다. L|vgg-clear: 대부분의 정면에 장애물이 없는 스마트한 분할을 제공하도록 설계된 마스크입니다. 옆 얼굴 및 장애물로 인해 성능이 저하될 수 있습니다. L|vgg-obstructed: 대부분의 정면 얼굴을 스마트하게 분할할 수 있도록 설계된 마스크입니다. 마스크 모델은 일부 안면 장애물(손과 안경)을 인식하도록 특별히 훈련되었습니다. 옆 얼굴은 평균 이하의 성능을 초래할 수 있습니다. L|unet-dfl: 대부분 정면 얼굴을 스마트하게 분할하도록 설계된 마스크. 마스크 모델은 커뮤니티 구성원들에 의해 훈련되었으며 추가 설명을 위해 테스트가 필요하다. 옆 얼굴은 평균 이하의 성능을 초래할 수 있습니다. L|predicted: 교육 중에 'Learn Mask(마스크 학습)' 옵션이 활성화된 경우에는 교육을 받은 모델이 만든 마스크가 사용됩니다.
ru: R|Маскер для использования. Примечание: Нужная маска должна существовать в файле выравнивания. Вы можете добавить дополнительные маски с помощью инструмента Mask Tool. L|none: Не использовать маску. L|bisenet-fp_face: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью (настраивается в настройках маски). Используйте эту версию bisenet-fp, если ваша модель обучена с центрированием 'face' или 'legacy'. L|bisenet-fp_head: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью (настраивается в настройках маски). Используйте эту версию bisenet-fp, если ваша модель обучена с центрированием по "голове". L|custom_face: Пользовательская маска, созданная пользователем и центрированная по лицу. L|custom_head: Созданная пользователем маска, центрированная по голове. L|components: Маска, разработанная для сегментации лица на основе расположения ориентиров. Для создания маски вокруг внешних ориентиров строится выпуклая оболочка. L|extended: Маска, предназначенная для сегментации лица на основе расположения ориентиров. Выпуклый корпус строится вокруг внешних ориентиров, и маска расширяется вверх на лоб. L|vgg-clear: Маска предназначена для интеллектуальной сегментации преимущественно фронтальных лиц без препятствий. Профильные лица и препятствия могут привести к снижению производительности. L|vgg-obstructed: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была специально обучена распознавать некоторые препятствия на лице (руки и очки). Лица в профиль могут иметь низкую производительность. L|unet-dfl: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была обучена членами сообщества и для дальнейшего описания нуждается в тестировании. Профильные лица могут привести к низкой производительности. L|predicted: Если во время обучения была включена опция 'Изучить Маску', то будет использоваться маска, созданная обученной моделью.

source: R|The plugin to use to output the converted images. The writers are configurable in '/config/convert.ini' or 'Settings > Configure Convert Plugins:' L|ffmpeg: [video] Writes out the convert straight to video. When the input is a series of images then the '-ref' (--reference-video) parameter must be set. L|gif: [animated image] Create an animated gif. L|opencv: [images] The fastest image writer, but less options and formats than other plugins. L|patch: [images] Outputs the raw swapped face patch, along with the transformation matrix required to re-insert the face back into the original frame. Use this option if you wish to post-process and composite the final face within external tools. L|pillow: [images] Slower than opencv, but has more options and supports more formats.
es: R|El plugin a utilizar para dar salida a las imágenes convertidas. Los escritores son configurables en '/config/convert.ini' o 'Ajustes > Configurar Extensiones de Conversión:' L|ffmpeg: [video] Escribe la conversión directamente en vídeo. Cuando la entrada es una serie de imágenes, el parámetro '-ref' (--reference-video) debe ser establecido. L|gif: [imagen animada] Crea un gif animado. L|opencv: [images] El escritor de imágenes más rápido, pero con menos opciones y formatos que otros plugins. L|patch: [images] Genera el parche de cara intercambiado sin formato, junto con la matriz de transformación necesaria para volver a insertar la cara en el marco original. L|pillow: [images] Más lento que opencv, pero tiene más opciones y soporta más formatos.
kr: R|변환된 이미지를 출력하는 데 사용할 플러그인입니다. 기록 장치는 '/config/convert.ini' 또는 '설정 > 변환 플러그인 구성:'에서 구성할 수 있습니다. L|ffmpeg: [video] 변환된 결과를 바로 video로 씁니다. 입력이 영상 시리즈인 경우 '-ref'(--reference-video) 파라미터를 설정해야 합니다. L|gif : [애니메이션 이미지] 애니메이션 gif를 만듭니다. L|opencv: [이미지] 가장 빠른 이미지 작성기이지만 다른 플러그인에 비해 옵션과 형식이 적습니다. L|patch: [이미지] 원래 프레임에 얼굴을 다시 삽입하는 데 필요한 변환 행렬과 함께 원시 교체된 얼굴 패치를 출력합니다. L|pillow: [images] opencv보다 느리지만 더 많은 옵션이 있고 더 많은 형식을 지원합니다.

source: Frame Processing
es: Proceso de fotogramas
kr: 프레임 처리
ru: Обработка лиц

source: Scale the final output frames by this amount. 100%% will output the frames at source dimensions. 50%% at half size 200%% at double size
es: Escala los fotogramas finales de salida en esta cantidad. 100%% dará salida a los fotogramas a las dimensiones de origen. 50%% a la mitad de tamaño. 200%% al doble de tamaño
kr: 최종 출력 프레임의 크기를 이 양만큼 조정합니다. 100%%는 원본의 차원에서 프레임을 출력합니다. 50%%는 절반 크기에서, 200%%는 두 배 크기에서
ru: Масштабирование конечных выходных кадров на эту величину. 100%% выводит кадры в исходном размере. 50%% при половинном размере 200%% при двойном размере

source: Frame ranges to apply transfer to e.g. For frames 10 to 50 and 90 to 100 use --frame-ranges 10-50 90-100. Frames falling outside of the selected range will be discarded unless '-k' (--keep-unchanged) is selected. NB: If you are converting from images, then the filenames must end with the frame-number!
es: Rangos de fotogramas a los que aplicar la transferencia, por ejemplo, para los fotogramas de 10 a 50 y de 90 a 100 utilice --frame-ranges 10-50 90-100. Los fotogramas que queden fuera del rango seleccionado se descartarán a menos que se seleccione '-k' (--keep-unchanged). Nota: Si está convirtiendo imágenes, ¡los nombres de los archivos deben terminar con el número de fotograma!
kr: 예를 들어 전송을 적용할 프레임 범위 프레임 10 - 50 및 90 - 100의 경우 --frame-ranges 10-50 90-100을 사용합니다. '-k'(--keep-unchanged)를 선택하지 않으면 선택한 범위를 벗어나는 프레임이 삭제됩니다. NB: 이미지에서 변환하는 경우 파일 이름은 프레임 번호로 끝나야 합니다!
ru: Диапазоны кадров для применения переноса, например, для кадров с 10 по 50 и с 90 по 100 используйте --frame-ranges 10-50 90-100. Кадры, выходящие за пределы выбранного диапазона, будут отброшены, если не выбрана опция '-k' (--keep-unchanged). Примечание: Если вы конвертируете из изображений, то имена файлов должны заканчиваться номером кадра!

source: Scale the swapped face by this percentage. Positive values will enlarge the face, Negative values will shrink the face.
es: Escale la cara intercambiada según este porcentaje. Los valores positivos agrandarán la cara, los valores negativos la reducirán.
kr: 이 백분율로 교체된 면의 크기를 조정합니다. 양수 값은 얼굴을 확대하고, 음수 값은 얼굴을 축소합니다.

source: If you have not cleansed your alignments file, then you can filter out faces by defining a folder here that contains the faces extracted from your input files/video. If this folder is defined, then only faces that exist within your alignments file and also exist within the specified folder will be converted. Leaving this blank will convert all faces that exist within the alignments file.
es: Si no ha limpiado su archivo de alineaciones, puede filtrar las caras definiendo aquí una carpeta que contenga las caras extraídas de sus archivos/vídeos de entrada. Si se define esta carpeta, sólo se convertirán las caras que existan en el archivo de alineaciones y también en la carpeta especificada. Si se deja en blanco, se convertirán todas las caras que existan en el archivo de alineaciones.
kr: 만약 alignments 파일을 지우지 않은 경우 입력 파일/비디오에서 추출된 얼굴이 포함된 폴더를 정의하여 얼굴을 걸러낼 수 있습니다. 이 폴더가 정의된 경우 alignments 파일 내에 존재하거나 지정된 폴더 내에 존재하는 얼굴만 변환됩니다. 이 항목을 공백으로 두면 alignments 파일 내에 있는 모든 얼굴이 변환됩니다.
ru: Если вы не очистили свой файл выравнивания, то вы можете отфильтровать лица, определив здесь папку, содержащую лица, извлеченные из ваших входных файлов/видео. Если эта папка определена, то будут преобразованы только те лица, которые существуют в вашем файле выравнивания, а также в указанной папке. Если оставить этот параметр пустым, будут преобразованы все лица, существующие в файле выравнивания.
