Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/lib.cli.args.po
Languages: es, kr, ru

source: Optionally filter out people who you do not wish to process by passing in an image of that person. Should be a front portrait with a single person in the image. Multiple images can be added space separated. NB: Using face filter will significantly decrease extraction speed and its accuracy cannot be guaranteed.
es: Opcionalmente, puede filtrar las personas que no desea procesar pasando una imagen de esa persona. Debe ser un retrato frontal con una sola persona en la imagen. Se pueden añadir varias imágenes separadas por espacios. NB: El uso del filtro de caras disminuirá significativamente la velocidad de extracción y no se puede garantizar su precisión.
kr: 선택적으로 처리하고 싶지 않은 사람의 이미지를 전달하여 그 사람을 걸러낼 수 있습니다. 이미지는 한 사람의 정면 모습이여야 합니다. 여러 이미지를 공백으로 구분하여 추가할 수 있습니다. 주의: 얼굴 필터를 사용하면 추출 속도가 현저히 감소하므로 정확성을 보장할 수 없습니다.
ru: По желанию отфильтровать людей, которых вы не хотите обрабатывать, передав изображение этого человека. Это должен быть фронтальный портрет с изображением одного человека. Можно добавить несколько изображений, разделенных пробелами. Примечание: Использование фильтра лиц значительно снизит скорость извлечения, а его точность не гарантируется.

source: Optionally select people you wish to process by passing in an image of that person. Should be a front portrait with a single person in the image. Multiple images can be added space separated. NB: Using face filter will significantly decrease extraction speed and its accuracy cannot be guaranteed.
es: Opcionalmente, seleccione las personas que desea procesar pasando una imagen de esa persona. Debe ser un retrato frontal con una sola persona en la imagen. Se pueden añadir varias imágenes separadas por espacios. NB: El uso del filtro facial disminuirá significativamente la velocidad de extracción y no se puede garantizar su precisión.
kr: 선택적으로 해당 사용자의 이미지를 전달하여 처리할 사용자를 선택합니다. 이미지에 한 사람이 있는 정면 초상화여야 합니다. 여러 이미지를 공백으로 구분하여 추가할 수 있습니다. 주의: 얼굴 필터를 사용하면 추출 속도가 현저히 감소하므로 정확성을 보장할 수 없습니다.
ru: По желанию выберите людей, которых вы хотите обработать, передав изображение этого человека. Это должен быть фронтальный портрет с изображением одного человека. Можно добавить несколько изображений, разделенных пробелами. Примечание: Использование фильтра лиц значительно снизит скорость извлечения, а его точность не гарантируется.

source: For use with the optional nfilter/filter files. Threshold for positive face recognition. Lower values are stricter. NB: Using face filter will significantly decrease extraction speed and its accuracy cannot be guaranteed.
es: Para usar con los archivos opcionales nfilter/filter. Umbral para el reconocimiento positivo de caras. Los valores más bajos son más estrictos. NB: El uso del filtro facial disminuirá significativamente la velocidad de extracción y no se puede garantizar su precisión.
kr: 옵션인 nfilter/filter 파일을 함께 사용합니다. 긍정적인 얼굴 인식을 위한 임계값. 낮은 값이 더 엄격합니다. 주의: 얼굴 필터를 사용하면 추출 속도가 현저히 감소하므로 정확성을 보장할 수 없습니다.
ru: Для использования с дополнительными файлами nfilter/filter. Порог для положительного распознавания лиц. Более низкие значения являются более строгими. Примечание: Использование фильтра лиц значительно снизит скорость извлечения, а его точность не гарантируется.

source: The maximum number of parallel processes for performing conversion. Converting images is system RAM heavy so it is possible to run out of memory if you have a lot of processes and not enough RAM to accommodate them all. Setting this to 0 will use the maximum available. No matter what you set this to, it will never attempt to use more processes than are available on your system. If singleprocess is enabled this setting will be ignored.
es: El número máximo de procesos paralelos para realizar la conversión. La conversión de imágenes requiere mucha RAM del sistema, por lo que es posible que se agote la memoria si tiene muchos procesos y no hay suficiente RAM para acomodarlos a todos. Si se ajusta a 0, se utilizará el máximo disponible. No importa lo que establezca, nunca intentará utilizar más procesos que los disponibles en su sistema. Si 'singleprocess' está habilitado, este ajuste será ignorado.
kr: 변환을 수행하기 위한 최대 병렬 프로세스 수입니다. 이미지 변환은 시스템 RAM에 부담이 크기 때문에 프로세스가 많고 모든 프로세스를 수용할 RAM이 충분하지 않은 경우 메모리가 부족할 수 있습니다. 이것을 0으로 설정하면 사용 가능한 최대값을 사용합니다. 얼마를 설정하든 시스템에서 사용 가능한 것보다 더 많은 프로세스를 사용하려고 시도하지 않습니다. 단일 프로세스가 활성화된 경우 이 설정은 무시됩니다.
ru: Максимальное количество параллельных процессов для выполнения конвертации. Конвертирование изображений занимает много системной оперативной памяти, поэтому может закончиться память, если у вас много процессов и недостаточно оперативной памяти для их размещения. Если установить значение 0, будет использован максимум доступной памяти. Независимо от того, какое значение вы установите, программа никогда не будет пытаться использовать больше процессов, чем доступно в вашей системе. Если включена однопоточная обработка, этот параметр будет проигнорирован.

source: [LEGACY] This only needs to be selected if a legacy model is being loaded or if there are multiple models in the model folder
es: [LEGACY] Sólo es necesario seleccionar esta opción si se está cargando un modelo heredado si hay varios modelos en la carpeta de modelos
kr: [LEGACY] 이것은 레거시 모델을 로드 중이거나 모델 폴더에 여러 모델이 있는 경우에만 선택되어야 합니다
ru: [ОТБРОШЕН] Этот параметр необходимо выбрать только в том случае, если загружается устаревшая модель или если в папке моделей имеется несколько моделей

source: Enable On-The-Fly Conversion. NOT recommended. You should generate a clean alignments file for your destination video. However, if you wish you can generate the alignments on-the-fly by enabling this option. This will use an inferior extraction pipeline and will lead to substandard results. If an alignments file is found, this option will be ignored.
es: Activar la conversión sobre la marcha. NO se recomienda. Debe generar un archivo de alineación limpio para su vídeo de destino. Sin embargo, si lo desea, puede generar las alineaciones sobre la marcha activando esta opción. Esto utilizará una tubería de extracción inferior y conducirá a resultados de baja calidad. Si se encuentra un archivo de alineaciones, esta opción será ignorada.
kr: 실시간 변환을 활성화합니다. 권장하지 않습니다. 당신은 변환 비디오에 대한 깨끗한 alignments 파일을 생성해야 합니다. 그러나 원하는 경우 이 옵션을 활성화하여 즉시 alignments 파일을 생성할 수 있습니다. 이것은 안좋은 추출 과정을 사용하고 표준 이하의 결과로 이어질 것입니다. alignments 파일이 발견되면 이 옵션은 무시됩니다.
ru: Включить преобразование "на лету". НЕ рекомендуется. Вы должны сгенерировать чистый файл выравнивания для конечного видео. Однако при желании вы можете генерировать выравнивания "на лету", включив эту опцию. При этом будет использоваться некачественный конвейер извлечения, что приведет к некачественным результатам. Если файл выравнивания найден, этот параметр будет проигнорирован.

source: When used with --frame-ranges outputs the unchanged frames that are not processed instead of discarding them.
es: Cuando se usa con --frame-ranges, la salida incluye los fotogramas no procesados en vez de descartarlos.
kr: 사용시 --frame-ranges 인자를 사용하면 변경되지 않은 프레임을 버리지 않은 결과가 출력됩니다.
ru: При использовании с --frame-ranges выводит неизмененные кадры, которые не были обработаны, вместо того, чтобы отбрасывать их.

source: Swap the model. Instead converting from of A -> B, converts B -> A
es: Intercambiar el modelo. En vez de convertir de A a B, convierte de B a A
kr: 모델을 바꿉니다. A -> B에서 변환하는 대신 B -> A로 변환
ru: Поменять модель местами. Вместо преобразования из A -> B, преобразуется B -> A

source: Disable multiprocessing. Slower but less resource intensive.
es: Desactiva el multiproceso. Es más lento, pero usa menos recursos.
kr: 멀티프로세싱을 쓰지 않습니다. 느리지만 자원을 덜 소모합니다.
ru: Отключите многопоточную обработку. Медленнее, но менее ресурсоемко.

source: Train a model on extracted original (A) and swap (B) faces. Training models can take a long time. Anything from 24hrs to over a week Model plugins can be configured in the 'Settings' Menu
es: Entrene un modelo con las caras originales (A) e intercambiadas (B) extraídas. El entrenamiento de los modelos puede llevar mucho tiempo. Desde 24 horas hasta más de una semana. Los plugins de los modelos pueden configurarse en el menú "Ajustes"
kr: 추출된 원래(A) 얼굴과 스왑(B) 얼굴에 대한 모델을 훈련합니다. 모델을 훈련하는 데 시간이 오래 걸릴 수 있습니다. 24시간에서 일주일 이상의 시간이 필요합니다. 모델 플러그인은 '설정' 메뉴에서 구성할 수 있습니다
ru: Обучить модель на извлеченных оригинальных (A) и подмененных (B) лицах. Обучение моделей может занять много времени. От 24 часов до недели. Плагины для моделей можно настроить в меню "Настройки"

source: faces
es: caras
kr: 얼굴들
ru: лица

source: Input directory. A directory containing training images for face A. This is the original face, i.e. the face that you want to remove and replace with face B.
es: Directorio de entrada. Un directorio que contiene imágenes de entrenamiento para la cara A. Esta es la cara original, es decir, la cara que se quiere eliminar y sustituir por la cara B.
kr: 입력 디렉토리. 얼굴 A에 대한 훈련 이미지가 포함된 디렉토리입니다. 이것은 원래 얼굴, 즉 제거하고 B 얼굴로 대체하려는 얼굴입니다.
ru: Входная папка. Папка, содержащая обучающие изображения для лица A. Это исходное лицо, т.е. лицо, которое вы хотите удалить и заменить лицом B.

source: Input directory. A directory containing training images for face B. This is the swap face, i.e. the face that you want to place onto the head of person A.
es: Directorio de entrada. Un directorio que contiene imágenes de entrenamiento para la cara B. Esta es la cara de intercambio, es decir, la cara que se quiere colocar en la cabeza de la persona A.
kr: 입력 디렉터리. 얼굴 B에 대한 훈련 이미지를 포함하는 디렉토리. 이것은 대체 얼굴, 즉 사람 A의 얼굴 앞에 배치하려는 얼굴이다.
ru: Входная папка. Папка, содержащая обучающие изображения для лица B. Это подменное лицо, т.е. лицо, которое вы хотите поместить на голову человека A.

source: model
es: modelo
kr: 모델
ru: модель

source: Model directory. This is where the training data will be stored. You should always specify a new folder for new models. If starting a new model, select either an empty folder, or a folder which does not exist (which will be created). If continuing to train an existing model, specify the location of the existing model.
es: Directorio del modelo. Aquí es donde se almacenarán los datos de entrenamiento. Siempre debe especificar una nueva carpeta para los nuevos modelos. Si se inicia un nuevo modelo, seleccione una carpeta vacía o una carpeta que no exista (que se creará). Si continúa entrenando un modelo existente, especifique la ubicación del modelo existente.
kr: 모델 디렉토리. 여기에 훈련 데이터가 저장됩니다. 새 모델의 경우 항상 새 폴더를 지정해야 합니다. 새 모델을 시작할 경우 빈 폴더 또는 존재하지 않는 폴더(생성될 폴더)를 선택합니다. 기존 모델을 계속 학습하는 경우 기존 모델의 위치를 지정합니다.
ru: Папка модели. Здесь будут храниться данные для обучения. Для новых моделей всегда следует указывать новую папку. Если вы начинаете новую модель, выберите либо пустую папку, либо несуществующую папку (которая будет создана). Если вы продолжаете обучение существующей модели, укажите местоположение существующей модели.

source: R|Load the weights from a pre-existing model into a newly created model. For most models this will load weights from the Encoder of the given model into the encoder of the newly created model. Some plugins may have specific configuration options allowing you to load weights from other layers. Weights will only be loaded when creating a new model. This option will be ignored if you are resuming an existing model. Generally you will also want to 'freeze-weights' whilst the rest of your model catches up with your Encoder. NB: Weights can only be loaded from models of the same plugin as you intend to train.
es: R|Cargue los pesos de un modelo preexistente en un modelo recién creado. Para la mayoría de los modelos, esto cargará pesos del codificador del modelo dado en el codificador del modelo recién creado. Algunos complementos pueden tener opciones de configuración específicas que le permiten cargar pesos de otras capas. Los pesos solo se cargarán al crear un nuevo modelo. Esta opción se ignorará si está reanudando un modelo existente. En general, también querrá 'congelar pesos' mientras el resto de su modelo se pone al día con su codificador. NB: Los pesos solo se pueden cargar desde modelos del mismo complemento que desea entrenar.
kr: R|기존 모델의 가중치를 새로 생성된 모델로 로드합니다. 대부분의 모델에서는 주어진 모델의 인코더에서 새로 생성된 모델의 인코더로 가중치를 로드합니다. 일부 플러그인에는 다른 층에서 가중치를 로드할 수 있는 특정 구성 옵션이 있을 수 있습니다. 가중치는 새 모델을 생성할 때만 로드됩니다. 기존 모델을 재개하는 경우 이 옵션은 무시됩니다. 일반적으로 나머지 모델이 인코더를 따라잡는 동안에도 '가중치 동결'이 필요합니다. 주의: 가중치는 훈련하려는 플러그인 모델에서만 로드할 수 있습니다.
ru: R|Загрузить веса из уже существующей модели во вновь созданную модель. Для большинства моделей это означает загрузку весов из кодировщика данной модели в кодировщик вновь создаваемой модели. Некоторые плагины могут иметь специальные параметры конфигурации, позволяющие загружать веса из других слоев. Веса будут загружаться только при создании новой модели. Эта опция будет проигнорирована, если вы возобновляете существующую модель. Обычно также требуется "заморозить" веса, пока остальная часть модели догоняет кодировщик. Примечание: Веса могут быть загружены только из моделей того же плагина, который вы собираетесь обучать.

source: R|Select which trainer to use. Trainers can be configured from the Settings menu or the config folder. L|original: The original model created by /u/deepfakes. L|dfaker: 64px in/128px out model from dfaker. Enable 'warp-to-landmarks' for full dfaker method. L|dfl-h128: 128px in/out model from deepfacelab L|dfl-sae: Adaptable model from deepfacelab L|dlight: A lightweight, high resolution DFaker variant. L|iae: A model that uses intermediate layers to try to get better details L|lightweight: A lightweight model for low-end cards. Don't expect great results. Can train as low as 1.6GB with batch size 8. L|realface: A high detail, dual density model based on DFaker, with customizable in/out resolution. The autoencoders are unbalanced so B>A swaps won't work so well. By andenixa et al. Very configurable. L|unbalanced: 128px in/out model from andenixa. The autoencoders are unbalanced so B>A swaps won't work so well. Very configurable. L|villain: 128px in/out model from villainguy. Very resource hungry (You will require a GPU with a fair amount of VRAM). Good for details, but more susceptible to color differences.
es: R|Seleccione el entrenador que desea utilizar. Los entrenadores se pueden configurar desde el menú de configuración o la carpeta de configuración. L|original: El modelo original creado por /u/deepfakes. L|dfaker: Modelo de 64px in/128px out de dfaker. Habilitar 'warp-to-landmarks' para el método completo de dfaker. L|dfl-h128: modelo de 128px in/out de deepfacelab L|dfl-sae: Modelo adaptable de deepfacelab L|dlight: Una variante de DFaker ligera y de alta resolución. L|iae: Un modelo que utiliza capas intermedias para tratar de obtener mejores detalles. L|lightweight: Un modelo ligero para tarjetas de gama baja. No esperes grandes resultados. Puede entrenar hasta 1,6GB con tamaño de lote 8. L|realface: Un modelo de alto detalle y doble densidad basado en DFaker, con resolución de entrada y salida personalizable. Los autocodificadores están desequilibrados, por lo que los intercambios B>A no funcionan tan bien. Por andenixa et al. Muy configurable L|Unbalanced: modelo de 128px de entrada/salida de andenixa. Los autocodificadores están desequilibrados por lo que los intercambios B>A no funcionarán tan bien. Muy configurable L|villain: Modelo de 128px de entrada/salida de villainguy. Requiere muchos recursos (se necesita una GPU con una buena cantidad de VRAM). Bueno para los detalles, pero más susceptible a las diferencias de color.
kr: R|사용할 훈련 모델을 선택합니다. 훈련 모델은 설정 메뉴 또는 구성 폴더에서 구성할 수 있습니다. L|original: /u/deepfakes로 만든 원래 모델입니다. L|dfaker: 64px in/128px out 모델 from dfaker. Full dfaker 메서드에 대해 '특징점으로 변환'를 활성화합니다. L|dfl-h128: Deepfake lab의 128px in/out 모델 L|dfl-sae: Deepface Lab의 적응형 모델 L|dlight: 경량, 고해상도 DFaker 변형입니다. L|iae: 중간 층들을 사용하여 더 나은 세부 정보를 얻기 위해 노력하는 모델. L|lightweight: 저가형 카드용 경량 모델. 좋은 결과를 기대하지 마세요. 최대한 낮게 잡아서 배치 사이즈 8에 1.6GB까지 훈련이 가능합니다. L|realface: DFaker를 기반으로 한 높은 디테일의 이중 밀도 모델로, 사용자 정의 가능한 입/출력 해상도를 제공합니다. 오토인코더가 불균형하여 B>A 스왑이 잘 작동하지 않습니다. Andenixa 등에 의해. 매우 구성 가능합니다. L|unbalanced: andenixa의 128px in/out 모델. 오토인코더가 불균형하여 B>A 스왑이 잘 작동하지 않습니다. 매우 구성 가능합니다. L|villain : villainguy의 128px in/out 모델. 리소스가 매우 부족합니다( 상당한 양의 VRAM이 있는 GPU가 필요합니다). 세부 사항에는 좋지만 색상 차이에 더 취약합니다.
ru: R|Выберите, какой тренажер использовать. Тренажеры можно настроить в меню "Настройки" или в папке config. L|original: Оригинальная модель, созданная /u/deepfakes. L|dfaker: модель 64px вход/ 128px выход от dfaker. Включите 'warp-to-landmarks' для полного метода dfaker. L|dfl-h128: модель 128px вход/выход от deepfacelab L|dfl-sae: Адаптируемая модель от deepfacelab L|dlight: Легкий вариант DFaker с высоким разрешением. L|iae: Модель, использующая промежуточные слои для получения лучших деталей. L|lightweight: Облегченная модель для карт низкого класса. Не ожидайте высоких результатов. Может обучаться на 1,6 ГБ при размере пачки 8. L|realface: Модель с высокой детализацией и двойной плотностью, основанная на DFaker, с настраиваемым разрешением входа/выхода. Автоэнкодеры несбалансированы, поэтому замены B>A не будут работать так хорошо. Автор andenixa и др. Очень настраиваемая. L|unbalanced: модель 128px вход/выход от andenixa. Автокодировщики несбалансированы, поэтому замены B>A не будут работать так хорошо. Очень настраиваемая. L|villain: модель 128px вход/выход от villainguy. Очень требовательна к ресурсам (вам потребуется GPU с достаточным количеством VRAM). Хороша для детализации, но более восприимчива к цветовым различиям.

source: Output a summary of the model and exit. If a model folder is provided then a summary of the saved model is displayed. Otherwise a summary of the model that would be created by the chosen plugin and configuration settings is displayed.
es: Genere un resumen del modelo y salga. Si se proporciona una carpeta de modelo, se muestra un resumen del modelo guardado. De lo contrario, se muestra un resumen del modelo que crearía el complemento elegido y los ajustes de configuración.
kr: 모델 요약을 출력하고 종료합니다. 모델 폴더가 제공되면 저장된 모델의 요약이 표시됩니다. 그렇지 않으면 선택한 플러그인 및 구성 설정에 의해 생성되는 모델 요약이 표시됩니다.
ru: Вывести сводку модели и выйти. Если указана папка модели, то выводится сводка сохраненной модели. В противном случае отображается сводка модели, которая будет создана выбранным плагином и настройками конфигурации.

source: Freeze the weights of the model. Freezing weights means that some of the parameters in the model will no longer continue to learn, but those that are not frozen will continue to learn. For most models, this will freeze the encoder, but some models may have configuration options for freezing other layers.
es: Congele los pesos del modelo. Congelar pesos significa que algunos de los parámetros del modelo ya no seguirán aprendiendo, pero los que no están congelados seguirán aprendiendo. Para la mayoría de los modelos, esto congelará el codificador, pero algunos modelos pueden tener opciones de configuración para congelar otras capas.
kr: 모델의 가중치를 동결합니다. 가중치를 고정하면 모델의 일부 매개변수가 더 이상 학습되지 않지만 고정되지 않은 매개변수는 계속 학습됩니다. 대부분의 모델에서 이렇게 하면 인코더가 고정되지만 일부 모델에는 다른 레이어를 고정하기 위한 구성 옵션이 있을 수 있습니다.
ru: Заморозить веса модели. Замораживание весов означает, что некоторые параметры в модели больше не будут продолжать обучение, но те, которые не заморожены, будут продолжать обучение. Для большинства моделей это означает замораживание кодера, но некоторые модели могут иметь опции конфигурации для замораживания других слоев.

source: training
es: entrenamiento
kr: 훈련
ru: тренировка

source: Batch size. This is the number of images processed through the model for each side per iteration. NB: As the model is fed 2 sides at a time, the actual number of images within the model at any one time is double the number that you set here. Larger batches require more GPU RAM.
es: Tamaño del lote. Este es el número de imágenes procesadas a través del modelo para cada lado por iteración. Nota: Como el modelo se alimenta de 2 lados a la vez, el número real de imágenes dentro del modelo en cualquier momento es el doble del número que se establece aquí. Los lotes más grandes requieren más RAM de la GPU.
kr: 배치 크기. 반복당 각 측면에 대해 모델을 통해 처리되는 이미지 수입니다. NB: 한 번에 모델에게 2개의 측면이 공급되므로 한 번에 모델 내의 실제 이미지 수는 여기에서 설정한 수의 두 배입니다. 더 큰 배치에는 더 많은 GPU RAM이 필요합니다.
ru: Размер пачки. Это количество изображений, обрабатываемых моделью для каждой стороны за итерацию. Примечание: Поскольку модель обрабатывает 2 стороны одновременно, фактическое количество изображений в модели в любой момент времени будет вдвое больше, чем заданное здесь. Большие партии требуют больше оперативной памяти GPU.

source: Length of training in iterations. This is only really used for automation. There is no 'correct' number of iterations a model should be trained for. You should stop training when you are happy with the previews. However, if you want the model to stop automatically at a set number of iterations, you can set that value here.
es: Duración del entrenamiento en iteraciones. Esto sólo se utiliza realmente para la automatización. No hay un número 'correcto' de iteraciones para las que deba entrenarse un modelo. Debe dejar de entrenar cuando esté satisfecho con las previsiones. Sin embargo, si desea que el modelo se detenga automáticamente en un número determinado de iteraciones, puede establecer ese valor aquí.
kr: 반복에서 훈련 길이. 이것은 실제로 자동화에만 사용됩니다. 모델을 훈련해야 하는 '올바른' 반복 횟수는 없습니다. 미리 보기에 만족하면 훈련을 중단해야 합니다. 그러나 설정된 반복 횟수에서 모델이 자동으로 중지되도록 하려면 여기에서 해당 값을 설정할 수 있습니다.
ru: Продолжительность обучения в итерациях. Этот параметр действительно используется только для автоматизации. Не существует "правильного" количества итераций, за которое следует обучить модель. Вы должны прекратить обучение, когда будете удовлетворены предварительным просмотром. Однако если вы хотите, чтобы модель автоматически останавливалась при определенном количестве итераций, вы можете задать это значение здесь.
