Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/lib.cli.args.po
Languages: es, kr, ru

source: R|Select the distribution stategy to use. L|default: Use Tensorflow's default distribution strategy. L|central-storage: Centralizes variables on the CPU whilst operations are performed on 1 or more local GPUs. This can help save some VRAM at the cost of some speed by not storing variables on the GPU. Note: Mixed-Precision is not supported on multi-GPU setups. L|mirrored: Supports synchronous distributed training across multiple local GPUs. A copy of the model and all variables are loaded onto each GPU with batches distributed to each GPU at each iteration.
es: 562 / 5,000 Translation results R|Seleccione la estrategia de distribución a utilizar. L|default: utiliza la estrategia de distribución predeterminada de Tensorflow. L|central-storage: centraliza las variables en la CPU mientras que las operaciones se realizan en 1 o más GPU locales. Esto puede ayudar a ahorrar algo de VRAM a costa de cierta velocidad al no almacenar variables en la GPU. Nota: Mixed-Precision no es compatible con configuraciones de múltiples GPU. L|mirrored: Admite el entrenamiento distribuido síncrono en varias GPU locales. Se carga una copia del modelo y todas las variables en cada GPU con lotes distribuidos a cada GPU en cada iteración.
kr: R|사용할 배포 상태를 선택합니다. L|default: Tensorflow의 기본 배포 전략을 사용합니다. L|central-storage: 작업이 1개 이상의 로컬 GPU에서 수행되는 동안 CPU의 변수를 중앙 집중화합니다. 이렇게 하면 GPU에 변수를 저장하지 않음으로써 약간의 속도를 희생하여 일부 VRAM을 절약할 수 있습니다. 참고: 다중 정밀도는 다중 GPU 설정에서 지원되지 않습니다. L|mirrored: 여러 로컬 GPU에서 동기화 분산 훈련을 지원합니다. 모델의 복사본과 모든 변수는 각 반복에서 각 GPU에 배포된 배치들와 함께 각 GPU에 로드됩니다.
ru: R|Выберите стратегию распределения для использования. L|default: Использовать стратегию распространения Tensorflow по умолчанию. L|central-storage: Централизует переменные на CPU, в то время как операции выполняются на 1 или более локальных GPU. Это может помочь сэкономить немного VRAM за счет некоторой скорости, поскольку переменные не хранятся на GPU. Примечание: Mixed-Precision не поддерживается на многопроцессорных установках. L|mirrored: Поддерживает синхронное распределенное обучение на нескольких локальных GPU. Копия модели и все переменные загружаются на каждый GPU с распределением партий на каждый GPU на каждой итерации.

source: Disables TensorBoard logging. NB: Disabling logs means that you will not be able to use the graph or analysis for this session in the GUI.
es: Desactiva el registro de TensorBoard. NB: Desactivar los registros significa que no podrá utilizar el gráfico o el análisis de esta sesión en la GUI.
kr: 텐서보드 로깅을 비활성화합니다. 주의: 로그를 비활성화하면 GUI에서 이 세션에 대한 그래프 또는 분석을 사용할 수 없습니다.
ru: Отключает ведение журналов TensorBoard. Примечание: Отключение ведения журналов означает, что вы не сможете использовать график или анализ для этой сессии в графическом интерфейсе.

source: Use the Learning Rate Finder to discover the optimal learning rate for training. For new models, this will calculate the optimal learning rate for the model. For existing models this will use the optimal learning rate that was discovered when initializing the model. Setting this option will ignore the manually configured learning rate (configurable in train settings).
es: Utilice el Buscador de tasa de aprendizaje para descubrir la tasa de aprendizaje óptima para la capacitación. Para modelos nuevos, esto calculará la tasa de aprendizaje óptima para el modelo. Para los modelos existentes, esto utilizará la tasa de aprendizaje óptima que se descubrió al inicializar el modelo. Configurar esta opción ignorará la tasa de aprendizaje configurada manualmente (configurable en la configuración del tren).
kr: 학습률 찾기를 사용하여 훈련을 위한 최적의 학습률을 찾아보세요. 새 모델의 경우 모델에 대한 최적의 학습률을 계산합니다. 기존 모델의 경우 모델을 초기화할 때 발견된 최적의 학습률을 사용합니다. 이 옵션을 설정하면 수동으로 구성된 학습률(기차 설정에서 구성 가능)이 무시됩니다.

source: Saving
es: Guardar
kr: 저장
ru: Сохранение

source: Sets the number of iterations between each model save.
es: Establece el número de iteraciones entre cada guardado del modelo.
kr: 각 모델 저장 사이의 반복 횟수를 설정합니다.
ru: Устанавливает количество итераций между каждым сохранением модели.

source: Sets the number of iterations before saving a backup snapshot of the model in it's current state. Set to 0 for off.
es: Establece el número de iteraciones antes de guardar una copia de seguridad del modelo en su estado actual. Establece 0 para que esté desactivado.
kr: 현재 상태에서 모델의 백업 스냅샷을 저장하기 전에 반복할 횟수를 설정합니다. 0으로 설정하면 꺼집니다.
ru: Устанавливает количество итераций между каждым сохранением модели. Устанавливает количество итераций перед сохранением резервного снимка модели в текущем состоянии. Установите значение 0 для выключения.

source: timelapse
es: intervalo
kr: 타임랩스
ru: таймлапс

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. This should be the input folder of 'A' faces that you would like to use for creating the timelapse. You must also supply a --timelapse-output and a --timelapse-input-B parameter.
es: Opcional para crear un timelapse. Timelapse guardará una imagen de las caras seleccionadas en la carpeta timelapse-output en cada iteración de guardado. Esta debe ser la carpeta de entrada de las caras "A" que desea utilizar para crear el timelapse. También debe suministrar un parámetro --timelapse-output y un parámetro --timelapse-input-B.
kr: 타임랩스를 만드는 옵션입니다. Timelapse(시간 경과)는 저장을 반복할 때마다 선택한 얼굴의 이미지를 Timelapse-output(시간 경과 출력) 폴더에 저장합니다. 타임랩스를 만드는 데 사용할 'A' 얼굴의 입력 폴더여야 합니다. 또한 사용자는 --timelapse-output 및 --timelapse-input-B 매개 변수를 제공해야 합니다.
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Это должна быть входная папка с лицами 'A', которые вы хотите использовать для создания timelapse. Вы также должны указать параметры --timelapse-output и --timelapse-input-B.

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. This should be the input folder of 'B' faces that you would like to use for creating the timelapse. You must also supply a --timelapse-output and a --timelapse-input-A parameter.
es: Opcional para crear un timelapse. Timelapse guardará una imagen de las caras seleccionadas en la carpeta timelapse-output en cada iteración de guardado. Esta debe ser la carpeta de entrada de las caras "B" que desea utilizar para crear el timelapse. También debe suministrar un parámetro --timelapse-output y un parámetro --timelapse-input-A.
kr: 타임 랩스를 만드는 데 선택적입니다. Timelapse(시간 경과)는 저장을 반복할 때마다 선택한 얼굴의 이미지를 Timelapse-output(시간 경과 출력) 폴더에 저장합니다. 타임 랩스를 만드는 데 사용할 'B' 얼굴의 입력 폴더여야 합니다. 또한 사용자는 --timelapse-output 및 --timelapse-input-A 매개 변수를 제공해야 합니다.
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Это должна быть входная папка с лицами 'B', которые вы хотите использовать для создания timelapse. Вы также должны указать параметры --timelapse-output и --timelapse-input-A.

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. If the input folders are supplied but no output folder, it will default to your model folder /timelapse/
es: Opcional para crear un timelapse. Timelapse guardará una imagen de las caras seleccionadas en la carpeta timelapse-output en cada iteración de guardado. Si se suministran las carpetas de entrada pero no la carpeta de salida, se guardará por defecto en la carpeta del modelo /timelapse/
kr: 타임랩스를 만드는 데 선택적입니다. Timelapse(시간 경과)는 저장을 반복할 때마다 선택한 얼굴의 이미지를 Timelapse-output(시간 경과 출력) 폴더에 저장합니다. 입력 폴더가 제공되었지만 출력 폴더가 없는 경우 모델 폴더에 /timelapse/로 기본 설정됩니다
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Если указаны входные папки, но нет выходной папки, то по умолчанию будет выбрана папка модели /timelapse/

source: preview
es: previsualización
kr: 미리보기
ru: предпросмотр

source: Show training preview output. in a separate window.
es: Mostrar la salida de la vista previa del entrenamiento. en una ventana separada.
kr: 훈련 미리보기 결과를 각기 다른 창에서 보여줍니다.
ru: Показать вывод предварительного просмотра тренировки в отдельном окне.

source: Writes the training result to a file. The image will be stored in the root of your FaceSwap folder.
es: Escribe el resultado del entrenamiento en un archivo. La imagen se almacenará en la raíz de su carpeta FaceSwap.
kr: 훈련 결과를 파일에 씁니다. 이미지는 Faceswap 폴더의 최상위 폴더에 저장됩니다.
ru: Записывает результат обучения в файл. Изображение будет сохранено в корне папки Faceswap.

source: augmentation
es: aumento
kr: 보정
ru: аугментация

source: Warps training faces to closely matched Landmarks from the opposite face-set rather than randomly warping the face. This is the 'dfaker' way of doing warping.
es: Deforma las caras de entrenamiento a puntos de referencia muy parecidos del conjunto de caras opuestas en lugar de deformar la cara al azar. Esta es la forma 'dfaker' de hacer la deformación.
kr: 무작위로 얼굴을 변환하지 않고 반대쪽 얼굴 세트에서 특징점과 밀접하게 일치하도록 훈련 얼굴을 변환해줍니다. 이것은 변환하는 'dfaker' 방식이다.
ru: Искажает обучаемые лица до близко подходящих ориентиров из противоположного набора лиц вместо случайного искажения лица. Это способ выполнения искажения от "dfaker" .

source: To effectively learn, a random set of images are flipped horizontally. Sometimes it is desirable for this not to occur. Generally this should be left off except for during 'fit training'.
es: Para aprender de forma efectiva, se voltea horizontalmente un conjunto aleatorio de imágenes. A veces es deseable que esto no ocurra. Por lo general, esto debería dejarse sin efecto, excepto durante el 'entrenamiento de ajuste'.
kr: 효과적으로 학습하기 위해 임의의 이미지 세트를 수평으로 뒤집습니다. 때때로 이런 일이 일어나지 않는 것이 바람직합니다. 일반적으로 'fit training' 중을 제외하고는 이 작업을 중단해야 합니다.
ru: Для эффективного обучения случайный набор изображений переворачивается по горизонтали. Иногда желательно, чтобы этого не происходило. Как правило, это не нужно делать, за исключением случаев "тренировки подгонки".

source: Color augmentation helps make the model less susceptible to color differences between the A and B sets, at an increased training time cost. Enable this option to disable color augmentation.
es: El aumento del color ayuda a que el modelo sea menos susceptible a las diferencias de color entre los conjuntos A y B, con un mayor coste de tiempo de entrenamiento. Activa esta opción para desactivar el aumento de color.
kr: 색상 보정은 모델이 A와 B 세트 사이의 색상 차이에 덜 민감하게 만드는 데 도움이 되며, 훈련 시간 비용이 증가합니다. 색상 보저를 사용하지 않으려면 이 옵션을 사용합니다.
ru: Аугментация цвета помогает сделать модель менее восприимчивой к цветовым различиям между наборами A и B, что влечет за собой увеличение затрат времени на обучение. Включите этот параметр для отключения цветовой аугментации.

source: Warping is integral to training the Neural Network. This option should only be enabled towards the very end of training to try to bring out more detail. Think of it as 'fine-tuning'. Enabling this option from the beginning is likely to kill a model and lead to terrible results.
es: La deformación es fundamental para el entrenamiento de la red neuronal. Esta opción sólo debería activarse hacia el final del entrenamiento para tratar de obtener más detalles. Piense en ello como un 'ajuste fino'. Si se activa esta opción desde el principio, es probable que arruine el modelo y se obtengan resultados terribles.
kr: 변환은 신경망을 훈련하는 데 필수적입니다. 이 옵션은 보다 세부적인 것들을 뽑아내위하여 훈련 막바지까지 활성화하여야 합니다. 이것은 '미세 조정'이라고 생각하면 됩니다. 처음부터 이 옵션을 활성화하면 모델이 죽을 수있고 끔찍한 결과를 초래할 수 있습니다.
ru: Искажение является неотъемлемой частью обучения нейронной сети. Эту опцию следует включать только в самом конце обучения, чтобы попытаться получить больше деталей. Считайте это "тонкой настройкой". Включение этой опции в самом начале, скорее всего, погубит модель и приведет к ужасным результатам.

source: Output to Shell console instead of GUI console
es: Salida a la consola Shell en lugar de la consola GUI
kr: 결과를 GUI 콘솔이 아닌 쉘 콘솔에 출력합니다
ru: Вывод в консоль Shell вместо консоли GUI

source: R|The plugin to use to output the converted images. The writers are configurable in '/config/convert.ini' or 'Settings > Configure Convert Plugins:' L|ffmpeg: [video] Writes out the convert straight to video. When the input is a series of images then the '-ref' (--reference-video) parameter must be set. L|gif: [animated image] Create an animated gif. L|opencv: [images] The fastest image writer, but less options and formats than other plugins. L|pillow: [images] Slower than opencv, but has more options and supports more formats.
ru: R|Плагин, который нужно использовать для вывода преобразованных изображений. Записи настраиваются в '/config/convert.ini' или 'Настройки > Настроить плагины конвертации:' L|ffmpeg: [видео] Записывает конвертацию прямо в видео. Если на вход подается серия изображений, необходимо установить параметр '-ref' (--reference-video). L|gif: [анимированное изображение] Создает анимированный gif. L|opencv: [изображения] Самый быстрый редактор изображений, но имеет меньше опций и форматов, чем другие плагины. L|pillow: [изображения] Медленнее, чем opencv, но имеет больше опций и поддерживает больше форматов.

source: [Deprecated - Use '-D, --distribution-strategy' instead] Use the Tensorflow Mirrored Distrubution Strategy to train on multiple GPUs.
ru: [Устарело - Используйте '-D, --distribution-strategy' вместо этого] Используйте стратегию Tensorflow Mirrored Distrubution Strategy(Стратегия Зеркального Распределения Tensorflow) для обучения на нескольких GPU.
