Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/lib.cli.args.po
Languages: es, kr, ru

source: Global Options
es: Opciones Globales
kr: 전역 옵션들
ru: Глобальные Настройки

source: R|Exclude GPUs from use by Faceswap. Select the number(s) which correspond to any GPU(s) that you do not wish to be made available to Faceswap. Selecting all GPUs here will force Faceswap into CPU mode. L|{}
es: R|Excluir GPUs de su uso por Faceswap. Seleccione el/los número(s) que correpondan a cualquier GPU(s) que no desee que esté disponible para su uso con Faceswap. Marcar todas las GPUs forzará a Faceswap a usar sólo la CPU, L|{}
kr: R|Faceswap에서 사용되는 GPUs를 제외합니다. Faceswap에서 사용되게 하고 싶지 않은 GPU(s)에 해당하는 번호를 선택하세요. 모든 GPUs를 선택하면 Faceswap으로 하여금 CPU mode를 강제로 사용하게 합니다. L|{}
ru: R|Исключить GPU из использования Faceswap. Выберите номер (номера), соответствующие любому GPU, который вы не хотите предоставлять Faceswap. Если выбрать здесь все GPU, Faceswap перейдет в режим CPU. L|{}

source: Optionally overide the saved config with the path to a custom config file.
es: Usar un fichero alternativo de configuración, almacenado en esta ruta.
kr: 선택적으로 저장된 설정을 경로와 함께 개인 설정 파일에 덮어씌웁니다.
ru: Опционально переопределите сохраненную конфигурацию, указав путь к пользовательскому файлу конфигурации.

source: Log level. Stick with INFO or VERBOSE unless you need to file an error report. Be careful with TRACE as it will generate a lot of data
es: Nivel de registro. Dejarlo en INFO o VERBOSE, a menos que necesite informar de un error. Tenga en cuenta que TRACE generará muchísima información
kr: 로그 레벨. 오류 리포트가 필요하지 않다면 INFO와 VERBOSE를 사용하세요. 단, 굉장히 많은 데이터를 생성할 수 있는 TRACE는 조심하세요
ru: Уровень логирования. Придерживайтесь INFO или VERBOSE, если только вам не нужно отправить отчет об ошибке. Будьте осторожны с TRACE, поскольку он генерирует много данных

source: Path to store the logfile. Leave blank to store in the faceswap folder
es: Ruta para almacenar el fichero de registro. Dejarlo en blanco para almacenarlo en la carpeta pde instalación de faceswap
kr: 로그파일을 저장할 경로. faceswap 폴더에 저장하고 싶으면 비워두세요
ru: Путь для хранения файла журнала. Оставьте пустым, чтобы хранить в папке faceswap

source: Data
es: Datos
kr: 데이터
ru: Данные

source: Input directory or video. Either a directory containing the image files you wish to process or path to a video file. NB: This should be the source video/frames NOT the source faces.
es: Directorio o vídeo de entrada. Un directorio que contenga los archivos de imagen que desea procesar o la ruta a un archivo de vídeo. NB: Debe ser el vídeo/los fotogramas de origen, NO las caras de origen.
kr: 폴더나 비디오를 입력하세요. 당신이 사용하고 싶은 이미지 파일들을 가진 폴더 또는 비디오 파일의 경로여야 합니다. NB: 이 폴더는 원본 비디오여야 합니다.
ru: Входная папка или видео. Либо каталог, содержащий файлы изображений, которые вы хотите обработать, либо путь к видеофайлу. ПРИМЕЧАНИЕ: Это должно быть исходное видео/кадры, а не исходные лица.

source: Output directory. This is where the converted files will be saved.
es: Directorio de salida. Aquí es donde se guardarán los archivos convertidos.
kr: 출력 폴더. 변환된 파일들이 저장될 곳입니다.
ru: Выходная папка. Здесь будут сохранены преобразованные файлы.

source: Optional path to an alignments file. Leave blank if the alignments file is at the default location.
es: Ruta opcional a un archivo de alineaciones. Dejar en blanco si el archivo de alineaciones está en la ubicación por defecto.
kr: (선택적) alignments 파일의 경로. 비워두면 alignments 파일이 기본 위치에 저장됩니다.
ru: Необязательный путь к файлу выравниваний. Оставьте пустым, если файл выравнивания находится в месте по умолчанию.

source: Extract faces from image or video sources. Extraction plugins can be configured in the 'Settings' Menu
es: Extrae caras de fuentes de imagen o video. Los plugins de extracción pueden ser configuradas en el menú de 'Ajustes'
kr: 얼굴들을 이미지 또는 비디오에서 추출합니다. 추출 플러그인은 '설정' 메뉴에서 설정할 수 있습니다
ru: Извлечение лиц из источников изображений или видео. Плагины извлечения можно настроить в меню "Настройки"

source: R|If selected then the input_dir should be a parent folder containing multiple videos and/or folders of images you wish to extract from. The faces will be output to separate sub-folders in the output_dir.
es: Si se selecciona, input_dir debe ser una carpeta principal que contenga varios videos y/o carpetas de imágenes de las que desea extraer. Las caras se enviarán a subcarpetas separadas en output_dir.
kr: R|만약 선택된다면 input_dir은 당신이 추출하고자 하는 여러개의 비디오 그리고/또는 이미지들을 가진 부모 폴더가 되야 합니다. 얼굴들은 output_dir에 분리된 하위 폴더에 저장됩니다.
ru: R|Если выбрано, то input_dir должен быть родительской папкой, содержащей несколько видео и/или папок с изображениями, из которых вы хотите извлечь изображение. Лица будут выведены в отдельные вложенные папки в output_dir.

source: Plugins
es: Extensiones
kr: 플러그인들
ru: Плагины

source: R|Detector to use. Some of these have configurable settings in '/config/extract.ini' or 'Settings > Configure Extract 'Plugins': L|cv2-dnn: A CPU only extractor which is the least reliable and least resource intensive. Use this if not using a GPU and time is important. L|mtcnn: Good detector. Fast on CPU, faster on GPU. Uses fewer resources than other GPU detectors but can often return more false positives. L|s3fd: Best detector. Slow on CPU, faster on GPU. Can detect more faces and fewer false positives than other GPU detectors, but is a lot more resource intensive.
es: R|Detector de caras a usar. Algunos tienen ajustes configurables en '/config/extract.ini' o 'Ajustes > Configurar Extensiones de Extracción: L|cv2-dnn: Extractor que usa sólo la CPU. Es el menos fiable y el que menos recursos usa. Elegir este si necesita rapidez y no usar la GPU. L|mtcnn: Buen detector. Rápido en la CPU y más rápido en la GPU. Usa menos recursos que otros detectores basados en GPU, pero puede devolver más falsos positivos. L|s3fd: El mejor detector. Lento en la CPU, y más rápido en la GPU. Puede detectar más caras y tiene menos falsos positivos que otros detectores basados en GPU, pero uso muchos más recursos.
kr: R|사용할 감지기. 몇몇 감지기들은 '/config/extract.ini' 또는 '설정 > 추출 플러그인 설정'에서 설정이 가능합니다: L|cv2-dnn: 가장 믿을 수 없고 가장 자원을 덜 사용하며 CPU만을 사용하는 추출기입니다. 만약 GPU를 사용하지 않고 시간이 중요하다면 사용하세요. L|mtcnn: 좋은 감지기. CPU에서도 빠르고 GPU에서도 빠릅니다. 다른 GPU 감지기들보다 더 적은 자원을 사용하지만 가끔 더 많은 false positives를 돌려줄 수 있습니다. L|s3fd: 가장 좋은 감지기. CPU에선 느리고 GPU에선 빠릅니다. 다른 GPU 감지기들보다 더 많은 얼굴들을 감지할 수 있고 과 더 적은 false positives를 돌려주지만 자원을 굉장히 많이 사용합니다.
ru: R|Детектор для использования. Некоторые из них имеют настраиваемые параметры в '/config/extract.ini' или 'Settings > Configure Extract 'Plugins': L|cv2-dnn: Экстрактор только для процессора, который является наименее надежным и наименее ресурсоемким. Используйте его, если не используется GPU и важно время. L|mtcnn: Хороший детектор. Быстрый на CPU, еще быстрее на GPU. Использует меньше ресурсов, чем другие детекторы на GPU, но часто может давать больше ложных срабатываний. L|s3fd: Лучший детектор. Медленный на CPU, более быстрый на GPU. Может обнаружить больше лиц и меньше ложных срабатываний, чем другие детекторы на GPU, но требует гораздо больше ресурсов.

source: R|Aligner to use. L|cv2-dnn: A CPU only landmark detector. Faster, less resource intensive, but less accurate. Only use this if not using a GPU and time is important. L|fan: Best aligner. Fast on GPU, slow on CPU.
es: R|Alineador a usar. L|cv2-dnn: Detector que usa sólo la CPU. Más rápido, usa menos recursos, pero es menos preciso. Elegir este si necesita rapidez y no usar la GPU. L|fan: El mejor alineador. Rápido en la GPU, y lento en la CPU.
kr: R|사용할 Aligner. L|cv2-dnn: CPU만을 사용하는 특징점 감지기. 빠르고 자원을 덜 사용하지만 부정확합니다. GPU를 사용하지 않고 시간이 중요할 때에만 사용하세요. L|fan: 가장 좋은 aligner. GPU에선 빠르고 CPU에선 느립니다.
ru: R|Выравниватель для использования. L|cv2-dnn: Детектор ориентиров только для процессора. Быстрее, менее ресурсоемкий, но менее точный. Используйте его, только если не используется GPU и важно время. L|fan: Лучший выравниватель. Быстрый на GPU, медленный на CPU.

source: R|Additional Masker(s) to use. The masks generated here will all take up GPU RAM. You can select none, one or multiple masks, but the extraction may take longer the more you select. NB: The Extended and Components (landmark based) masks are automatically generated on extraction. L|bisenet-fp: Relatively lightweight NN based mask that provides more refined control over the area to be masked including full head masking (configurable in mask settings). L|custom: A dummy mask that fills the mask area with all 1s or 0s (configurable in settings). This is only required if you intend to manually edit the custom masks yourself in the manual tool. This mask does not use the GPU so will not use any additional VRAM. L|vgg-clear: Mask designed to provide smart segmentation of mostly frontal faces clear of obstructions. Profile faces and obstructions may result in sub-par performance. L|vgg-obstructed: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been specifically trained to recognize some facial obstructions (hands and eyeglasses). Profile faces may result in sub-par performance. L|unet-dfl: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been trained by community members and will need testing for further description. Profile faces may result in sub-par performance. The auto generated masks are as follows: L|components: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks to create a mask. L|extended: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks and the mask is extended upwards onto the forehead. (eg: `-M unet-dfl vgg-clear`, `--masker vgg-obstructed`)
es: R|Enmascarador(es) adicional(es) a usar. Las máscaras generadas aquí usarán todas RAM de la GPU. Puede seleccionar una, varias o ninguna máscaras, pero la extracción tardará más cuanto más marque. Las máscaras Extended y Components son siempre generadas durante la extracción. L|bisenet-fp: Máscara relativamente ligera basada en NN que proporciona un control más refinado sobre el área a enmascarar, incluido el enmascaramiento completo de la cabeza (configurable en la configuración de la máscara). L|custom: Una máscara ficticia que llena el área de la máscara con 1 o 0 (configurable en la configuración). Esto solo es necesario si tiene la intención de editar manualmente las máscaras personalizadas usted mismo en la herramienta manual. Esta máscara no usa la GPU, por lo que no usará VRAM adicional. L|vgg-clear: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales y libres de obstrucciones. Los rostros de perfil y las obstrucciones pueden dar lugar a un rendimiento inferior. L|vgg-obstructed: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de la máscara ha sido entrenado específicamente para reconocer algunas obstrucciones faciales (manos y gafas). Los rostros de perfil pueden dar lugar a un rendimiento inferior. L|unet-dfl: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de máscara ha sido entrenado por los miembros de la comunidad y necesitará ser probado para una mayor descripción. Los rostros de perfil pueden dar lugar a un rendimiento inferior. Las máscaras que siempre se generan son: L|components: Máscara diseñada para proporcionar una segmentación facial basada en el posicionamiento de las ubicaciones de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia para crear una máscara. L|extended: Máscara diseñada para proporcionar una segmentación facial basada en el posicionamiento de las ubicaciones de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia y la máscara se extiende hacia arriba en la frente. (eg: `-M unet-dfl vgg-clear`, `--masker vgg-obstructed`)
kr: R|사용할 추가 Mask입니다. 여기서 생성된 마스크는 모두 GPU RAM을 차지합니다. 마스크를 0개, 1개 또는 여러 개 선택할 수 있지만 더 많이 선택할수록 추출에 시간이 더 걸릴 수 있습니다. NB: 확장 및 구성 요소(특징점 기반) 마스크는 추출 시 자동으로 생성됩니다. L|bisnet-fp: 전체 헤드 마스킹(마스크 설정에서 구성 가능)을 포함하여 마스킹할 영역에 대한 보다 정교한 제어를 제공하는 비교적 가벼운 NN 기반 마스크입니다. L|custom: 마스크 영역을 모든 1 또는 0으로 채우는 dummy 마스크입니다(설정에서 구성 가능). 수동 도구에서 사용자 정의 마스크를 직접 수동으로 편집하려는 경우에만 필요합니다. 이 마스크는 GPU를 사용하지 않으므로 추가 VRAM을 사용하지 않습니다. L|vgg-clear: 대부분의 정면에 장애물이 없는 스마트한 분할을 제공하도록 설계된 마스크입니다. 프로필 얼굴들 및 장애물들로 인해 성능이 저하될 수 있습니다. L|vgg-obstructed: 대부분의 정면 얼굴을 스마트하게 분할할 수 있도록 설계된 마스크입니다. 마스크 모델은 일부 안면 장애물(손과 안경)을 인식하도록 특별히 훈련되었습니다. 프로필 얼굴들은 평균 이하의 성능을 초래할 수 있습니다. L|unet-dfl: 대부분 정면 얼굴을 스마트하게 분할하도록 설계된 마스크. 마스크 모델은 커뮤니티 구성원들에 의해 훈련되었으며 추가 설명을 위해 테스트가 필요하다. 프로필 얼굴들은 평균 이하의 성능을 초래할 수 있습니다. 자동 생성 마스크는 다음과 같습니다. L|components: 특징점 위치의 위치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 특징점의 외부에는 마스크를 만들기 위해 convex hull가 형성되어 있습니다. L|extended: 특징점 위치의 위치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 특징점의 외부에는 convex hull가 형성되어 있으며, 마스크는 이마 위로 뻗어 있습ㄴ다. (예: '-M unet-dfl vgg-clear', '--masker vgg-obstructed')
ru: R|Дополнительный маскер(ы) для использования. Все маски, созданные здесь, будут занимать оперативную память GPU. Вы можете выбрать ни одной, одну или несколько масок, но извлечение может занять больше времени, чем больше масок вы выберете. Примечание: Расширенные маски и маски компонентов (на основе ориентиров) генерируются автоматически при извлечении. L|bisenet-fp: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью, включая полное маскирование головы (настраивается в настройках маски). L|custom: Фиктивная маска, которая заполняет область маски всеми 1 или 0 (настраивается в настройках). Она необходима только в том случае, если вы собираетесь вручную редактировать пользовательские маски в ручном инструменте. Эта маска не задействует GPU, поэтому не будет использовать дополнительную память VRAM. L|vgg-clear: Маска предназначена для интеллектуальной сегментации преимущественно фронтальных лиц без препятствий. Профильные лица и препятствия могут привести к снижению производительности. L|vgg-obstructed: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была специально обучена распознавать некоторые препятствия на лице (руки и очки). Лица в профиль могут иметь низкую производительность. L|unet-dfl: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была обучена членами сообщества и для дальнейшего описания нуждается в тестировании. Профильные лица могут привести к низкой производительности. Автоматически сгенерированные маски выглядят следующим образом: L|components: Маска, разработанная для сегментации лица на основе расположения ориентиров. Для создания маски вокруг внешних ориентиров строится выпуклая оболочка. L|extended: Маска, предназначенная для сегментации лица на основе расположения ориентиров. Выпуклый корпус строится вокруг внешних ориентиров, и маска расширяется вверх на лоб. (например: `-M unet-dfl vgg-clear`, `--masker vgg-obstructed`)

source: R|Performing normalization can help the aligner better align faces with difficult lighting conditions at an extraction speed cost. Different methods will yield different results on different sets. NB: This does not impact the output face, just the input to the aligner. L|none: Don't perform normalization on the face. L|clahe: Perform Contrast Limited Adaptive Histogram Equalization on the face. L|hist: Equalize the histograms on the RGB channels. L|mean: Normalize the face colors to the mean.
es: R|Realizar la normalización puede ayudar al alineador a alinear mejor las caras con condiciones de iluminación difíciles a un coste de velocidad de extracción. Diferentes métodos darán diferentes resultados en diferentes conjuntos. NB: Esto no afecta a la cara de salida, sólo a la entrada del alineador. L|none: No realice la normalización en la cara. L|clahe: Realice la ecualización adaptativa del histograma con contraste limitado en el rostro. L|hist: Iguala los histogramas de los canales RGB. L|mean: Normalizar los colores de la cara a la media.
kr: R|정규화를 수행하면 aligner가 추출 속도 비용으로 어려운 조명 조건의 얼굴을 더 잘 정렬할 수 있습니다. 방법이 다르면 세트마다 결과가 다릅니다. NB: 출력 얼굴에는 영향을 주지 않으며 aligner에 대한 입력에만 영향을 줍니다. L|none: 얼굴에 정규화를 수행하지 마십시오. L|clahe: 얼굴에 Contrast Limited Adaptive Histogram Equalization를 수행합니다. L|hist: RGB 채널의 히스토그램을 동일하게 합니다. L|mean: 얼굴 색상을 평균으로 정규화합니다.
ru: R|Проведение нормализации может помочь выравнивателю лучше выравнивать лица со сложными условиями освещения при затратах на скорость извлечения. Различные методы дают разные результаты на разных наборах. NB: Это не влияет на выходное лицо, только на вход выравнивателя. L|none: Не выполнять нормализацию лица. L|clahe: Выполнить для лица адаптивную гистограммную эквализацию с ограничением контраста. L|hist: Уравнять гистограммы в каналах RGB. L|mean: Нормализовать цвета лица к среднему значению.

source: The number of times to re-feed the detected face into the aligner. Each time the face is re-fed into the aligner the bounding box is adjusted by a small amount. The final landmarks are then averaged from each iteration. Helps to remove 'micro-jitter' but at the cost of slower extraction speed. The more times the face is re-fed into the aligner, the less micro-jitter should occur but the longer extraction will take.
es: El número de veces que hay que volver a introducir la cara detectada en el alineador. Cada vez que la cara se vuelve a introducir en el alineador, el cuadro delimitador se ajusta en una pequeña cantidad. Los puntos de referencia finales se promedian en cada iteración. Esto ayuda a eliminar el 'micro-jitter', pero a costa de una menor velocidad de extracción. Cuantas más veces se vuelva a introducir la cara en el alineador, menos microfluctuaciones se producirán, pero la extracción será más larga.
kr: 검출된 얼굴을 aligner에 다시 공급하는 횟수입니다. 얼굴이 aligner에 다시 공급될 때마다 경계 상자가 소량 조정됩니다. 그런 다음 각 반복에서 최종 특징점의 평균을 구한다. 'micro-jitter'를 제거하는 데 도움이 되지만 추출 속도가 느려집니다. 얼굴이 aligner에 다시 공급되는 횟수가 많을수록 micro-jitter 적게 발생하지만 추출에 더 오랜 시간이 걸립니다.
ru: Количество повторных подач обнаруженной области лица в выравниватель. При каждой повторной подаче лица в выравниватель ограничивающая рамка корректируется на небольшую величину. Затем конечные ориентиры усредняются по результатам каждой итерации. Это помогает устранить "микро-дрожание", но ценой снижения скорости извлечения. Чем больше раз лицо повторно подается в выравниватель, тем меньше микро-дрожание, но тем больше времени займет извлечение.

source: Re-feed the initially found aligned face through the aligner. Can help produce better alignments for faces that are rotated beyond 45 degrees in the frame or are at extreme angles. Slows down extraction.
es: Vuelva a introducir la cara alineada encontrada inicialmente a través del alineador. Puede ayudar a producir mejores alineaciones para las caras que se giran más de 45 grados en el marco o se encuentran en ángulos extremos. Ralentiza la extracción.
kr: _aligner를 통해 처음 발견된 정렬된 얼굴을 재공급합니다. 프레임에서 45도 이상 회전하거나 극단적인 각도에 있는 얼굴을 더 잘 정렬할 수 있습니다. 추출 속도가 느려집니다.
ru: Повторная подача первоначально найденной выровненной области лица через выравниватель. Может помочь получить лучшее выравнивание для лиц, повернутых в кадре более чем на 45 градусов или расположенных под экстремальными углами. Замедляет извлечение.

source: If a face isn't found, rotate the images to try to find a face. Can find more faces at the cost of extraction speed. Pass in a single number to use increments of that size up to 360, or pass in a list of numbers to enumerate exactly what angles to check.
es: Si no se encuentra una cara, gira las imágenes para intentar encontrar una cara. Puede encontrar más caras a costa de la velocidad de extracción. Pase un solo número para usar incrementos de ese tamaño hasta 360, o pase una lista de números para enumerar exactamente qué ángulos comprobar.
kr: 얼굴이 발견되지 않으면 이미지를 회전하여 얼굴을 찾습니다. 추출 속도를 희생하면서 더 많은 얼굴을 찾을 수 있습니다. 단일 숫자를 입력하여 해당 크기의 증분을 360까지 사용하거나 숫자 목록을 입력하여 확인할 각도를 정확하게 열거합니다.
ru: Если лицо не найдено, поворачивает изображения, чтобы попытаться найти лицо. Может найти больше лиц ценой снижения скорости извлечения. Передайте одно число, чтобы использовать приращения этого размера до 360, или передайте список чисел, чтобы перечислить, какие именно углы нужно проверить.

source: Obtain and store face identity encodings from VGGFace2. Slows down extract a little, but will save time if using 'sort by face'
es: Obtenga y almacene codificaciones de identidad facial de VGGFace2. Ralentiza un poco la extracción, pero ahorrará tiempo si usa 'sort by face'
kr: VGGFace2에서 얼굴 식별 인코딩을 가져와 저장합니다. 추출 속도를 약간 늦추지만 '얼굴별로 정렬'을 사용하면 시간을 절약할 수 있습니다.
ru: Получение и хранение кодировок идентификации лица из VGGFace2. Немного замедляет извлечение, но экономит время при использовании "сортировки по лицам".

source: Face Processing
es: Proceso de Caras
kr: 얼굴 처리
ru: Обработка лиц

source: Filters out faces detected below this size. Length, in pixels across the diagonal of the bounding box. Set to 0 for off
es: Filtra las caras detectadas por debajo de este tamaño. Longitud, en píxeles a lo largo de la diagonal del cuadro delimitador. Establecer a 0 para desactivar
kr: 이 크기 미만으로 탐지된 얼굴을 필터링합니다. 길이, 경계 상자의 대각선에 걸친 픽셀 단위입니다. 0으로 설정하면 꺼집니다
ru: Отфильтровывает лица, обнаруженные ниже этого размера. Длина в пикселях по диагонали ограничивающего поля. Установите значение 0, чтобы выключить

source: Optionally filter out people who you do not wish to extract by passing in images of those people. Should be a small variety of images at different angles and in different conditions. A folder containing the required images or multiple image files, space separated, can be selected.
es: Opcionalmente, filtre a las personas que no desea extraer pasando imágenes de esas personas. Debe ser una pequeña variedad de imágenes en diferentes ángulos y en diferentes condiciones. Se puede seleccionar una carpeta que contenga las imágenes requeridas o múltiples archivos de imágenes, separados por espacios.
kr: 선택적으로 추출하지 않을 사람의 이미지들을 전달하여 그 사람들을 제외합니다. 각도와 조건이 다른 작은 다양한 이미지여야 합니다. 추출되지 않는데 필요한 이미지들 또는 공백으로 구분된 여러 이미지 파일이 들어 있는 폴더를 선택할 수 있습니다.
ru: По желанию отфильтруйте людей, которых вы не хотите извлекать, передав изображения этих людей. Должно быть небольшое разнообразие изображений под разными углами и в разных условиях. Можно выбрать папку, содержащую необходимые изображения, или несколько файлов изображений, разделенных пробелами.

source: Optionally select people you wish to extract by passing in images of that person. Should be a small variety of images at different angles and in different conditions A folder containing the required images or multiple image files, space separated, can be selected.
es: Opcionalmente, seleccione las personas que desea extraer pasando imágenes de esa persona. Debe haber una pequeña variedad de imágenes en diferentes ángulos y en diferentes condiciones. Se puede seleccionar una carpeta que contenga las imágenes requeridas o múltiples archivos de imágenes, separados por espacios.
kr: 선택적으로 추출하고 싶은 사람의 이미지를 전달하여 그 사람을 선택합니다. 각도와 조건이 다른 작은 다양한 이미지여야 합니다. 추출할 때 필요한 이미지들 또는 공백으로 구분된 여러 이미지 파일이 들어 있는 폴더를 선택할 수 있습니다.
ru: По желанию выберите людей, которых вы хотите извлечь, передав изображения этого человека. Должно быть небольшое разнообразие изображений под разными углами и в разных условиях. Можно выбрать папку, содержащую необходимые изображения, или несколько файлов изображений, разделенных пробелами.
