Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/lib.cli.args_train.po
Languages: ru

source: Train a model on extracted original (A) and swap (B) faces. Training models can take a long time. Anything from 24hrs to over a week Model plugins can be configured in the 'Settings' Menu
ru: Обучение модели на извлеченных оригинальных (A) и подмененных (B) лицах. Обучение моделей может занять много времени. От 24 часов до недели. Плагины для моделей можно настроить в меню "Настройки"

source: faces
ru: лица

source: Input directory. A directory containing training images for face A. This is the original face, i.e. the face that you want to remove and replace with face B.
ru: Входная папка. Папка, содержащая обучающие изображения для лица A. Это исходное лицо, т.е. лицо, которое вы хотите удалить и заменить лицом B.

source: Input directory. A directory containing training images for face B. This is the swap face, i.e. the face that you want to place onto the head of person A.
ru: Входная папка. Папка, содержащая обучающие изображения для лица B. Это подменное лицо, т.е. лицо, которое вы хотите поместить на голову человека A.

source: model
ru: модель

source: Model directory. This is where the training data will be stored. You should always specify a new folder for new models. If starting a new model, select either an empty folder, or a folder which does not exist (which will be created). If continuing to train an existing model, specify the location of the existing model.
ru: Папка модели. Здесь будут храниться данные для обучения. Для новых моделей всегда следует указывать новую папку. Если вы начинаете новую модель, выберите либо пустую папку, либо несуществующую папку (которая будет создана). Если вы продолжаете обучение существующей модели, укажите местоположение существующей модели.

source: R|Load the weights from a pre-existing model into a newly created model. For most models this will load weights from the Encoder of the given model into the encoder of the newly created model. Some plugins may have specific configuration options allowing you to load weights from other layers. Weights will only be loaded when creating a new model. This option will be ignored if you are resuming an existing model. Generally you will also want to 'freeze-weights' whilst the rest of your model catches up with your Encoder. NB: Weights can only be loaded from models of the same plugin as you intend to train.
ru: R|Загрузить веса из уже существующей модели во вновь созданную модель. Для большинства моделей это означает загрузку весов из кодировщика данной модели в кодировщик вновь создаваемой модели. Некоторые плагины могут иметь специальные параметры конфигурации, позволяющие загружать веса из других слоев. Веса будут загружаться только при создании новой модели. Эта опция будет проигнорирована, если вы возобновляете существующую модель. Обычно также требуется "заморозить" веса, пока остальная часть модели догоняет кодировщик. Примечание: Веса могут быть загружены только из моделей того же плагина, который вы собираетесь обучать.

source: R|Select which trainer to use. Trainers can be configured from the Settings menu or the config folder. L|original: The original model created by /u/deepfakes. L|dfaker: 64px in/128px out model from dfaker. Enable 'warp-to-landmarks' for full dfaker method. L|dfl-h128: 128px in/out model from deepfacelab L|dfl-sae: Adaptable model from deepfacelab L|dlight: A lightweight, high resolution DFaker variant. L|iae: A model that uses intermediate layers to try to get better details L|lightweight: A lightweight model for low-end cards. Don't expect great results. Can train as low as 1.6GB with batch size 8. L|realface: A high detail, dual density model based on DFaker, with customizable in/out resolution. The autoencoders are unbalanced so B>A swaps won't work so well. By andenixa et al. Very configurable. L|unbalanced: 128px in/out model from andenixa. The autoencoders are unbalanced so B>A swaps won't work so well. Very configurable. L|villain: 128px in/out model from villainguy. Very resource hungry (You will require a GPU with a fair amount of VRAM). Good for details, but more susceptible to color differences.
ru: R|Выберите, какой тренажер использовать. Тренажеры можно настроить в меню "Настройки" или в папке config. L|original: Оригинальная модель, созданная /u/deepfakes. L|dfaker: модель 64px вход/ 128px выход от dfaker. Включите 'warp-to-landmarks' для полного метода dfaker. L|dfl-h128: модель 128px вход/выход от deepfacelab L|dfl-sae: Адаптируемая модель от deepfacelab L|dlight: Легкий вариант DFaker с высоким разрешением. L|iae: Модель, использующая промежуточные слои для получения лучших деталей. L|lightweight: Облегченная модель для карт низкого класса. Не ожидайте высоких результатов. Может обучаться на 1,6 ГБ при размере пачки 8. L|realface: Модель с высокой детализацией и двойной плотностью, основанная на DFaker, с настраиваемым разрешением входа/выхода. Автоэнкодеры несбалансированы, поэтому замены B>A не будут работать так хорошо. Автор andenixa и др. Очень настраиваемая. L|unbalanced: модель 128px вход/выход от andenixa. Автокодировщики несбалансированы, поэтому замены B>A не будут работать так хорошо. Очень настраиваемая. L|villain: модель 128px вход/выход от villainguy. Очень требовательна к ресурсам (вам потребуется GPU с достаточным количеством VRAM). Хороша для детализации, но более восприимчива к цветовым различиям.

source: Output a summary of the model and exit. If a model folder is provided then a summary of the saved model is displayed. Otherwise a summary of the model that would be created by the chosen plugin and configuration settings is displayed.
ru: Вывести сводку модели и выйти. Если указана папка модели, то выводится сводка сохраненной модели. В противном случае отображается сводка модели, которая будет создана выбранным плагином и настройками конфигурации.

source: Freeze the weights of the model. Freezing weights means that some of the parameters in the model will no longer continue to learn, but those that are not frozen will continue to learn. For most models, this will freeze the encoder, but some models may have configuration options for freezing other layers.
ru: Заморозить веса модели. Замораживание весов означает, что некоторые параметры в модели больше не будут продолжать обучение, но те, которые не заморожены, будут продолжать обучение. Для большинства моделей это означает замораживание кодера, но некоторые модели могут иметь опции конфигурации для замораживания других слоев.

source: training
ru: тренировка

source: Batch size. This is the number of images processed through the model for each side per iteration. NB: As the model is fed 2 sides at a time, the actual number of images within the model at any one time is double the number that you set here. Larger batches require more GPU RAM.
ru: Размер пачки. Это количество изображений, обрабатываемых моделью для каждой стороны за итерацию. Примечание: Поскольку модель обрабатывает 2 стороны одновременно, фактическое количество изображений в модели в любой момент времени будет вдвое больше, чем заданное здесь. Большие партии требуют больше оперативной памяти GPU.

source: Length of training in iterations. This is only really used for automation. There is no 'correct' number of iterations a model should be trained for. You should stop training when you are happy with the previews. However, if you want the model to stop automatically at a set number of iterations, you can set that value here.
ru: Продолжительность обучения в итерациях. Этот параметр действительно используется только для автоматизации. Не существует "правильного" количества итераций, за которое следует обучить модель. Вы должны прекратить обучение, когда будете удовлетворены предварительным просмотром. Однако если вы хотите, чтобы модель автоматически останавливалась при определенном количестве итераций, вы можете задать это значение здесь.

source: R|Select the distribution stategy to use. L|default: Use Tensorflow's default distribution strategy. L|central-storage: Centralizes variables on the CPU whilst operations are performed on 1 or more local GPUs. This can help save some VRAM at the cost of some speed by not storing variables on the GPU. Note: Mixed-Precision is not supported on multi-GPU setups. L|mirrored: Supports synchronous distributed training across multiple local GPUs. A copy of the model and all variables are loaded onto each GPU with batches distributed to each GPU at each iteration.
ru: R|Выберите стратегию распределения для использования. L|default: Использовать стратегию распространения Tensorflow по умолчанию. L|central-storage: Централизует переменные на CPU, в то время как операции выполняются на 1 или более локальных GPU. Это может помочь сэкономить немного VRAM за счет некоторой скорости, поскольку переменные не хранятся на GPU. Примечание: Mixed-Precision не поддерживается на многопроцессорных установках. L|mirrored: Поддерживает синхронное распределенное обучение на нескольких локальных GPU. Копия модели и все переменные загружаются на каждый GPU с распределением партий на каждый GPU на каждой итерации.

source: Disables TensorBoard logging. NB: Disabling logs means that you will not be able to use the graph or analysis for this session in the GUI.
ru: Отключает ведение журналов TensorBoard. Примечание: Отключение ведения журналов означает, что вы не сможете использовать график или анализ для этой сессии в графическом интерфейсе.

source: Use the Learning Rate Finder to discover the optimal learning rate for training. For new models, this will calculate the optimal learning rate for the model. For existing models this will use the optimal learning rate that was discovered when initializing the model. Setting this option will ignore the manually configured learning rate (configurable in train settings).
ru: Используйте инструмент поиска коэффициента обучения, чтобы найти оптимальную скорость обучения вашей модели. Для новых моделей это позволит рассчитать оптимальный коэффициент обучения для модели. Для существующих моделей будет использован оптимальный коэффициент обучения, найденный при инициализации модели. Установка этой опции приведет к игнорированию вручную настроенного коэффициента обучения (настраиваемого в параметрах обучения).

source: Saving
ru: Сохранение

source: Sets the number of iterations between each model save.
ru: Устанавливает количество итераций между каждым сохранением модели.

source: Sets the number of iterations before saving a backup snapshot of the model in it's current state. Set to 0 for off.
ru: Устанавливает количество итераций между каждым сохранением модели. Устанавливает количество итераций перед сохранением резервного снимка модели в текущем состоянии. Установите значение 0 для выключения.

source: timelapse
ru: таймлапс

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. This should be the input folder of 'A' faces that you would like to use for creating the timelapse. You must also supply a --timelapse-output and a --timelapse-input-B parameter.
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Это должна быть входная папка с лицами 'A', которые вы хотите использовать для создания timelapse. Вы также должны указать параметры --timelapse-output и --timelapse-input-B.

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. This should be the input folder of 'B' faces that you would like to use for creating the timelapse. You must also supply a --timelapse-output and a --timelapse-input-A parameter.
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Это должна быть входная папка с лицами 'B', которые вы хотите использовать для создания timelapse. Вы также должны указать параметры --timelapse-output и --timelapse-input-A.

source: Optional for creating a timelapse. Timelapse will save an image of your selected faces into the timelapse-output folder at every save iteration. If the input folders are supplied but no output folder, it will default to your model folder/timelapse/
ru: Опционально для создания таймлапса. Timelapse будет сохранять изображение выбранных лиц в папку timelapse-output на каждой итерации сохранения. Если указаны входные папки, но нет выходной папки, то по умолчанию будет выбрана папка модели/timelapse/

source: preview
ru: предпросмотр

source: Show training preview output. in a separate window.
ru: Показать вывод предварительного просмотра тренировки в отдельном окне.

source: Writes the training result to a file. The image will be stored in the root of your FaceSwap folder.
ru: Записывает результат обучения в файл. Изображение будет сохранено в корне папки Faceswap.

source: augmentation
ru: аугментация

source: Warps training faces to closely matched Landmarks from the opposite face-set rather than randomly warping the face. This is the 'dfaker' way of doing warping.
ru: Искажает обучаемые лица до близко подходящих ориентиров из противоположного набора лиц вместо случайного искажения лица. Это способ выполнения искажения от "dfaker" .

source: To effectively learn, a random set of images are flipped horizontally. Sometimes it is desirable for this not to occur. Generally this should be left off except for during 'fit training'.
ru: Для эффективного обучения случайный набор изображений переворачивается по горизонтали. Иногда желательно, чтобы этого не происходило. Как правило, это не нужно делать, за исключением случаев "тренировки подгонки".

source: Color augmentation helps make the model less susceptible to color differences between the A and B sets, at an increased training time cost. Enable this option to disable color augmentation.
ru: Аугментация цвета помогает сделать модель менее восприимчивой к цветовым различиям между наборами A и B, что влечет за собой увеличение затрат времени на обучение. Включите этот параметр для отключения цветовой аугментации.

source: Warping is integral to training the Neural Network. This option should only be enabled towards the very end of training to try to bring out more detail. Think of it as 'fine-tuning'. Enabling this option from the beginning is likely to kill a model and lead to terrible results.
ru: Искажение является неотъемлемой частью обучения нейронной сети. Эту опцию следует включать только в самом конце обучения, чтобы попытаться получить больше деталей. Считайте это "тонкой настройкой". Включение этой опции в самом начале, скорее всего, погубит модель и приведет к ужасным результатам.
