Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/plugins.train._config.po
Languages: ru

source: How aggressively to set the Learning Rate. More aggressive can learn faster, but is more likely to lead to exploding gradients. default - The default optimal learning rate. A safe choice for nearly all use cases. aggressive - Set's a higher learning rate than the default. May learn faster but with a higher chance of exploding gradients. extreme - The highest optimal learning rate. A much higher risk of exploding gradients.
ru: Насколько агрессивно устанавливать коэффициент обучения. Более агрессивный подход может обучать быстрее, но с большей вероятностью может привести к взрыву градиентов. default - Оптимальный коэффициент обучения по умолчанию. Безопасный выбор для почти всех случаев использования. aggressive - Устанавливает коэффициент обучения выше, чем по умолчанию. Может обучать быстрее, но с большей вероятностью взрыва градиента. extreme - Наивысший оптимальный коэффициент обучения. Гораздо выше риск взрыва градиента.

source: Apply AutoClipping to the gradients. AutoClip analyzes the gradient weights and adjusts the normalization value dynamically to fit the data. Can help prevent NaNs and improve model optimization at the expense of VRAM. Ref: AutoClip: Adaptive Gradient Clipping for Source Separation Networks https://arxiv.org/abs/2007.14469
ru: Применить AutoClipping к градиентам. AutoClip анализирует веса градиентов и динамически корректирует значение нормализации, чтобы оно подходило к данным. Может помочь избежать NaN('не число') и улучшить оптимизацию модели ценой видеопамяти. Ссылка: AutoClip: Adaptive Gradient Clipping for Source Separation Networks [ТОЛЬКО на английском] https://arxiv.org/abs/2007.14469

source: network
ru: сеть

source: Use reflection padding rather than zero padding with convolutions. Each convolution must pad the image boundaries to maintain the proper sizing. More complex padding schemes can reduce artifacts at the border of the image. http://www-cs.engr.ccny.cuny.edu/~wolberg/cs470/hw/hw2_pad.txt
ru: Используйте для сверток не нулевую, а отражающую подкладку. Каждая свертка должна заполнять границы изображения для поддержания правильного размера. Более сложные схемы вставки могут уменьшить артефакты на границе изображения. http://www-cs.engr.ccny.cuny.edu/~wolberg/cs470/hw/hw2_pad.txt

source: Enable the Tensorflow GPU 'allow_growth' configuration option. This option prevents Tensorflow from allocating all of the GPU VRAM at launch but can lead to higher VRAM fragmentation and slower performance. Should only be enabled if you are receiving errors regarding 'cuDNN fails to initialize' when commencing training.
ru: [Только для Nvidia]. Включите опцию конфигурации Tensorflow GPU `allow_growth`. Эта опция не позволяет Tensorflow выделять всю видеопамять видеокарты при запуске, но может привести к повышенной фрагментации видеопамяти и снижению производительности. Следует включать только в том случае, если у вас появляются ошибки, рода 'cuDNN fails to initialize'(cuDNN не может инициализироваться) при начале тренировки.

source: NVIDIA GPUs can run operations in float16 faster than in float32. Mixed precision allows you to use a mix of float16 with float32, to get the performance benefits from float16 and the numeric stability benefits from float32. This is untested on DirectML backend, but will run on most Nvidia models. it will only speed up training on more recent GPUs. Those with compute capability 7.0 or higher will see the greatest performance benefit from mixed precision because they have Tensor Cores. Older GPUs offer no math performance benefit for using mixed precision, however memory and bandwidth savings can enable some speedups. Generally RTX GPUs and later will offer the most benefit.
ru: Видеокарты от NVIDIA могут оперировать в 'float16' быстрее, чем в 'float32'. Смешанная точность позволяет вам использовать микс float16 с float32, чтобы получить улучшение производительности от float16 и числовую стабильность от float32. Это не было проверено на DirectML, но будет работать на большенстве моделей Nvidia. Оно только ускорит тренировку на более недавних видеокартах. Те, что имеют возможность вычислений('Compute Capability') 7.0 и выше, получат самое большое ускорение от смешанной точности, потому что у них имеются тензор ядра. Старые видеокарты предлагают никакого ускорения от смешанной точности, однако экономия памяти и (хз, честно, словаря нет) могут дать небольшое ускорение. В основном RTX видеокарты и позже предлагают самое большое ускорение.

source: If a 'NaN' is generated in the model, this means that the model has corrupted and the model is likely to start deteriorating from this point on. Enabling NaN protection will stop training immediately in the event of a NaN. The last save will not contain the NaN, so you may still be able to rescue your model.
ru: Если 'Не число'(далее, NaN) сгенерировано в модели - это значит, что модель повреждена и с этого момента, скорее всего, начнет деградировать. Включение защиты от NaN немедленно остановит тренировку, в случае, если был обнаружен NaN. Последнее сохранение не будет содержать в себе NaN, так что у вас будет возможность спасти вашу модель.

source: convert
ru: конвертирование

source: [GPU Only]. The number of faces to feed through the model at once when running the Convert process. NB: Increasing this figure is unlikely to improve convert speed, however, if you are getting Out of Memory errors, then you may want to reduce the batch size.
ru: [Только для видеокарт] Количество лиц, проходящих через модель в одно время во время конвертирования Примечание: Увеличение этого значения вряд ли повлечет за собой ускорение конвертирования, однако, если у вас появляются ошибки 'Out of Memory', тогда стоит снизить размер пачки.

source: Loss configuration options Loss is the mechanism by which a Neural Network judges how well it thinks that it is recreating a face.
ru: Настройки потерь Потеря - механизм, по которому Нейронная Сеть судит, насколько хорошо она воспроизводит лицо.

source: loss
ru: потери

source: The loss function to use.
ru: Какую функцию потерь стоит использовать.

source: The second loss function to use. If using a structural based loss (such as SSIM, MS-SSIM or GMSD) it is common to add an L1 regularization(MAE) or L2 regularization (MSE) function. You can adjust the weighting of this loss function with the loss_weight_2 option.
ru: Вторая используемая функция потерь. При использовании потерь, основанных на структуре (таких как SSIM, MS-SSIM или GMSD), обычно добавляется функция регуляризации L1 (MAE) или регуляризации L2 (MSE). Вы можете настроить вес этой функции потерь с помощью параметра loss_weight_2.

source: The amount of weight to apply to the second loss function. The value given here is as a percentage denoting how much the selected function should contribute to the overall loss cost of the model. For example: 100 - The loss calculated for the second loss function will be applied at its full amount towards the overall loss score. 25 - The loss calculated for the second loss function will be reduced by a quarter prior to adding to the overall loss score. 400 - The loss calculated for the second loss function will be mulitplied 4 times prior to adding to the overall loss score. 0 - Disables the second loss function altogether.
ru: Величина веса, применяемая ко второй функции потерь. Значение задается в процентах и показывает, какой вклад выбранная функция должна внести в общую стоимость потерь модели. Например: 100 - Потери, рассчитанные для четвертой функции потерь, будут применены в полном объеме к общей стоимости потерь. 25 - Потери, рассчитанные для четвертой функции потерь, будут уменьшены на четверть перед добавлением к общей стоимости потерь. 400 - Потери, рассчитанные для четвертой функции потерь, будут умножены в 4 раза перед добавлением к общей оценке потерь. 0 - Полностью отключает четвертую функцию потерь.

source: The third loss function to use. You can adjust the weighting of this loss function with the loss_weight_3 option.
ru: Третья используемая функция потерь. Вы можете настроить вес этой функции потерь с помощью параметра loss_weight_3.

source: The amount of weight to apply to the third loss function. The value given here is as a percentage denoting how much the selected function should contribute to the overall loss cost of the model. For example: 100 - The loss calculated for the third loss function will be applied at its full amount towards the overall loss score. 25 - The loss calculated for the third loss function will be reduced by a quarter prior to adding to the overall loss score. 400 - The loss calculated for the third loss function will be mulitplied 4 times prior to adding to the overall loss score. 0 - Disables the third loss function altogether.
ru: Величина веса, применяемая к третьей функции потерь. Значение задается в процентах и показывает, какой вклад выбранная функция должна внести в общую стоимость потерь модели. Например: 100 - Потери, рассчитанные для четвертой функции потерь, будут применены в полном объеме к общей стоимости потерь. 25 - Потери, рассчитанные для четвертой функции потерь, будут уменьшены на четверть перед добавлением к общей стоимости потерь. 400 - Потери, рассчитанные для четвертой функции потерь, будут умножены в 4 раза перед добавлением к общей оценке потерь. 0 - Полностью отключает четвертую функцию потерь.

source: The fourth loss function to use. You can adjust the weighting of this loss function with the loss_weight_3 option.
ru: Четвертая используемая функция потерь. Вы можете настроить вес этой функции потерь с помощью параметра 'loss_weight_4'.

source: The amount of weight to apply to the fourth loss function. The value given here is as a percentage denoting how much the selected function should contribute to the overall loss cost of the model. For example: 100 - The loss calculated for the fourth loss function will be applied at its full amount towards the overall loss score. 25 - The loss calculated for the fourth loss function will be reduced by a quarter prior to adding to the overall loss score. 400 - The loss calculated for the fourth loss function will be mulitplied 4 times prior to adding to the overall loss score. 0 - Disables the fourth loss function altogether.
ru: Величина веса, применяемая к четвертой функции потерь. Значение задается в процентах и показывает, какой вклад выбранная функция должна внести в общую стоимость потерь модели. Например: 100 - Потери, рассчитанные для четвертой функции потерь, будут применены в полном объеме к общей стоимости потерь. 25 - Потери, рассчитанные для четвертой функции потерь, будут уменьшены на четверть перед добавлением к общей стоимости потерь. 400 - Потери, рассчитанные для четвертой функции потерь, будут умножены в 4 раза перед добавлением к общей оценке потерь. 0 - Полностью отключает четвертую функцию потерь.

source: The loss function to use when learning a mask. MAE - Mean absolute error will guide reconstructions of each pixel towards its median value in the training dataset. Robust to outliers but as a median, it can potentially ignore some infrequent image types in the dataset. MSE - Mean squared error will guide reconstructions of each pixel towards its average value in the training dataset. As an average, it will be susceptible to outliers and typically produces slightly blurrier results.
ru: Функция потерь, используемая при обучении маски. MAE - средняя абсолютная погрешность('Mean absolute error') направляет реконструкцию каждого пикселя к его срединному значению в обучающем наборе данных. Устойчива к выбросам, но как медиана может игнорировать некоторые редкие типы изображений в наборе данных. MSE - средняя квадратичная погрешность('Mean squared error') направляет реконструкцию каждого пикселя к его срединному значению в обучающем наборе данных. Как среднее значение, оно чувствительно к выбросам и обычно дает немного более размытые результаты.

source: The amount of priority to give to the eyes. The value given here is as a multiplier of the main loss score. For example: 1 - The eyes will receive the same priority as the rest of the face. 10 - The eyes will be given a score 10 times higher than the rest of the face. NB: Penalized Mask Loss must be enable to use this option.
ru: Величина приоритета, которую следует придать глазам. Значение дается как множитель основного показателя потерь. Например: 1 - Глаза получат тот же приоритет, что и остальное лицо. 10 - глаза получат оценку в 10 раз выше, чем остальные части лица. NB: Penalized Mask Loss должен быть включен, чтобы использовать эту опцию.

source: The amount of priority to give to the mouth. The value given here is as a multiplier of the main loss score. For Example: 1 - The mouth will receive the same priority as the rest of the face. 10 - The mouth will be given a score 10 times higher than the rest of the face. NB: Penalized Mask Loss must be enable to use this option.
ru: Величина приоритета, которую следует придать рту. Значение дается как множитель основного показателя потерь. Например: 1 - Рот получит тот же приоритет, что и остальное лицо. 10 - Рот получит оценку в 10 раз выше, чем остальные части лица. NB: Penalized Mask Loss должен быть включен, чтобы использовать эту опцию.

source: Image loss function is weighted by mask presence. For areas of the image without the facial mask, reconstruction errors will be ignored while the masked face area is prioritized. May increase overall quality by focusing attention on the core face area.
ru: Функция потерь изображения взвешивается по наличию маски. Для областей изображения без маски лица погрешности реконструкции игнорируются, в то время как область лица с маской является приоритетной. Может повысить общее качество за счет концентрации внимания на основной области лица.

source: mask
ru: маска

source: The mask to be used for training. If you have selected 'Learn Mask' or 'Penalized Mask Loss' you must select a value other than 'none'. The required mask should have been selected as part of the Extract process. If it does not exist in the alignments file then it will be generated prior to training commencing. none: Don't use a mask. bisenet-fp_face: Relatively lightweight NN based mask that provides more refined control over the area to be masked (configurable in mask settings). Use this version of bisenet-fp if your model is trained with 'face' or 'legacy' centering. bisenet-fp_head: Relatively lightweight NN based mask that provides more refined control over the area to be masked (configurable in mask settings). Use this version of bisenet-fp if your model is trained with 'head' centering. components: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks to create a mask. custom_face: Custom user created, face centered mask. custom_head: Custom user created, head centered mask. extended: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks and the mask is extended upwards onto the forehead. vgg-clear: Mask designed to provide smart segmentation of mostly frontal faces clear of obstructions. Profile faces and obstructions may result in sub-par performance. vgg-obstructed: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been specifically trained to recognize some facial obstructions (hands and eyeglasses). Profile faces may result in sub-par performance. unet-dfl: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been trained by community members and will need testing for further description. Profile faces may result in sub-par performance.
ru: Маска, которая будет использоваться для обучения. Если вы выбрали 'Learn Mask' или 'Penalized Mask Loss', вы должны выбрать значение, отличное от 'none'. Необходимая маска должна быть выбрана в процессе извлечения. Если она не существует в файле выравниваний, то она будет создана до начала обучения. none: Не использовать маску. bisenet-fp_face: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью (настраивается в настройках маски). Используйте эту версию bisenet-fp, если ваша модель обучена с центрированием 'face' или 'legacy'. bisenet-fp_head: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью (настраивается в параметрах маски). Используйте эту версию bisenet-fp, если ваша модель обучена с центрированием 'head'. components: Маска, разработанная для сегментации лица на основе расположения ориентиров. Для создания маски вокруг внешних ориентиров строится выпуклая оболочка. custom_face: Пользовательская маска, созданная пользователем и центрированная по лицу. custom_head: Созданная пользователем маска, центрированная по голове. extended: Маска, разработанная для сегментации лица на основе расположения ориентиров. Выпуклый корпус строится вокруг внешних ориентиров, и маска расширяется вверх на лоб. vgg-clear: Маска предназначена для интеллектуальной сегментации преимущественно фронтальных лиц без препятствий. Профильные лица и препятствия могут привести к снижению производительности. vgg-obstructed: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была специально обучена распознавать некоторые препятствия на лице (руки и очки). Профильные лица могут иметь низкую производительность. unet-dfl: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была обучена членами сообщества и для дальнейшего описания нуждается в тестировании. Профильные лица могут иметь низкую производительность.

source: Dilate or erode the mask. Negative values erode the mask (make it smaller). Positive values dilate the mask (make it larger). The value given is a percentage of the total mask size.
ru: Расширяет или сужает маску. Отрицательные значения сужают маску (делают её меньше). Положительные значения расширяют маску (делают её больше).

source: Apply gaussian blur to the mask input. This has the effect of smoothing the edges of the mask, which can help with poorly calculated masks and give less of a hard edge to the predicted mask. The size is in pixels (calculated from a 128px mask). Set to 0 to not apply gaussian blur. This value should be odd, if an even number is passed in then it will be rounded to the next odd number.
ru: Применить размытие по Гауссу на входную маску. Дает эффект сглаживания краев маски, что может помочь с плохо вычисленными масками и дает менее резкий край предугаданной маске. Размер в пикселях (вычисленно из маски на 128 пикселей). Установите 0, чтобы не применять размытие по Гауссу. Это значение должно быть нечетным, если передано четное число, то оно будет округлено до следующего нечетного числа.

source: Sets pixels that are near white to white and near black to black. Set to 0 for off.
ru: Устанавливает пиксели, которые почти белые - в белые и которые почти черные - в черные. Установите 0, чтобы выключить.

source: Dedicate a portion of the model to learning how to duplicate the input mask. Increases VRAM usage in exchange for learning a quick ability to try to replicate more complex mask models.
ru: Выделить частичку модели обучению тому, как дублировать входную маску. Увеличивает использование видеопамяти в обмен на обучение быстрой способности попытки переделывать более сложные маски.
