Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/plugins.train._config.po
Languages: ru

source: NB: Unless specifically stated, values changed here will only take effect when creating a new model.
ru: Примечание: До тех пор, пока об этом не сказано, значения, измененные здесь, будут применены при создании новой модели.

source: Focal Frequency Loss. Analyzes the frequency spectrum of the images rather than the images themselves. This loss function can be used on its own, but the original paper found increased benefits when using it as a complementary loss to another spacial loss function (e.g. MSE). Ref: Focal Frequency Loss for Image Reconstruction and Synthesis https://arxiv.org/pdf/2012.12821.pdf NB: This loss does not currently work on AMD cards.
ru: Потеря фокальной частоты. Анализирует частотный спектр изображений, а не сами изображения. Эта функция потерь может использоваться сама по себе, но в оригинальной статье было обнаружено, что она дает больше преимуществ при использовании в качестве дополнительной потери к другой пространственной функции потерь (например, MSE). Ссылка: Focal Frequency Loss for Image Reconstruction and Synthesis [ТОЛЬКО на английском] https://arxiv.org/pdf/2012.12821.pdf NB: Эта потеря в настоящее время не работает на картах AMD.

source: Nvidia FLIP. A perceptual loss measure that approximates the difference perceived by humans as they alternate quickly (or flip) between two images. Used on its own and this loss function creates a distinct grid on the output. However it can be helpful when used as a complimentary loss function. Ref: FLIP: A Difference Evaluator for Alternating Images: https://research.nvidia.com/sites/default/files/node/3260/FLIP_Paper.pdf
ru: Nvidia FLIP. Мера потерь восприятия, которая приближает разницу, воспринимаемую человеком при быстром чередовании (или перелистывании) двух изображений. Используемая сама по себе, эта функция потерь создает на выходе отчетливую сетку. Однако она может быть полезна при использовании в качестве дополнительной функции потерь. Ссылка: FLIP: A Difference Evaluator for Alternating Images [ТОЛЬКО на английском]: https://research.nvidia.com/sites/default/files/node/3260/FLIP_Paper.pdf

source: Gradient Magnitude Similarity Deviation seeks to match the global standard deviation of the pixel to pixel differences between two images. Similar in approach to SSIM. Ref: Gradient Magnitude Similarity Deviation: An Highly Efficient Perceptual Image Quality Index https://arxiv.org/ftp/arxiv/papers/1308/1308.3052.pdf
ru: Отклонение Схожести Магнитуды Градиентов(Gradient Magnitude Similarity Deviation) пытается совместить глобальную стандартную девиацию различий пикселя к пикселю между двумя изображениями. Подход похож на SSIM. Ссылка: Gradient Magnitude Similarity Deviation: An Highly Efficient Perceptual Image Quality Index [ТОЛЬКО на английском] https://arxiv.org/ftp/arxiv/papers/1308/1308.3052.pdf

source: The L_inf norm will reduce the largest individual pixel error in an image. As each largest error is minimized sequentially, the overall error is improved. This loss will be extremely focused on outliers.
ru: Норма L_inf уменьшает наибольшую ошибку отдельного пикселя в изображении. По мере последовательной минимизации каждой наибольшей ошибки улучшается общая ошибка. Эта потеря будет чрезвычайно сосредоточена на выбросах.

source: Laplacian Pyramid Loss. Attempts to improve results by focussing on edges using Laplacian Pyramids. As this loss function gives priority to edges over other low-frequency information, like color, it should not be used on its own. The original implementation uses this loss as a complimentary function to MSE. Ref: Optimizing the Latent Space of Generative Networks https://arxiv.org/abs/1707.05776
ru: Потеря пирамиды Лапласиана. Пытается улучшить результаты, концентрируясь на краях с помощью пирамид Лапласиана. Поскольку эта функция потерь отдает приоритет краям, а не другой низкочастотной информации, например, цвету, ее не следует использовать самостоятельно. В оригинальной реализации эта потеря используется как дополнительная функция к MSE. Ссылка: Optimizing the Latent Space of Generative Networks [ТОЛЬКО на английском] https://arxiv.org/abs/1707.05776

source: LPIPS is a perceptual loss that uses the feature outputs of other pretrained models as a loss metric. Be aware that this loss function will use more VRAM. Used on its own and this loss will create a distinct moire pattern on the output, however it can be helpful as a complimentary loss function. The output of this function is strong, so depending on your chosen primary loss function, you are unlikely going to want to set the weight above about 25%. Ref: The Unreasonable Effectiveness of Deep Features as a Perceptual Metric http://arxiv.org/abs/1801.03924 This variant uses the AlexNet backbone. A fairly light and old model which performed best in the paper's original implementation. NB: For AMD Users the final linear layer is not implemented.
ru: LPIPS - это перцептивная потеря, которая использует в качестве метрики потерь выходные характеристики других предварительно обученных моделей. Имейте в виду, что эта функция потерь использует больше VRAM. При самостоятельном использовании эта потеря создает на выходе отчетливый муаровый рисунок, однако она может быть полезна как дополнительная функция потерь. Вывод этой функции является сильным, поэтому, в зависимости от выбранной вами основной функции потерь, вы вряд ли захотите устанавливать вес выше 25%. Ссылка: The Unreasonable Effectiveness of Deep Features as a Perceptual Metric [ТОЛЬКО на английском] http://arxiv.org/abs/1801.03924. Этот вариант использует основу AlexNet. Это довольно легкая и старая модель, которая лучше всего показала себя в оригинальной реализации. NB: Для пользователей AMD последний линейный слой не реализован.

source: Same as lpips_alex, but using the SqueezeNet backbone. A more lightweight version of AlexNet. NB: For AMD Users the final linear layer is not implemented.
ru: То же, что и lpips_alex, но использует основу SqueezeNet. Более облегченная версия AlexNet. NB: Для пользователей AMD последний линейный слой не реализован.

source: Same as lpips_alex, but using the VGG16 backbone. A more heavyweight model. NB: For AMD Users the final linear layer is not implemented.
ru: То же, что и lpips_alex, но использует основу VGG16. Более тяжелая модель. NB: Для пользователей AMD последний линейный слой не реализован.

source: log(cosh(x)) acts similar to MSE for small errors and to MAE for large errors. Like MSE, it is very stable and prevents overshoots when errors are near zero. Like MAE, it is robust to outliers.
ru: log(cosh(x)) действует аналогично MSE для малых ошибок и MAE для больших ошибок. Как и MSE, он очень стабилен и предотвращает переборы, когда ошибки близки к нулю. Как и MAE, он устойчив к выбросам.

source: Mean absolute error will guide reconstructions of each pixel towards its median value in the training dataset. Robust to outliers but as a median, it can potentially ignore some infrequent image types in the dataset.
ru: Средняя абсолютная погрешность направляет реконструкцию каждого пикселя к его медианному значению в обучающем наборе данных. Устойчив к выбросам, но в качестве медианы может игнорировать некоторые редкие типы изображений в наборе данных.

source: Mean squared error will guide reconstructions of each pixel towards its average value in the training dataset. As an avg, it will be susceptible to outliers and typically produces slightly blurrier results. Ref: Multi-Scale Structural Similarity for Image Quality Assessment https://www.cns.nyu.edu/pub/eero/wang03b.pdf
ru: Средняя квадратичная погрешность направляет реконструкцию каждого пикселя к его среднему значению в наборе данных для обучения. Как среднее значение, оно будет чувствительно к выбросам и обычно дает немного более размытые результаты. Ссылка: Multi-Scale Structural Similarity for Image Quality Assessment [ТОЛЬКО на английском]https://www.cns.nyu.edu/pub/eero/wang03b.pdf

source: Multiscale Structural Similarity Index Metric is similar to SSIM except that it performs the calculations along multiple scales of the input image.
ru: Метрика Индекса Многомасштабного Структурного Сходства (Multiscale Structural Similarity Index Metric) похожа на SSIM, за исключением того, что она выполняет вычисления по нескольким масштабам входного изображения.

source: Smooth_L1 is a modification of the MAE loss to correct two of its disadvantages. This loss has improved stability and guidance for small errors. Ref: A General and Adaptive Robust Loss Function https://arxiv.org/pdf/1701.03077.pdf
ru: Smooth_L1 - это модификация потери MAE для исправления двух ее недостатков. Эта потеря улучшает стабильность и ориентирование при небольших погрешностях. Ссылка: A General and Adaptive Robust Loss Function [ТОЛЬКО на английском] https://arxiv.org/pdf/1701.03077.pdf

source: Structural Similarity Index Metric is a perception-based loss that considers changes in texture, luminance, contrast, and local spatial statistics of an image. Potentially delivers more realistic looking images. Ref: Image Quality Assessment: From Error Visibility to Structural Similarity http://www.cns.nyu.edu/pub/eero/wang03-reprint.pdf
ru: Метрика индекса структурного сходства ('Structural Similarity Index Metric') - это основанная на восприятии потеря, которая учитывает изменения в текстуре, яркости, контрасте и локальной пространственной статистике изображения. Потенциально обеспечивает более реалистичный вид изображений. Ссылка: Image Quality Assessment: From Error Visibility to Structural Similarity [ТОЛЬКО на английском] http://www.cns.nyu.edu/pub/eero/wang03-reprint.pdf

source: Instead of minimizing the difference between the absolute value of each pixel in two reference images, compute the pixel to pixel spatial difference in each image and then minimize that difference between two images. Allows for large color shifts, but maintains the structure of the image.
ru: Вместо того чтобы минимизировать разницу между абсолютным значением каждого пикселя в двух образцовых изображениях, вычислить пространственную разницу между пикселями в каждом изображении и затем минимизировать эту разницу между двумя изображениями. Это позволяет получить большие цветовые сдвиги, но сохраняет структуру изображения.

source: Do not use an additional loss function.
ru: Не использовать функцию дополнительных потерь.

source: Options that apply to all models
ru: Настройки, применимые ко всем моделям

source: face
ru: лицо

source: How to center the training image. The extracted images are centered on the middle of the skull based on the face's estimated pose. A subsection of these images are used for training. The centering used dictates how this subsection will be cropped from the aligned images. face: Centers the training image on the center of the face, adjusting for pitch and yaw. head: Centers the training image on the center of the head, adjusting for pitch and yaw. NB: You should only select head centering if you intend to include the full head (including hair) in the final swap. This may give mixed results. Additionally, it is only worth choosing head centering if you are training with a mask that includes the hair (e.g. BiSeNet-FP-Head). legacy: The 'original' extraction technique. Centers the training image near the tip of the nose with no adjustment. Can result in the edges of the face appearing outside of the training area.
ru: Как централизовывать тренировочное изображение. Центр в извлеченных изображениях находится в середине черепа, основанный на примерной позе лица. Подсекция этих изображений используется для тренировки. Используемый центр диктует то, как эта подсекция будет обрезана из выравненных изображений. face: Центрирует учебное изображение по центру лица, регулируя угол наклона и поворота. head: Централизует тренировочное изображение в центре головы, регулируя угол наклона и поворота. Примечание: Следует выбирать централизацию головы, если вы планируете включать голову полностью (включая волосы) в финальную замену. Может дать смешанные результаты. В дополнении, оно стоит того только если вы тренируете с маской, что включает в себя волосы (к примеру: BiSeNet-FP-Head). legacy: 'оригинальная' техника извлечения. Централизует тренировочное изображение ближе к кончику носа без правок. Может привести к тому, что края лица будут вне тренировочной зоны.

source: How much of the extracted image to train on. A lower coverage will limit the model's scope to a zoomed-in central area while higher amounts can include the entire face. A trade-off exists between lower amounts given more detail versus higher amounts avoiding noticeable swap transitions. For 'Face' centering you will want to leave this above 75%. For Head centering you will most likely want to set this to 100%. Sensible values for 'Legacy' centering are: 62.5% spans from eyebrow to eyebrow. 75.0% spans from temple to temple. 87.5% spans from ear to ear. 100.0% is a mugshot.
ru: Сколько извлеченного изображения тренировать. Низкая покрытость ограничит прицел модели к приближенной центральной зоне, в то время как большие значения могут включать в себя целое лицо. Существует компромисс между меньшими объемами, дающими больше деталей, и большими объемами, позволяющими избежать заметных переходов замены. Для централизации 'Face', вам нужно будет оставить значение выше 75%. Для централизации 'Head', вам скорее всего нужно будет поставить значение 100%. Адекватные значения для 'Legacy': 62.5% охватывает от бровей до бровей. 75% охватывает от виска до виска. 87.5% охватывает от уха до уха. 100% - полный снимок.

source: initialization
ru: инициализация

source: Use ICNR to tile the default initializer in a repeating pattern. This strategy is designed for pairing with sub-pixel / pixel shuffler to reduce the 'checkerboard effect' in image reconstruction. https://arxiv.org/ftp/arxiv/papers/1707/1707.02937.pdf
ru: Использовать ICNR для чередования инициализатора по умолчанию в повторяющемся шаблоне. Эта стратегия предназначена для использования в паре с субпиксельным/пиксельным перетасовщиком для уменьшения "эффекта шахматной доски" при реконструкции изображения. [ТОЛЬКО на английском] https://arxiv.org/ftp/arxiv/papers/1707/1707.02937.pdf

source: Use Convolution Aware Initialization for convolutional layers. This can help eradicate the vanishing and exploding gradient problem as well as lead to higher accuracy, lower loss and faster convergence. NB: This can use more VRAM when creating a new model so you may want to lower the batch size for the first run. The batch size can be raised again when reloading the model. Multi-GPU is not supported for this option, so you should start the model on a single GPU. Once training has started, you can stop training, enable multi-GPU and resume. Building the model will likely take several minutes as the calculations for this initialization technique are expensive. This will only impact starting a new model.
ru: Использовать инициализацию с учетом свертки для сверточных слоев. Это поможет устранить проблему исчезающего и взрывающегося градиента, а также повысить точность, снизить потери и ускорить сходимость. Примечание: При создании новой модели может потребоваться больше видеопамяти, поэтому для первого запуска лучше уменьшить размер пачки. Размер пачки может быть увеличен при перезагрузке модели. Использование нескольких видеокарт не поддерживается, поэтому модель следует запускать на одной видеокарте. После начала обучения вы можете остановить обучение, включить несколько видеокарт и возобновить его. Построение модели, скорее всего, займет несколько минут, поскольку вычисления для этой техники инициализации являются дорогостоящими. Это повлияет только на запуск новой модели.

source: optimizer
ru: оптимизатор

source: The optimizer to use. adabelief - Adapting Stepsizes by the Belief in Observed Gradients. An optimizer with the aim to converge faster, generalize better and remain more stable. (https://arxiv.org/abs/2010.07468). NB: Epsilon for AdaBelief needs to be set to a smaller value than other Optimizers. Generally setting the 'Epsilon Exponent' to around '-16' should work. adam - Adaptive Moment Optimization. A stochastic gradient descent method that is based on adaptive estimation of first-order and second-order moments. nadam - Adaptive Moment Optimization with Nesterov Momentum. Much like Adam but uses a different formula for calculating momentum. rms-prop - Root Mean Square Propagation. Maintains a moving (discounted) average of the square of the gradients. Divides the gradient by the root of this average.
ru: Используемый оптимизатор. adabelief - Адаптация размеров шагов по убеждению в наблюдаемых градиентах('Adapting Stepsizes by the Belief in Observed Gradients'). Оптимизатор, цель которого - быстрее сходиться, лучше обобщаться и оставаться более стабильным. ([ТОЛЬКО на английском] https://arxiv.org/abs/2010.07468). Примечание: значение Epsilon для AdaBelief должно быть меньше, чем для других оптимизаторов. Как правило, значение 'Epsilon Exponent' должно быть около '-16'. adam - Адаптивная оптимизация моментов('Adaptive Moment Optimization'). Стохастический метод градиентного спуска, основанный на адаптивной оценке моментов первого и второго порядка. nadam - Адаптивная оптимизация моментов с моментумом Нестерова ('Adaptive Moment Optimization with Nesterov Momentum'). Похож на Adam, но использует другую формулу для вычисления момента. rms-prop - Распространение корневого среднего квадрата ('Root Mean Square Propagation'). Поддерживает скользящее (дисконтированное) среднее квадрата градиентов. Делит градиент на корень из этого среднего.

source: Learning rate - how fast your network will learn (how large are the modifications to the model weights after one batch of training). Values that are too large might result in model crashes and the inability of the model to find the best solution. Values that are too small might be unable to escape from dead-ends and find the best global minimum.
ru: Скорость обучения - насколько быстро ваша модель будет обучаться (насколько огромны изменения весов модели после одной пачки тренировки). Слишком большие значения могут привести к крахам модели и невозможности модели найти лучшее решение. Слишком маленькие значения могут привести к невозможности выбраться из тупиков и найти лучший глобальный минимум.

source: The epsilon adds a small constant to weight updates to attempt to avoid 'divide by zero' errors. Unless you are using the AdaBelief Optimizer, then Generally this option should be left at default value, For AdaBelief, setting this to around '-16' should work. In all instances if you are getting 'NaN' loss values, and have been unable to resolve the issue any other way (for example, increasing batch size, or lowering learning rate), then raising the epsilon can lead to a more stable model. It may, however, come at the cost of slower training and a less accurate final result. NB: The value given here is the 'exponent' to the epsilon. For example, choosing '-7' will set the epsilon to 1e-7. Choosing '-3' will set the epsilon to 0.001 (1e-3).
ru: Эпсилон добавляет небольшую константу к обновлениям веса, чтобы попытаться избежать ошибок "деления на ноль". Если вы не используете оптимизатор AdaBelief, то, как правило, этот параметр следует оставить по умолчанию. Для AdaBelief подойдет значение около '-16'. Во всех случаях, если вы получаете значения потерь 'NaN' и не смогли решить проблему другим способом (например, увеличив размер пачки или уменьшив скорость обучения), то увеличение эпсилона может привести к более стабильной модели. Однако это может стоить более медленного обучения и менее точного конечного результата. Примечание: Значение, указанное здесь, является "экспонентой" к эпсилону. Например, при выборе значения '-7' эпсилон будет равен 1e-7. При выборе значения "-3" эпсилон будет равен 0,001 (1e-3).

source: When to save the Optimizer Weights. Saving the optimizer weights is not necessary and will increase the model file size 3x (and by extension the amount of time it takes to save the model). However, it can be useful to save these weights if you want to guarantee that a resumed model carries off exactly from where it left off, rather than spending a few hundred iterations catching up. never - Don't save optimizer weights. always - Save the optimizer weights at every save iteration. Model saving will take longer, due to the increased file size, but you will always have the last saved optimizer state in your model file. exit - Only save the optimizer weights when explicitly terminating a model. This can be when the model is actively stopped or when the target iterations are met. Note: If the training session ends because of another reason (e.g. power outage, Out of Memory Error, NaN detected) then the optimizer weights will NOT be saved.
ru: Когда сохранять веса оптимизатора. Сохранение весов оптимизатора не является необходимым и увеличит размер файла модели в 3 раза (и соответственно время, необходимое для сохранения модели). Однако может быть полезно сохранить эти веса, если вы хотите гарантировать, что возобновленная модель продолжит работу именно с того места, где она остановилась, а не тратит несколько сотен итераций на догонялки. never - не сохранять веса оптимизатора. always - сохранять веса оптимизатора при каждой итерации сохранения. Сохранение модели займет больше времени из-за увеличенного размера файла, но в файле модели всегда будет последнее сохраненное состояние оптимизатора. exit - сохранять веса оптимизатора только при явном завершении модели. Это может быть, когда модель активно останавливается или когда выполняются целевые итерации. Примечание. Если сеанс обучения завершается по другой причине (например, отключение питания, ошибка нехватки памяти, обнаружение NaN), веса оптимизатора НЕ будут сохранены.

source: Learning Rate Finder
ru: Инструмент поиска оптимального коэффициента обучения

source: The number of iterations to process to find the optimal learning rate. Higher values will take longer, but will be more accurate.
ru: Количество итераций для поиска оптимального коэффициента обучения. Большие значения займут больше времени, но будут более точными.

source: The operation mode for the learning rate finder. Only applicable to new models. For existing models this will always default to 'set'. set - Train with the discovered optimal learning rate. graph_and_set - Output a graph in the training folder showing the discovered learning rates and train with the optimal learning rate. graph_and_exit - Output a graph in the training folder with the discovered learning rates and exit.
ru: Режим работы для поиска коэффициента обучения. Применимо только для новых моделей. Для уже существующих моделей режим будет автоматически выставлен в 'set'. set - Обучение с найденным оптимальным коэффициентом обучения. graph_and_set - Вывод графика в папку обучения, показывающего найденные коэффициенты обучения, и обучение с оптимальным коэффициентом. graph_and_exit - Вывод графика в папку обучения с найденными коэффициентами обучения с последующим выходом из программы.
