Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.mask.cli.po
Languages: es, kr, ru

source: R|Whether to output the whole frame or only the face box when using output processing. Only has an effect when using frames as input.
es: R|Marcar esta opción dará como salida el fotograma completo, en vez de sólo el cuadro de la cara cuando se utiliza el procesamiento de salida. Sólo tiene efecto cuando se utilizan cuadros como entrada.
kr: R|출력 처리를 사용할 때 전체 프레임을 출력할지 또는 페이스 박스만 출력할지 여부. 프레임을 입력으로 사용할 때만 효과가 있습니다.
ru: R|Выводить ли весь кадр или только поле лица при использовании выходной обработки. Имеет значение только при использовании кадров в качестве входных данных.
