Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.manual.po
Languages: es, ru

source: This command lets you perform various actions on frames, faces and alignments files using visual tools.
es: Este comando le permite realizar varias acciones en los archivos de fotogramas, caras y alineaciones utilizando herramientas visuales.
ru: Эта команда позволяет выполнять различные действия с кадрами, гранями и файлами выравнивания с помощью визуальных инструментов.

source: A tool to perform various actions on frames, faces and alignments files using visual tools
es: Una herramienta que permite realizar diversas acciones en archivos de fotogramas, caras y alineaciones mediante herramientas visuales
ru: Инструмент для выполнения различных действий с кадрами, лицами и файлами выравнивания с помощью визуальных инструментов

source: data
es: datos
ru: данные

source: Path to the alignments file for the input, if not at the default location
es: Ruta del archivo de alineaciones para la entrada, si no está en la ubicación por defecto
ru: Путь к файлу выравниваний для входных данных, если он не находится в месте по умолчанию

source: Video file or directory containing source frames that faces were extracted from.
es: Archivo o directorio de vídeo que contiene los fotogramas de origen de los que se extrajeron las caras.
ru: Видеофайл или папка, содержащая исходные кадры, из которых были извлечены лица.

source: options
es: opciones
ru: опции

source: Force regeneration of the low resolution jpg thumbnails in the alignments file.
es: Forzar la regeneración de las miniaturas jpg de baja resolución en el archivo de alineaciones.
ru: Принудительное восстановление миниатюр jpg низкого разрешения в файле выравнивания.

source: The process attempts to speed up generation of thumbnails by extracting from the video in parallel threads. For some videos, this causes the caching process to hang. If this happens, then set this option to generate the thumbnails in a slower, but more stable single thread.
es: El proceso intenta acelerar la generación de miniaturas extrayendo del vídeo en hilos paralelos. En algunos vídeos, esto hace que el proceso de extracción se cuelgue. Si esto sucede, entonces configure esta opción para generar las miniaturas en un solo hilo más lento, pero más estable.
ru: Процесс пытается ускорить генерацию эскизов путем извлечения из видео в параллельных потоках. Для некоторых видео это приводит к зависанию процесса кэширования. Если это происходит, установите этот параметр, чтобы генерировать эскизы в более медленном, но более стабильном одном потоке.

source: Display the landmarks mesh
es: Mostrar la malla de puntos de referencia
ru: Отображение сетки ориентиров

source: Display the mask
es: Mostrar la máscara
ru: Отображение маски

source: Magnify/Demagnify the View
es: Ampliar/Reducir la vista
ru: Увеличение/уменьшение изображения

source: Delete Face
es: Borrar cara
ru: Удалить лицо

source: Bounding Box Editor Edit the bounding box being fed into the aligner to recalculate the landmarks. - Grab the corner anchors to resize the bounding box. - Click and drag the bounding box to relocate. - Click in empty space to create a new bounding box. - Right click a bounding box to delete a face.
es: Editor del cuadro delimitador Edite el cuadro delimitador que el alineador usa para recalcular los puntos de referencia. - Tire de los anclajes de las esquinas para cambiar el tamaño del cuadro delimitador. - Haga clic y arrastre el cuadro delimitador para reubicarlo. - Haga clic en un espacio vacío para crear un nuevo cuadro delimitador. - Haga clic con el botón derecho del ratón en un cuadro delimitador para eliminar una cara.
ru: Редактор ограничительных рамок Отредактируйте ограничивающую рамку, подаваемую в выравниватель, чтобы пересчитать ориентиры. - Захватите угловые опоры, чтобы изменить размер ограничивающей рамки. - Щелкните и перетащите ограничивающую рамку для перемещения. - Щелкните в пустом пространстве, чтобы создать новую ограничивающую рамку. - Щелкните правой кнопкой мыши ограничительную рамку, чтобы удалить лицо.

source: Aligner to use. FAN will obtain better alignments, but cv2-dnn can be useful if FAN cannot get decent alignments and you want to set a base to edit from.
es: Alineador a utilizar. FAN obtendrá mejores alineaciones, pero cv2-dnn puede ser útil si FAN no puede obtener alineaciones decentes y quiere tener una base inicial que luego se vaya a editar.
ru: Выравниватель для использования. FAN получит лучшие выравнивания, но cv2-dnn может быть полезен, если FAN не может получить достойные выравнивания, и вы хотите установить базу для редактирования.

source: Normalization method to use for feeding faces to the aligner. This can help the aligner better align faces with difficult lighting conditions. Different methods will yield different results on different sets. NB: This does not impact the output face, just the input to the aligner. none: Don't perform normalization on the face. clahe: Perform Contrast Limited Adaptive Histogram Equalization on the face. hist: Equalize the histograms on the RGB channels. mean: Normalize the face colors to the mean.
es: Método de normalización a utilizar para las caras que el alineador usará. Esto puede ayudar al alineador a alinear mejor las caras con condiciones de iluminación difíciles. Diferentes métodos darán diferentes resultados en diferentes conjuntos. NB: Esto no afecta a la cara de salida, sólo la entrada al alineador. ninguno: No realizar la normalización en la cara. clahe: Realiza la ecualización adaptativa del histograma con contraste limitado en la cara. hist: Iguala los histogramas en los canales RGB. mean: Normaliza los colores de la cara a la media.
ru: Метод нормализации, используемый для подачи лиц в выравниватель. Это может помочь выравнивателю лучше выравнивать лица при сложных условиях освещения. Различные методы дают разные результаты на разных наборах. Примечание: Это не влияет на выходное лицо, только на входное в выравниватель. none: Не выполнять нормализацию лица. clahe: Выполнить для лица адаптивную гистограммную эквализацию с ограничением контраста. hist: Выравнивание гистограмм по каналам RGB. mean: Нормализовать цвета лица к среднему значению.

source: Extract Box Editor Move the extract box that has been generated by the aligner. Click and drag: - Inside the bounding box to relocate the landmarks. - The corner anchors to resize the landmarks. - Outside of the corners to rotate the landmarks.
es: Editor de cuadros de extracción Mueve el cuadro de extracción que ha sido generada por el alineador. Haga clic y arrastre... - Dentro del cuadro delimitador para reubicar los puntos de referencia. - Los anclajes de las esquinas para cambiar el tamaño de los puntos de referencia. - Fuera de las esquinas para girar los puntos de referencia.
ru: Редактор поля извлечения Переместите поле извлечения, созданное выравнивателем. Нажмите и перетащите: - Внутри ограничивающей рамки для перемещения опорных точек. - По угловым опорам для изменения размера опорных точек. - За пределами углов, чтобы повернуть опорные точки.

source: Landmark Point Editor Edit the individual landmark points. - Click and drag individual points to relocate. - Draw a box to select multiple points to relocate.
es: Editor de puntos de referencia Edite los puntos de referencia individuales. - Haga clic y arrastre los puntos individuales para reubicarlos. - Dibuje un cuadro para seleccionar varios puntos para reubicarlos.
ru: Редактор точек ориентира Редактирование отдельных опорных точек. - Щелкните и перетащите отдельные точки для перемещения. - Нарисуйте рамку, чтобы выбрать несколько точек для перемещения.

source: Mask Editor Edit the mask. - NB: For Landmark based masks (e.g. components/extended) it is better to make sure the landmarks are correct rather than editing the mask directly. Any change to the landmarks after editing the mask will override your manual edits.
es: Editor de máscaras Edite la máscara. - Nota: En el caso de las máscaras basadas en puntos de referencia (por ejemplo, componentes/extensión) es mejor asegurarse de que los puntos de referencia son correctos en lugar de editar la máscara directamente. Cualquier cambio en los puntos de referencia después de editar la máscara anulará sus ediciones manuales.
ru: Редактор маски Отредактировать маску. - Примечание: Для масок, основанных на ориентирах (например, компоненты/расширенные), лучше убедиться в правильности ориентиров, а не редактировать маску напрямую. Любое изменение ориентиров после редактирования маски отменит ваши ручные правки.

source: Draw Tool
es: Herramienta de dibujo
ru: Инструмент рисования

source: Erase Tool
es: Herramienta de borrado
ru: Инструмент "Ластик"

source: Select which mask to edit
es: Seleccionar máscara a editar
ru: Выбрать, какую маску редактировать

source: Set the brush size. ([ - decrease, ] - increase)
es: Seleccionar el tamaño del pincel ([ - disminuir, ] - aumentar)
ru: Установить размер кисти. ([ - уменьшение, ] - увеличение)

source: Select the brush cursor color.
es: Seleccionar el color del pincel.
ru: Установить цвет курсора кисти.

source: Play/Pause (SPACE)
es: Reproducir/Pausa (BARRA DE ESPACIO)
ru: Воспроизвести/Приостановить (ПРОБЕЛ)

source: Go to First Frame (HOME)
es: Ir al primer cuadro (INICIO)
ru: Перейти к первому кадру (HOME)

source: Go to Previous Frame (Z)
es: Ir al cuadro anterior (Z)
ru: Перейти к предыдущему кадру (Z/Я)

source: Go to Next Frame (X)
es: Ir al siguiente cuadro (X)
ru: Перейти к следующему кадру (X/Ч)

source: Go to Last Frame (END)
es: Ir al último cuadro (FIN)
ru: Перейти к последнему кадру (END)

source: Extract the faces to a folder... (Ctrl+E)
es: Extraer las caras a una carpeta... (Ctrl+E)
ru: Извлечь лица в папку... (Ctrl+E)

source: Save the Alignments file (Ctrl+S)
es: Guardar el fichero de alineamientos (Ctrl+S)
ru: Сохранить файл выравнивания (Ctrl+S)

source: Filter Frames to only those Containing the Selected Item (F)
es: Mostrar cuadros que contenga únicamente el elemento seleccionado (F)
ru: Отфильтровать кадры, содержащие только выбранный элемент (F/А)

source: Set the distance from an 'average face' to be considered misaligned. Higher distances are more restrictive
es: Establezca la distancia desde una 'cara promedio' para que se considere desalineada. Las distancias más altas son más restrictivas
ru: Установить расстояние от "среднего лица", на котором оно будет считаться смещенным. Большие расстояния являются более ограничительными

source: View alignments
es: Ver alineamientos
ru: Просмотреть выравнивания

source: Bounding box editor
es: Editor de cuadro delimitador
ru: Редактор ограничительных рамок

source: Location editor
es: Editor de ubicación
ru: Редактор расположения

source: Mask editor
es: Editor de máscara
ru: Редактор маски

source: Landmark point editor
es: Editor de puntos de referencia
ru: Редактор точек ориентира

source: Next
es: Siguiente
ru: Следующий

source: Previous
es: Anterior
ru: Предыдущий

source: Revert to saved Alignments ({})
es: Volver a los alineamientos guardados ({})
ru: Откатить до сохраненных выравниваний ({})

source: Copy {} Alignments ({})
es: Copiar los alineamientos del cuadro {} ({})
ru: Копировать {} выравнивания ({})
