Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.alignments.cli.po
Languages: es, kr, ru

source: This command lets you perform various tasks pertaining to an alignments file.
es: Este comando le permite realizar varias tareas relacionadas con un archivo de alineación.
kr: 이 명령을 사용하여 alignments 파일과 관련된 다양한 작ㅇ를 수행할 수 있습니다.
ru: Эта команда позволяет выполнять различные задачи, относящиеся к файлу выравнивания.

source: Alignments tool This tool allows you to perform numerous actions on or using an alignments file against its corresponding faceset/frame source.
es: Herramienta de alineación Esta herramienta le permite realizar numerosas acciones sobre un conjunto de caras o una fuente de fotogramas, usando opcionalmente su correspondiente archivo de alineación.
kr: _alignments 도구 이 도구를 사용하면 해당 얼굴 세트/프레임 원본에 해당하는 alignments 파일을 사용하거나 여러 작업을 수행할 수 있습니다.
ru: Инструмент выравнивания Этот инструмент позволяет выполнять многочисленные действия с файлом выравнивания или с его использованием против соответствующего набора лиц/кадров.

source: Must Pass in a frames folder/source video file (-r).
es: Debe indicar una carpeta de fotogramas o archivo de vídeo de origen (-r).
kr: 프레임들이 저장된 폴더나 원본 비디오 파일을 무조건 전달해야 합니다 (-r).
ru: Должен проходить в папке с кадрами/исходным видеофайлом (-r).

source: Must Pass in a faces folder (-c).
es: Debe indicar una carpeta de caras (-c).
kr: 얼굴 폴더를 무조건 전달해야 합니다 (-c).
ru: Должен проходить в папке с лицами (-c).

source: Must Pass in either a frames folder/source video file OR a faces folder (-r or -c).
es: Debe indicar una carpeta de fotogramas o archivo de vídeo de origen, o una carpeta de caras (-r o -c).
kr: 프레임 폴더나 원본 비디오 파일 또는 얼굴 폴더중 하나를 무조건 전달해야 합니다 (-r and -c).
ru: Должно передаваться либо в папку с кадрами/исходным видеофайлом, либо в папку с лицами (-r или -c).

source: Must Pass in a frames folder/source video file AND a faces folder (-r and -c).
es: Debe indicar una carpeta de fotogramas o archivo de vídeo de origen, y una carpeta de caras (-r y -c).
kr: 프레임 폴더나 원본 비디오 파일 그리고 얼굴 폴더를 무조건 전달해야 합니다 (-r and -c).
ru: Должно передаваться либо в папку с кадрами/исходным видеофайлом И в папку с лицами (-r и -c).

source: Use the output option (-o) to process results.
es: Usar la opción de salida (-o) para procesar los resultados.
kr: 결과를 진행하려면 (-o) 출력 옵션을 사용하세요.
ru: Используйте опцию вывода (-o) для обработки результатов.

source: processing
es: proceso
kr: 처리
ru: обработка

source: R|Choose which action you want to perform. NB: All actions require an alignments file (-a) to be passed in. L|'draw': Draw landmarks on frames in the selected folder/video. A subfolder will be created within the frames folder to hold the output.{0} L|'export': Export the contents of an alignments file to a json file. Can be used for editing alignment information in external tools and then re-importing by using Faceswap's Extract 'Import' plugins. Note: masks and identity vectors will not be included in the exported file, so will be re-generated when the json file is imported back into Faceswap. All data is exported with the origin (0, 0) at the top left of the canvas. L|'extract': Re-extract faces from the source frames/video based on alignment data. This is a lot quicker than re-detecting faces. Can pass in the '-een' (--extract-every-n) parameter to only extract every nth frame.{1} L|'from-faces': Generate alignment file(s) from a folder of extracted faces. if the folder of faces comes from multiple sources, then multiple alignments files will be created. NB: for faces which have been extracted from folders of source images, rather than a video, a single alignments file will be created as there is no way for the process to know how many folders of images were originally used. You do not need to provide an alignments file path to run this job. {3} L|'missing-alignments': Identify frames that do not exist in the alignments file.{2}{0} L|'missing-frames': Identify frames in the alignments file that do not appear within the frames folder/video.{2}{0} L|'multi-faces': Identify where multiple faces exist within the alignments file.{2}{4} L|'no-faces': Identify frames that exist within the alignment file but no faces were detected.{2}{0} L|'remove-faces': Remove deleted faces from an alignments file. The original alignments file will be backed up.{3} L|'rename' - Rename faces to correspond with their parent frame and position index in the alignments file (i.e. how they are named after running extract).{3} L|'sort': Re-index the alignments from left to right. For alignments with multiple faces this will ensure that the left-most face is at index 0. L|'spatial': Perform spatial and temporal filtering to smooth alignments (EXPERIMENTAL!)
es: R|Elija la acción que desea realizar. NB: Todas las acciones requieren que se indique un archivo de alineación (-a). L|'draw': Dibuja puntos de referencia en los fotogramas de la carpeta o vídeo seleccionado. Se creará una subcarpeta dentro de la carpeta de fotogramas para guardar el resultado.{0} L|'export': Exportar el contenido de un archivo de alineaciones a un archivo JSON. Se puede utilizar para editar información de alineación en herramientas externas y luego volver a importar mediante el uso de complementos de 'import' de extracto de Faceswap. Nota: Las máscaras y los vectores de identidad no se incluirán en el archivo exportado, por lo que se volverán a generar cuando el archivo JSON se importe a FacesWap. Todos los datos se exportan con el origen (0, 0) en la parte superior izquierda del lienzo. L|'extract': Reextrae las caras de los fotogramas o vídeos de origen basándose en los datos de alineación. Esto es mucho más rápido que volver a detectar las caras. Se puede pasar el parámetro '-een' (--extract-every-n) para extraer sólo cada enésimo fotograma.{1} L|'from-faces': genera archivos de alineación a partir de una carpeta de caras extraídas. si la carpeta de caras proviene de varias fuentes, se crearán varios archivos de alineación. NB: para las caras de las que se han extraído carpetas de imágenes de origen, en lugar de un video, se creará un único archivo de alineaciones, ya que el proceso no tiene forma de saber cuántas carpetas de imágenes se usaron originalmente. No necesita proporcionar una ruta de archivo de alineaciones para ejecutar este trabajo. {3} L|'missing-alignments': Identifica los fotogramas que no existen en el archivo de alineaciones.{2}{0} L|'missing-frames': Identifica los fotogramas del archivo de alineaciones que no aparecen en la carpeta de fotogramas o vídeo.{2}{0} L|'multi-faces': Identifica los casos en los que existen múltiples caras dentro de un mismo fotograma, en el archivo de alineaciones.{2}{4} L|'no-faces': Identifica los fotogramas que existen en el archivo de alineación pero no se detectan caras.{2}{0} L|'remove-faces': Elimina las caras previamente eliminadas de un archivo de alineaciones. Se hará una copia de seguridad del archivo de alineaciones original.{3} L|'rename': Cambia el nombre de las caras para que se correspondan con su marco padre y su índice de posición en el archivo de alineaciones (es decir, cómo se nombran después de ejecutar la extracción).{3} L|'sort': Reordena las alineaciones de izquierda a derecha. En el caso de alineaciones con múltiples caras, esto asegurará que la cara más a la izquierda esté en el índice 0. L|'spatial': Realiza un filtrado espacial y temporal para suavizar las alineaciones (¡EXPERIMENTAL!)
kr: R|실행할 작업을 선택합니다. 주의: 모든 작업을 수행하려면 alignments 파일(-a)을 전달해야 합니다. L|'draw': 선택한 폴더/비디오의 프레임에 특징점을 그립니다. 출력을 저장할 하위 폴더가 프레임 폴더 내에 생성됩니다.{0} L|'export': 정렬 파일의 내용을 JSON 파일로 내보내십시오. 외부 도구에서 정렬 정보를 편집 한 다음 FaceSwap의 추출물 'Import'플러그인을 사용하여 다시 인상하는 데 사용할 수 있습니다. 참고 : 마스크 및 ID 벡터는 내보내기 파일에 포함되지 않으므로 JSON 파일이 다시 FaceSwap으로 가져 오면 다시 생성됩니다. 모든 데이터는 캔버스의 왼쪽 상단에있는 원점 (0, 0)으로 내 보냅니다. L|'extract': alignments 데이터를 기반으로 소스 프레임/비디오에서 얼굴을 재추출합니다. 이것은 얼굴을 재감지하는 것보다 훨씬 더 빠릅니다. '-een'(--extract-every-n) 매개 변수를 전달하여 모든 n번째 프레임을 추출할 수 있습니다.{1} L|'from-faces': 추출된 얼굴 폴더에서 alignments 파일을 생성합니다. 폴더 내의 얼굴들을 여러 소스에서 가져온 경우 여러 alignments 파일이 생성됩니다. 참고: 비디오가 아닌 원본 이미지의 폴더를 추출한 얼굴의 경우, 원래 사용된 이미지의 폴더 수를 알 수 없으므로 단일 alignments 파일이 생성됩니다. 이 작업을 실행하기 위해 alignments 파일 경로를 제공할 필요는 없습니다. {3} L|'missing-alignments': alignments 파일에 없는 프레임을 식별합니다.{2}{0} L|'missing-frames': alignments 파일에서 [프레임 폴더/비디오] 내에 나타나지 않는 프레임을 식별합니다.{2}{0} L|'multi-faces': alignments 파일 내에서 여러 얼굴이 있는 위치를 식별합니다.{2}{4} L|'no faces': alignments 파일 내에 있지만 얼굴이 탐지되지 않은 프레임을 식별합니다.{2}{0} L|'removes-faces': alignments 파일에서 삭제된 얼굴을 제거합니다. 원래 alignments 파일은 백업됩니다.{3} L|'rename' : alignments 파일의 상위 프레임 및 위치 색인에 해당하도록 얼굴 이름을 바꿉니다(즉, 추출을 실행한 후에 얼굴 이름을 짓는 방법).{3} L|'sort': alignments을 왼쪽에서 오른쪽으로 다시 인덱싱합니다. 얼굴이 여러 개인 alignments의 경우 맨 왼쪽 얼굴이 색인 0에 있습니다. L| 'spatial': 공간 및 시간 필터링을 수행하여 alignments를 원활하게 수행합니다(실험적!).
ru: R|Выберите действие, которое вы хотите выполнить. Примечание: Все действия требуют передачи файла выравнивания (-a). L|'draw': Нарисовать ориентиры на кадрах в выбранной папке/видео. В папке frames будет создана подпапка для хранения результатов. L|'export': экспортировать содержимое файла выравнивания в файл JSON. Может использоваться для редактирования информации о выравнивании во внешних инструментах, а затем повторно импортируется с помощью плагинов Faceswap Extract 'Import'. ПРИМЕЧАНИЕ. Маски и векторы идентификации не будут включены в экспортированный файл, поэтому будут повторно сгенерированы, когда файл JSON будет импортирован обратно в Faceswap. Все данные экспортируются с началом координат (0, 0) в верхнем левом углу холста. L|'extract': Повторное извлечение лиц из исходных кадров/видео на основе данных о выравнивании. Это намного быстрее, чем повторное обнаружение лиц. Можно передать параметр '-een' (--extract-every-n), чтобы извлекать только каждый n-й кадр.{1} L|'from-faces': Создать файл(ы) выравнивания из папки с извлеченными лицами. Если папка с лицами получена из нескольких источников, то будет создано несколько файлов выравнивания. Примечание: для лиц, которые были извлечены из папок с исходными изображениями, а не из видео, будет создан один файл выравнивания, поскольку процесс не может знать, сколько папок с изображениями было использовано изначально. Для выполнения этого задания не нужно указывать путь к файлу выравнивания. {3} L|'missing-alignments': Определить кадры, которых нет в файле выравнивания.{2}{0} L|'missing-frames': Определить кадры в файле выравнивания, которые не появляются в папке frames/video.{2}{0} L|'multi-faces': Определить, где в файле выравнивания существует несколько лиц.{2}{4} L|'no-faces': Идентифицировать кадры, которые существуют в файле выравнивания, но лица не были обнаружены.{2}{0} L|'remove-faces': Удалить удаленные лица из файла выравнивания. Оригинальный файл выравнивания будет сохранен.{3} L|'rename' - Переименовать лица в соответствии с их родительским кадром и индексом позиции в файле выравниваний (т.е. как они будут названы после запуска extract).{3} L|'sort': Переиндексирует выравнивания слева направо. Для выравниваний с несколькими гранями это гарантирует, что самое левое лицо будет иметь индекс 0. L|'spatial': Выполнить пространственную и временную фильтрацию для сглаживания выравниваний (ЭКСПЕРИМЕНТАЛЬНО!).

source: R|How to output discovered items ('faces' and 'frames' only): L|'console': Print the list of frames to the screen. (DEFAULT) L|'file': Output the list of frames to a text file (stored within the source directory). L|'move': Move the discovered items to a sub-folder within the source directory.
es: R|Como procesar los elementos descubiertos (sólo 'caras' y 'cuadros'): L|'console': Muestra la lista de fotogramas en la pantalla. (POR DEFECTO) L|'file': Redirige la lista de fotogramas a un archivo de texto (almacenado en el directorio de origen). L|'move': Mueve los elementos descubiertos a una subcarpeta dentro del directorio de origen.
kr: R|검색된 항목을 출력하는 방법('얼굴' 및 '프레임'만 해당): L|'console': 프레임 목록을 화면에 인쇄합니다. (기본값) L|'파일': 프레임 목록을 텍스트 파일(소스 디렉토리에 저장)로 출력합니다. L|'이동': 검색된 항목을 원본 디렉토리 내의 하위 폴더로 이동합니다.
ru: R|Как вывести обнаруженные элементы (только "лица" и "кадры"): L|'console': Вывести список рамок на экран. (DEFAULT) L|'file': Вывести список кадров в текстовый файл (хранящийся в исходном каталоге). L|'move': Переместить обнаруженные элементы в подпапку в исходном каталоге.

source: data
es: datos
kr: 데이터
ru: данные

source: Full path to the alignments file to be processed. If you have input a 'frames_dir' and don't provide this option, the process will try to find the alignments file at the default location. All jobs require an alignments file with the exception of 'from-faces' when the alignments file will be generated in the specified faces folder.
es: Ruta completa al archivo de alineaciones a procesar. Si ingresó un 'frames_dir' y no proporciona esta opción, el proceso intentará encontrar el archivo de alineaciones en la ubicación predeterminada. Todos los trabajos requieren un archivo de alineaciones con la excepción de 'from-faces' cuando el archivo de alineaciones se generará en la carpeta de caras especificada.
kr: 처리할 alignments 파일의 전체 경로입니다. 'frames_dir'을 입력했는데 이 옵션을 제공하지 않으면 프로세스는 기본 위치에서 alignments 파일을 찾으려고 합니다. 지정된 얼굴 폴더에 alignments 파일이 생성될 때 모든 작업은 'from-faces'를 제외한 alignments 파일이 필요로 합니다.
ru: Полный путь к обрабатываемому файлу выравниваний. Если вы ввели 'frames_dir' и не указали этот параметр, процесс попытается найти файл выравнивания в месте по умолчанию. Все задания требуют файл выравнивания, за исключением задания 'from-faces', когда файл выравнивания будет создан в указанной папке с лицами.

source: Directory containing source frames that faces were extracted from.
es: Directorio que contiene los fotogramas de origen de los que se extrajeron las caras.
kr: 얼굴 추출의 소스로 쓰인 원본 프레임이 저장된 디렉토리.
ru: Папка, содержащая исходные кадры, из которых были извлечены лица.

source: R|Run the aligmnents tool on multiple sources. The following jobs support batch mode: L|draw, extract, from-faces, missing-alignments, missing-frames, no-faces, sort, spatial. If batch mode is selected then the other options should be set as follows: L|alignments_file: For 'sort' and 'spatial' this should point to the parent folder containing the alignments files to be processed. For all other jobs this option is ignored, and the alignments files must exist at their default location relative to the original frames folder/video. L|faces_dir: For 'from-faces' this should be a parent folder, containing sub-folders of extracted faces from which to generate alignments files. For 'extract' this should be a parent folder where sub-folders will be created for each extraction to be run. For all other jobs this option is ignored. L|frames_dir: For 'draw', 'extract', 'missing-alignments', 'missing-frames' and 'no-faces' this should be a parent folder containing video files or sub-folders of images to perform the alignments job on. The alignments file should exist at the default location. For all other jobs this option is ignored.
es: R|Ejecute la herramienta de alineación en varias fuentes. Los siguientes trabajos admiten el modo por lotes: L|draw, extract, from-faces, missing-alignments, missing-frames, no-faces, sort, spatial. Si se selecciona el modo por lotes, las otras opciones deben configurarse de la siguiente manera: L|alignments_file: para 'sort' y 'spatial', debe apuntar a la carpeta principal que contiene los archivos de alineación que se van a procesar. Para todos los demás trabajos, esta opción se ignora y los archivos de alineaciones deben existir en su ubicación predeterminada en relación con la carpeta/video de fotogramas originales. L|faces_dir: para 'from-faces', esta debe ser una carpeta principal que contenga subcarpetas de caras extraídas desde las cuales generar archivos de alineación. Para 'extraer', esta debe ser una carpeta principal donde se crearán subcarpetas para cada extracción que se ejecute. Para todos los demás trabajos, esta opción se ignora. L|frames_dir: para 'draw', 'extract', 'missing-alignments', 'missing-frames' y 'no-faces', esta debe ser una carpeta principal que contenga archivos de video o subcarpetas de imágenes para realizar el trabajo de alineaciones en. El archivo de alineaciones debe existir en la ubicación predeterminada. Para todos los demás trabajos, esta opción se ignora.
kr: R|여러 소스에서 정렬 도구를 실행합니다. 다음 작업은 배치 모드를 지원합니다. L|그리기, 추출, 얼굴부터, 정렬 누락, 프레임 누락, 얼굴 없음, 정렬, 공간. 배치 모드를 선택한 경우 다른 옵션을 다음과 같이 설정해야 합니다. L|alignments_file: 'sort'및 'spatial'의 경우 처리할 정렬 파일이 포함된 상위 폴더를 가리켜야 합니다. 다른 모든 작업의 경우 이 옵션은 무시되며 정렬 파일은 원본 프레임 폴더/비디오에 상대적인 기본 위치에 있어야 합니다. L|faces_dir: 'from-faces'의 경우 정렬 파일을 생성할 추출된 면의 하위 폴더를 포함하는 상위 폴더여야 합니다. '추출'의 경우 실행할 각 추출에 대해 하위 폴더가 생성되는 상위 폴더여야 합니다. 다른 모든 작업의 경우 이 옵션은 무시됩니다. L|frames_dir: 'draw', 'extract', 'missing-alignments', 'missing-frames' 및 'no-faces'의 경우 비디오 파일이 포함된 상위 폴더 또는 정렬 작업을 수행할 이미지의 하위 폴더여야 합니다. 에. 정렬 파일은 기본 위치에 있어야 합니다. 다른 모든 작업의 경우 이 옵션은 무시됩니다.
ru: R|Запуск инструмента выравнивания на нескольких источниках. Следующие задания поддерживают пакетный режим: L|draw, extract, from-faces, missing-alignments, missing-frames, no-faces, sort, spatial. Если выбран пакетный режим, то остальные опции должны быть установлены следующим образом: L|alignments_file: Для заданий 'sort' и 'spatial' этот параметр должен указывать на родительскую папку, содержащую файлы выравниваний, которые будут обрабатываться. Для всех остальных заданий этот параметр игнорируется, и файлы выравнивания должны существовать в их расположении по умолчанию относительно исходной папки кадров/видео. L|faces_dir: Для 'from-faces' это должна быть родительская папка, содержащая вложенные папки с извлеченными лицами, из которых будут сгенерированы файлы выравнивания. Для 'extract' это должна быть родительская папка, в которой будут создаваться вложенные папки для каждой выполняемой экстракции. Для всех остальных заданий этот параметр игнорируется. L|frames_dir: Для 'draw', 'extract', 'missing-alignments', 'missing-frames' и 'no-faces' это должна быть родительская папка, содержащая видеофайлы или вложенные папки изображений для выполнения задания выравнивания. Файл выравнивания должен существовать в месте по умолчанию. Для всех остальных заданий этот параметр игнорируется.

source: extract
es: extracción
kr: 추출
ru: извлечение

source: [Extract only] Extract every 'nth' frame. This option will skip frames when extracting faces. For example a value of 1 will extract faces from every frame, a value of 10 will extract faces from every 10th frame.
es: [Sólo extracción] Extraer cada 'enésimo' fotograma. Esta opción omitirá los fotogramas al extraer las caras. Por ejemplo, un valor de 1 extraerá las caras de cada fotograma, un valor de 10 extraerá las caras de cada 10 fotogramas.
kr: [Extract only] 모든 'n번째' 프레임을 추출합니다. 이 옵션은 얼굴을 추출할 때 프레임을 건너뜁니다. 예를 들어, 값이 1이면 모든 프레임에서 얼굴이 추출되고, 값이 10이면 모든 10번째 프레임에서 얼굴이 추출됩니다.
ru: [Только извлечение] Извлекать каждый "n-й" кадр. Этот параметр пропускает кадры при извлечении лиц. Например, значение 1 будет извлекать лица из каждого кадра, значение 10 будет извлекать лица из каждого 10-го кадра.

source: [Extract only] The output size of extracted faces.
es: [Sólo extracción] El tamaño de salida de las caras extraídas.
kr: [Extract only] 추출된 얼굴들의 결과 크기입니다.
ru: [Только извлечение] Выходной размер извлеченных лиц.

source: [Extract only] Only extract faces that have been resized by this percent or more to meet the specified extract size (`-sz`, `--size`). Useful for excluding low-res images from a training set. Set to 0 to extract all faces. Eg: For an extract size of 512px, A setting of 50 will only include faces that have been resized from 256px or above. Setting to 100 will only extract faces that have been resized from 512px or above. A setting of 200 will only extract faces that have been downscaled from 1024px or above.
es: [Sólo extracción] Solo extraiga las caras que hayan cambiado de tamaño en este porcentaje o más para cumplir con el tamaño de extracción especificado (`-sz`, `--size`). Útil para excluir imágenes de baja resolución de un conjunto de entrenamiento. Establézcalo en 0 para extraer todas las caras. Por ejemplo: para un tamaño de extracto de 512 px, una configuración de 50 solo incluirá caras cuyo tamaño haya cambiado de 256 px o más. Si se establece en 100, solo se extraerán las caras que se hayan redimensionado desde 512 px o más. Una configuración de 200 solo extraerá las caras que se han reducido de 1024 px o más.
kr: [Extract only] 지정된 추출 크기('-sz', '--size')를 맞추기 위하여 크기가 이 비율 이상 resize된 얼굴들만 추출합니다. 훈련 세트에서 저해상도 이미지를 제외하는 데 유용합니다. 모든 얼굴을 추출하려면 0으로 설정합니다. 예: 추출 크기가 512px인 경우, 50으로 설정하면 크기가 256px 이상인 면만 포함됩니다. 100으로 설정하면 512px 이상에서 크기가 조정된 얼굴만 추출됩니다. 200으로 설정하면 1024px 이상에서 축소된 얼굴만 추출됩니다.
ru: [Только извлечение] Извлекать только те лица, размер которых был изменен на данный процент или более, чтобы соответствовать заданному размеру извлечения (`-sz`, `--size`). Полезно для исключения изображений с низким разрешением из обучающего набора. Установите значение 0, чтобы извлечь все лица. Например: Для размера экстракта 512px, при установке значения 50 будут извлечены только лица, размер которых был изменен с 256px или выше. При значении 100 будут извлечены только лица, размер которых был изменен с 512px или выше. При значении 200 будут извлечены только лица, уменьшенные с 1024px или выше.
