Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.preview.po
Languages: es, kr, ru

source: This command allows you to preview swaps to tweak convert settings.
es: Este comando permite previsualizar los intercambios para ajustar la configuración de la conversión.
kr: 이 명령어는 변환 설정을 변경하기 위한 변환 미리보기를 가능하게 해줍니다.
ru: Эта команда позволяет просматривать замены для настройки параметров конвертирования.

source: Preview tool Allows you to configure your convert settings with a live preview
es: Herramienta de vista previa Permite configurar los ajustes de conversión con una vista previa en directo
kr: 미리보기 도구 라이브로 미리보기를 보면서 변환 설정을 구성할 수 있도록 해줍니다
ru: Инструмент предпросмотра Позволяет настраивать параметры конвертации с помощью предварительного просмотра в реальном времени

source: data
es: datos
kr: 데이터
ru: данные

source: Input directory or video. Either a directory containing the image files you wish to process or path to a video file.
es: Directorio o vídeo de entrada. Un directorio que contenga los archivos de imagen que desea procesar o la ruta a un archivo de vídeo.
kr: 입력 디렉토리 또는 비디오. 처리할 이미지 파일이 들어 있는 디렉토리 또는 비디오 파일의 경로입니다.
ru: Входная папка или видео. Либо папка, содержащая файлы изображений, которые необходимо обработать, либо путь к видеофайлу.

source: Path to the alignments file for the input, if not at the default location
es: Ruta del archivo de alineaciones para la entrada, si no está en la ubicación por defecto
kr: 입력 alignments 파일의 경로, 만약 제공되지 않는다면 기본 위치
ru: Путь к файлу выравниваний для входных данных, если он не находится в месте по умолчанию

source: Model directory. A directory containing the trained model you wish to process.
es: Directorio del modelo. Un directorio que contiene el modelo entrenado que desea procesar.
kr: 모델 디렉토리. 사용자가 처리하고 싶어하는 훈련된 모델이 있는 디렉토리.
ru: Папка модели. Папка, содержащая обученную модель, которую вы хотите обработать.

source: Swap the model. Instead of A -> B, swap B -> A
es: Intercambiar el modelo. En lugar de convertir A en B, convierte B en A
kr: 모델을 스왑함. A -> B 대신, B -> A로 스왑함
ru: Поменять местами модели. Вместо A -> B заменить B -> A

source: Save full config
es: Guardar la configuración completa
kr: 전체 설정을 저장
ru: Сохранить полную конфигурацию

source: Reset full config to default values
es: Restablecer la configuración completa a los valores por defecto
kr: 전체 설정을 기본 값으로 초기화
ru: Сбросить полную конфигурацию до заводских значений

source: Reset full config to saved values
es: Restablecer la configuración completa a los valores guardados
kr: 전체 설정을 저장된 값으로 초기화
ru: Сбросить полную конфигурацию до сохраненных значений

source: Save {title} config
es: Guardar la configuración de {title}
kr: {title} 설정 저장
ru: Сохранить конфигурацию {title}

source: Reset {title} config to default values
es: Restablecer la configuración completa de {title} a los valores por defecto
kr: {title} 설정을 기본 값으로 초기화
ru: Сбросить полную конфигурацию {title} до заводских значений

source: Reset {title} config to saved values
es: Restablecer la configuración completa de {title} a los valores guardados
kr: {title} 설정을 저장된 값으로 초기화
ru: Сбросить полную конфигурацию {title} до сохраненных значений
