Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.effmpeg.cli.po
Languages: es, kr, ru

source: This command allows you to easily execute common ffmpeg tasks.
es: Este comando le permite ejecutar fácilmente tareas comunes de ffmpeg.
kr: 이 명령어는 사용자에게 일반 ffmpeg 작업을 쉽게 실행할 수 있도록 해줍니다.
ru: Эта команда позволяет легко выполнять общие задачи ffmpeg.

source: A wrapper for ffmpeg for performing image <> video converting.
es: Un interfaz de ffmpeg para realizar la conversión de imagen <> vídeo.
kr: 이미지 <> 비디오 변환을 수행하기 위한 ffmpeg용 wrapper입니다.
ru: Обертка для ffmpeg для выполнения конвертации изображений <> видео.

source: R|Choose which action you want ffmpeg ffmpeg to do. L|'extract': turns videos into images L|'gen-vid': turns images into videos L|'get-fps' returns the chosen video's fps. L|'get-info' returns information about a video. L|'mux-audio' add audio from one video to another. L|'rescale' resize video. L|'rotate' rotate video. L|'slice' cuts a portion of the video into a separate video file.
es: R|Elige qué acción quieres que haga ffmpeg L|'extract': convierte los vídeos en imágenes L|'gen-vid': convierte las imágenes en vídeos L|'get-fps' devuelve los fps del vídeo elegido. L|'get-info' devuelve información sobre un vídeo. L|'mux-audio' añade audio de un vídeo a otro. L|'rescale' cambia el tamaño del vídeo. L|'rotate' rotar video L|'slice' corta una parte del video en un archivo de video separado.
kr: R|ffmpeg ffmpeg에서 수행할 작업을 선택합니다. L|'extraction': 비디오를 이미지로 바꿉니다. L|'gen-vid': 이미지를 비디오로 바꿉니다. L|'get-fps'는 선택한 비디오의 fps를 반환합니다. L|'get-info'는 동영상에 대한 정보를 반환합니다. L|'mux-audio'는 한 비디오에서 다른 비디오로 오디오를 추가합니다. L|'rescale' 크기 조정 비디오. L|'rotate' 비디오 회전. L| 'slice'는 동영상의 일부를 별도의 동영상 파일로 잘라냅니다.
ru: R|Выберите, какое действие вы хотите, чтобы выполнял ffmpeg. L|'extract': превращает видео в изображения L|'gen-vid': превращает изображения в видео. L|'get-fps' возвращает частоту кадров в секунду выбранного видео. L|'get-info': возвращает информацию о видео. L|'mux-audio' добавляет звук из одного видео в другое. L|'rescale' изменить размер видео. L|'rotate' вращение видео. L|'slice' вырезает часть видео в отдельный видеофайл.

source: Input file.
es: Archivo de entrada.
kr: 입력 파일.
ru: Входной файл.

source: data
es: datos
kr: 데이터
ru: данные

source: Output file. If no output is specified then: if the output is meant to be a video then a video called 'out.mkv' will be created in the input directory; if the output is meant to be a directory then a directory called 'out' will be created inside the input directory. Note: the chosen output file extension will determine the file encoding.
es: R|Archivo de salida. Si se deja en blanco, entonces: L|si la salida es un vídeo, se creará un vídeo llamado 'out.mkv' en el directorio de entrada; L|si la salida es un directorio, se creará un directorio llamado 'out' dentro del directorio de entrada. Nota: la extensión del archivo de salida elegida determinará la codificación del archivo.
kr: 출력 파일. 출력이 지정되지 않은 경우: 출력이 비디오여야 한다면 입력 디렉토리에 'out.mkv'라는 비디오가 생성됩니다. 출력이 디렉토리여야 한다면 입력 디렉토리 내에 'out'이라는 디렉터리가 생성됩니다. 참고: 선택한 출력 파일 확장자가 파일 인코딩을 결정합니다.
ru: Выходной файл. Если выходной файл не указан, то: если выходным файлом является видео, то в каталоге ввода будет создан видеофайл с именем 'out.mkv'; если выходным файлом является каталог, то внутри каталога ввода будет создан каталог с именем 'out'. Примечание: выбранное расширение выходного файла определяет кодировку файла.

source: Path to reference video if 'input' was not a video.
es: Ruta de acceso al vídeo de referencia si se dio una carpeta con fotogramas en vez de un vídeo.
kr: 만약 input이 비디오가 아닐 경우 참고 비디으의 경로.
ru: Путь к опорному видео, если 'input' не является видео.

source: output
es: salida
kr: 출력
ru: выход

source: Provide video fps. Can be an integer, float or fraction. Negative values will will make the program try to get the fps from the input or reference videos.
es: Introducir los fps del vídeo. Puede ser un número entero, flotante o una fracción. Los valores negativos harán que el programa intente obtener los fps de los vídeos de entrada o de referencia.
kr: 비디오 fps를 제공합니다. 정수, 부동 또는 분수가 될 수 있습니다. 음수 값을 지정하면 프로그램이 입력 또는 참조 비디오에서 fps를 가져오려고 합니다.
ru: Предоставляет количество кадров в секунду. Может быть целым числом, плавающей цифрой или дробью. Отрицательные значения заставят программу попытаться получить fps из входного или опорного видео.

source: Image format that extracted images should be saved as. '.bmp' will offer the fastest extraction speed, but will take the most storage space. '.png' will be slower but will take less storage.
es: Formato de imagen en el que se deben guardar las imágenes extraídas. '.bmp' ofrecerá la mayor velocidad de extracción, pero ocupará el mayor espacio de almacenamiento. '.png' será más lento pero ocupará menos espacio de almacenamiento.
kr: 추출된 이미지의 확장자는 '.bmp'로 저장되어야 합니다. '.bmp'는 가장 빠른 추출 속도를 제공하지만 가장 많은 저장 공간을 차지합니다. '.png'은 속도는 더 느리지만 저장 공간은 더 적게 차지합니다.
ru: Формат изображения, в котором должны быть сохранены извлеченные изображения. '.bmp' обеспечивает самую высокую скорость извлечения, но занимает больше всего места в памяти. '.png' будет медленнее, но займет меньше места.

source: clip
es: recorte
kr: 클립
ru: клип

source: Enter the start time from which an action is to be applied. Default: 00:00:00, in HH:MM:SS format. You can also enter the time with or without the colons, e.g. 00:0000 or 026010.
es: Introduzca el momento a partir de la cual se debe aplicar una acción. Por defecto: 00:00:00, en formato HH:MM:SS. También puede introducir la hora con o sin los dos puntos, por ejemplo, 00:0000 o 026010.
kr: 작업을 적용할 시작 시간을 입력합니다. 기본값: 00:00:00, HH:MM:SS 형식입니다. 콜론을 포함하거나 포함하지 않은 시간(예: 00:0000 또는 026010)을 입력할 수도 있습니다.
ru: Введите время начала, с которого будет применяться действие. По умолчанию: 00:00:00, в формате ЧЧ:ММ:СС. Вы также можете ввести время с двоеточием или без него, например, 00:0000 или 026010.

source: Enter the end time to which an action is to be applied. If both an end time and duration are set, then the end time will be used and the duration will be ignored. Default: 00:00:00, in HH:MM:SS.
es: Introduzca el momento hasta el cual se debe aplicar una acción. Por defecto: 00:00:00, en formato HH:MM:SS. También puede introducir la hora con o sin los dos puntos, por ejemplo, 00:0000 o 026010.
kr: 적용된 작업의 종료 시간을 입력합니다. 종료 시간과 기간이 모두 설정된 경우 종료 시간이 사용되고 기간이 무시됩니다. 기본값: 00:00:00, HH:MM:SS.
ru: Введите время окончания, до которого будет применяться действие. Если заданы и время окончания, и продолжительность, то будет использоваться время окончания, а продолжительность будет игнорироваться. По умолчанию: 00:00:00, в формате ЧЧ:ММ:СС.

source: Enter the duration of the chosen action, for example if you enter 00:00:10 for slice, then the first 10 seconds after and including the start time will be cut out into a new video. Default: 00:00:00, in HH:MM:SS format. You can also enter the time with or without the colons, e.g. 00:0000 or 026010.
es: Introduzca la duración de la acción seleccionada. Por defecto: 00:00:00, en formato HH:MM:SS. También puede introducir la hora con o sin los dos puntos, por ejemplo, 00:0000 o 026010.
kr: 선택한 작업의 지속 시간을 입력합니다. 예를 들어 슬라이스에 00:00:10을 입력하면 시작 시간 이후의 첫 10초가 새 비디오로 잘라집니다. 기본값: 00:00:00, HH:MM:SS 형식입니다. 콜론을 포함하거나 포함하지 않은 시간(예: 00:0000 또는 026010)을 입력할 수도 있습니다.
ru: Введите продолжительность выбранного действия, например, если вы введете 00:00:10 для нарезки, то первые 10 секунд после начала и включая время начала будут вырезаны в новое видео. По умолчанию: 00:00:00, в формате ЧЧ:ММ:СС. Вы также можете ввести время с двоеточием или без него, например, 00:0000 или 026010.

source: Mux the audio from the reference video into the input video. This option is only used for the 'gen-vid' action. 'mux-audio' action has this turned on implicitly.
es: Copia el audio del vídeo de referencia al vídeo de entrada. Esta opción sólo se utiliza para la acción 'gen-vid'. La acción 'mux-audio' la tiene activada implícitamente.
kr: 참조 비디오의 오디오를 입력 비디오에 병합합니다. 이 옵션은 'gen-vid' 작업에만 사용됩니다. 'mux-timeout' 작업은 이 작업을 암시적으로 활성화했습니다.
ru: Mux аудио из опорного видео во входное видео. Эта опция используется только для действия 'gen-vid'. Действие 'mux-audio' включает эту опцию неявно.

source: rotate
es: rotación
kr: 회전
ru: поворот

source: Transpose the video. If transpose is set, then degrees will be ignored. For cli you can enter either the number or the long command name, e.g. to use (1, 90Clockwise) -tr 1 or -tr 90Clockwise
es: Rotar el vídeo. Si la rotación está establecida, los grados serán ignorados. En la línea de comandos puede introducir el número o el nombre largo del comando, por ejemplo, para usar (1, 90Clockwise) son válidas las opciones -tr 1 y -tr 90Clockwise
kr: 비디오를 전치합니다. 전치를 설정하면 각도가 무시됩니다. cli의 경우 숫자 또는 긴 명령 이름을 입력할 수 있습니다(예: (1, 90Clockwise) (-tr 1 또는 -tr 90Clockwise)
ru: Транспонировать видео. Если задано транспонирование, то градусы будут игнорироваться. Для командой строки вы можете ввести либо число, либо длинное имя команды, например, для использования (1, 90 по часовой стрелке) -tr 1 или -tr 90 по часовой стрелке

source: Rotate the video clockwise by the given number of degrees.
es: Gira el vídeo en el sentido de las agujas del reloj el número de grados indicado.
kr: 비디오를 주어진 입력 각도에 따라 시계방향으로 회전합니다.
ru: Поверните видео по часовой стрелке на заданное количество градусов.

source: Set the new resolution scale if the chosen action is 'rescale'.
es: Establece la nueva escala de resolución si la acción elegida es "reescalar".
kr: 선택한 작업이 'rescale'이라면 새로운 해상도 크기를 설정합니다.
ru: Установите новый масштаб разрешения, если выбрано действие 'rescale'.

source: settings
es: ajustes
kr: 설정
ru: настройки

source: Reduces output verbosity so that only serious errors are printed. If both quiet and verbose are set, verbose will override quiet.
es: Reduce el detalle de la salida del registro para que sólo se impriman los errores graves. Si se establecen tanto 'quiet' como 'verbose', 'verbose' tendrá preferencia y anulará a 'quiet'.
kr: 출력 상세도를 줄여 심각한 오류만 출력합니다. quiet와 verbose가 모두 설정된 경우 verbose가 quiet를 재정의합니다.
ru: Уменьшает многословность вывода, чтобы выводились только серьезные ошибки. Если заданы и quiet, и verbose, то verbose будет преобладать над quiet.

source: Increases output verbosity. If both quiet and verbose are set, verbose will override quiet.
es: Aumenta el detalle de la información de registro. Si se establecen tanto 'quiet' como 'verbose', 'verbose', 'verbose' tendrá preferencia y anulará a 'quiet'.
kr: 출력 상세도를 높입니다. quiet와 verbose가 모두 설정된 경우 verbose가 quiet를 재정의합니다.
ru: Повышает точность вывода. Если заданы и quiet, и verbose, то verbose будет преобладать над quiet.
