Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.sort.cli.po
Languages: es, kr, ru

source: This command lets you sort images using various methods.
es: Este comando le permite ordenar las imágenes utilizando varios métodos.
kr: 이 명령어는 다양한 메소드를 이용하여 이미지를 정렬해줍니다.
ru: Эта команда позволяет сортировать изображения различными методами.

source: Adjust the '-t' ('--threshold') parameter to control the strength of grouping.
es: Ajuste el parámetro '-t' ('--threshold') para controlar la fuerza de la agrupación.
kr: 그룹화의 강도를 제어하기 위해 '-t' ('--threshold') 인자를 조정하세요.
ru: Настройте параметр '-t' ('--threshold') для контроля силы группировки.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. Each image is allocated to a bin by the percentage of color pixels that appear in the image.
es: Ajuste el parámetro '-b' ('--bins') para controlar el número de contenedores para agrupar. Cada imagen se asigna a un contenedor por el porcentaje de píxeles de color que aparecen en la imagen.
kr: '-b'('--bins') 매개 변수를 조정하여 그룹화할 bins의 수를 제어합니다. 각 이미지는 이미지에 나타나는 색상 픽셀의 백분율에 따라 bin에 할당됩니다.
ru: Настройте параметр '-b' ('--bins') для управления количеством корзинок для группировки. Каждое изображение распределяется по корзинкам в зависимости от процента цветных пикселей, присутствующих в изображении.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. Each image is allocated to a bin by the number of degrees the face is orientated from center.
es: Ajuste el parámetro '-b' ('--bins') para controlar el número de contenedores para agrupar. Cada imagen se asigna a un contenedor por el número de grados que la cara está orientada desde el centro.
kr: '-b'('--bins') 매개 변수를 조정하여 그룹화할 bins의 수를 제어합니다. 각 이미지는 얼굴이 이미지 중심에서 떨어진 각도에 따라 bin에 할당됩니다.
ru: Настройте параметр '-b' ('--bins') для управления количеством корзинок для группировки. Каждое изображение распределяется по корзинам по количеству градусов, на которые лицо ориентировано от центра.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. The minimum and maximum values are taken for the chosen sort metric. The bins are then populated with the results from the group sorting.
es: Ajuste el parámetro '-b' ('--bins') para controlar el número de contenedores para agrupar. Los valores mínimo y máximo se toman para la métrica de clasificación elegida. Luego, los contenedores se llenan con los resultados de la clasificación de grupos.
kr: '-b'('--bins') 매개 변수를 조정하여 그룹화할 bins의 수를 제어합니다. 선택한 정렬 방법에 대해 최소값과 최대값이 사용됩니다. 그런 다음 bins가 그룹 정렬의 결과로 채워집니다.
ru: Настройте параметр '-b' ('--bins') для управления количеством корзинок для группировки. Для выбранной метрики сортировки берутся минимальное и максимальное значения. Затем корзины заполняются результатами групповой сортировки.

source: faces by blurriness.
es: rostros por desenfoque.
kr: 흐릿한 얼굴.
ru: лица по размытости.

source: faces by fft filtered blurriness.
es: caras por borrosidad filtrada fft.
kr: fft 필터링된 흐릿한 얼굴.
ru: лица по размытости с фильтрацией fft.

source: faces by the estimated distance of the alignments from an 'average' face. This can be useful for eliminating misaligned faces. Sorts from most like an average face to least like an average face.
es: caras por la distancia estimada de las alineaciones desde una cara 'promedio'. Esto puede ser útil para eliminar caras desalineadas. Ordena de más parecido a un rostro promedio a menos parecido a un rostro promedio.
kr: '평균' 얼굴에서 alignments의 추정 거리를 기준으로 하는 얼굴. 이는 잘못 정렬된 얼굴을 제거하는 데 유용할 수 있습니다. 가장 평균 얼굴에서 가장 덜 평균 얼굴순으로 정렬합니다.
ru: лица по оценочному расстоянию выравнивания от "среднего" лица. Это может быть полезно для устранения неправильно расположенных лиц. Сортирует от наиболее похожего на среднее лицо к наименее похожему на среднее лицо.

source: faces using VGG Face2 by face similarity. This uses a pairwise clustering algorithm to check the distances between 512 features on every face in your set and order them appropriately.
es: caras usando VGG Face2 por similitud de caras. Esto utiliza un algoritmo de agrupamiento por pares para verificar las distancias entre 512 características en cada cara de su conjunto y ordenarlas apropiadamente.
kr: 얼굴 유사성에 따라 VGG Face2를 사용하는 얼굴. 이 알고리즘은 쌍별 클러스터링 알고리즘을 사용하여 세트의 모든 얼굴에서 512개의 특징 사이의 거리를 확인하고 적절하게 정렬합니다.
ru: лиц с помощью VGG Face2 по сходству лиц. При этом используется алгоритм парной кластеризации для проверки расстояний между 512 признаками на каждом лице в вашем наборе и их упорядочивания соответствующим образом.

source: faces by their landmarks.
es: caras por sus puntos de referencia.
kr: 특징점이 있는 얼굴.
ru: лица по их ориентирам.

source: Like 'face-cnn' but sorts by dissimilarity.
es: Como 'face-cnn' pero ordenada por la similitud.
kr: 'face-cnn'과 비슷하지만 비유사성에 따라 정렬된.
ru: Как 'face-cnn', но сортирует по непохожести.

source: faces by Yaw (rotation left to right).
es: caras por guiñada (rotación de izquierda a derecha).
kr: yaw (왼쪽에서 오른쪽으로 회전)에 의한 얼굴.
ru: лица по Yaw (вращение слева направо).

source: faces by Pitch (rotation up and down).
es: caras por Pitch (rotación arriba y abajo).
kr: pitch (위에서 아래로 회전)에 의한 얼굴.
ru: лица по Pitch (вращение вверх и вниз).

source: faces by Roll (rotation). Aligned faces should have a roll value close to zero. The further the Roll value from zero the higher liklihood the face is misaligned.
es: caras por Roll (rotación). Las caras alineadas deben tener un valor de balanceo cercano a cero. Cuanto más lejos esté el valor de Roll de cero, mayor será la probabilidad de que la cara esté desalineada.
kr: 이동 (회전)에 의한 얼굴. 정렬된 얼굴들은 0에 가까운 이동 값을 가져야 한다. 이동 값이 0에서 멀수록 얼굴들이 잘못 정렬되었을 가능성이 높습니다.
ru: грани по Roll (повороту). Выровненные грани должны иметь значение Roll, близкое к нулю. Чем дальше значение Roll от нуля, тем выше вероятность того, что лицо неправильно выровнено.

source: faces by their color histogram.
es: caras por su histograma de color.
kr: 색상 히스토그램에 의한 얼굴.
ru: лица по их цветовой гистограмме.

source: Like 'hist' but sorts by dissimilarity.
es: Como 'hist' pero ordenada por la disimilitud.
kr: 'hist' 같지만 비유사성에 따라 정렬된.
ru: Как 'hist', но сортирует по непохожести.

source: images by the average intensity of the converted grayscale color channel.
es: imágenes por la intensidad media del canal de color en escala de grises convertido.
kr: 변환된 회색 계열 색상 채널의 평균 강도에 따른 이미지.
ru: изображения по средней интенсивности преобразованного полутонового цветового канала.

source: images by their number of black pixels. Useful when faces are near borders and a large part of the image is black.
es: imágenes por su número de píxeles negros. Útil cuando las caras están cerca de los bordes y una gran parte de la imagen es negra.
kr: 검은색 픽셀의 개수에 따른 이미지들. 얼굴이 테두리 근처에 있고 이미지의 대부분이 검은색일 때 유용합니다.
ru: изображения по количеству черных пикселей. Полезно, когда лица находятся вблизи границ и большая часть изображения черная.

source: images by the average intensity of the converted Y color channel. Bright lighting and oversaturated images will be ranked first.
es: imágenes por la intensidad media del canal de color Y convertido. La iluminación brillante y las imágenes sobresaturadas se clasificarán en primer lugar.
kr: 변환된 Y 색상 채널의 평균 강도를 기준으로 한 이미지. 밝은 조명과 과포화 이미지가 1위를 차지할 것이다.
ru: изображений по средней интенсивности преобразованного цветового канала Y. Яркое освещение и перенасыщенные изображения будут ранжироваться в первую очередь.

source: images by the average intensity of the converted Cg color channel. Green images will be ranked first and red images will be last.
es: imágenes por la intensidad media del canal de color Cg convertido. Las imágenes verdes se clasificarán primero y las imágenes rojas serán las últimas.
kr: 변환된 Cg 컬러 채널의 평균 강도를 기준으로 한 이미지. 녹색 이미지가 먼저 순위가 매겨지고 빨간색 이미지가 마지막 순위가 됩니다.
ru: изображений по средней интенсивности преобразованного цветового канала Cg. Зеленые изображения занимают первое место, а красные - последнее.

source: images by the average intensity of the converted Co color channel. Orange images will be ranked first and blue images will be last.
es: imágenes por la intensidad media del canal de color Co convertido. Las imágenes naranjas se clasificarán en primer lugar y las imágenes azules en último lugar.
kr: 변환된 Co 색상 채널의 평균 강도를 기준으로 한 이미지. 주황색 이미지가 먼저 순위가 매겨지고 파란색 이미지가 마지막 순위가 됩니다.
ru: изображений по средней интенсивности преобразованного цветового канала Co. Оранжевые изображения занимают первое место, а синие - последнее.

source: images by their size in the original frame. Faces further from the camera and from lower resolution sources will be sorted first, whilst faces closer to the camera and from higher resolution sources will be sorted last.
es: imágenes por su tamaño en el marco original. Las caras más alejadas de la cámara y de fuentes de menor resolución se ordenarán primero, mientras que las caras más cercanas a la cámara y de fuentes de mayor resolución se ordenarán en último lugar.
kr: 이미지를 원래 프레임의 크기별로 표시합니다. 카메라에서 더 멀리 떨어져 있고 저해상도 원본에서 온 얼굴이 먼저 정렬되고, 카메라에 더 가까이 있고 고해상도 원본에서 온 얼굴이 마지막으로 정렬됩니다.
ru: изображения по их размеру в исходном кадре. Лица, расположенные дальше от камеры и полученные из источников с низким разрешением, будут отсортированы первыми, а лица, расположенные ближе к камере и полученные из источников с высоким разрешением, будут отсортированы последними.

source: Sort faces using a number of different techniques
es: Clasificar los rostros mediante diferentes técnicas
kr: 얼굴을 정렬하는데 사용되는 서로 다른 기술들의 개수
ru: Сортировка лиц с использованием различных методов

source: data
es: datos
kr: 데이터
ru: данные

source: Input directory of aligned faces.
es: Directorio de entrada de caras alineadas.
kr: 정렬된 얼굴들의 입력 디렉토리.
ru: Входная папка соотнесенных лиц.

source: Output directory for sorted aligned faces. If not provided and 'keep' is selected then a new folder called 'sorted' will be created within the input folder to house the output. If not provided and 'keep' is not selected then the images will be sorted in-place, overwriting the original contents of the 'input_dir'
es: Directorio de salida para caras alineadas ordenadas. Si no se proporciona y se selecciona 'keep', se creará una nueva carpeta llamada 'sorted' dentro de la carpeta de entrada para albergar la salida. Si no se proporciona y no se selecciona 'keep', las imágenes se ordenarán en el lugar, sobrescribiendo el contenido original de 'input_dir'
kr: 정렬된 aligned 얼굴의 출력 디렉토리입니다. 제공되지 않은 상태에서 'keep'을 선택하면 출력을 저장하기 위해 입력 폴더 내에 'sorted'라는 새 폴더가 생성됩니다. 제공되지 않고 'keep'을 선택하지 않으면 이미지가 제자리에 정렬되어 'input_dir'의 원래 내용을 덮어씁니다.
ru: Выходная папка для отсортированных выровненных лиц. Если не указано и выбрано 'keep', то в папке input будет создана новая папка под названием 'sorted' для размещения выходных данных. Если не указано и не выбрано 'keep', то изображения будут отсортированы на месте, перезаписывая исходное содержимое 'input_dir'.

source: R|If selected then the input_dir should be a parent folder containing multiple folders of faces you wish to sort. The faces will be output to separate sub-folders in the output_dir
es: R|Si se selecciona, input_dir debe ser una carpeta principal que contenga varias carpetas de caras que desea ordenar. Las caras se enviarán a subcarpetas separadas en output_dir
kr: R|선택되면 input_dir는 정렬할 여러 개의 얼굴 폴더를 포함하는 상위 폴더여야 합니다. 얼굴은 output_dir의 별도 하위 폴더로 출력됩니다
ru: R|Если выбрано, то input_dir должен быть родительской папкой, содержащей несколько папок с лицами, которые вы хотите отсортировать. Лица будут выведены в отдельные вложенные папки в output_dir

source: sort settings
es: ajustes de ordenación
kr: 정렬 설정
ru: настройки сортировки

source: R|Choose how images are sorted. Selecting a sort method gives the images a new filename based on the order the image appears within the given method. L|'none': Don't sort the images. When a 'group-by' method is selected, selecting 'none' means that the files will be moved/copied into their respective bins, but the files will keep their original filenames. Selecting 'none' for both 'sort-by' and 'group-by' will do nothing
es: R|Elige cómo se ordenan las imágenes. Al seleccionar un método de clasificación, las imágenes reciben un nuevo nombre de archivo basado en el orden en que aparece la imagen dentro del método dado. L|'none': No ordenar las imágenes. Cuando se selecciona un método de 'agrupar por', seleccionar 'none' significa que los archivos se moverán/copiarán en sus contenedores respectivos, pero los archivos mantendrán sus nombres de archivo originales. Seleccionar 'none' para 'sort-by' y 'group-by' no hará nada
kr: R|이미지 정렬 방법을 선택합니다. 정렬 방법을 선택하면 이미지가 주어진 방법 내에 나타나는 순서에 따라 이미지에 새 파일 이름이 지정됩니다. L|'none': 이미지를 정렬하지 않습니다. 'group-by' 메서드를 선택한 경우 'none'을 선택하면 파일이 각 bin으로 이동/복사되지만 파일은 원래 파일 이름을 유지합니다. 'sort-by' 및 'group-by' 모두에 대해 'none'을 선택해도 아무 효과가 없습니다
ru: R|Выбор способа сортировки изображений. При выборе метода сортировки изображениям присваивается новое имя файла, основанное на порядке появления изображения в данном методе. L|'none': Не сортировать изображения. Если выбран метод 'group-by', выбор 'none' означает, что файлы будут перемещены/скопированы в соответствующие корзины, но файлы сохранят свои оригинальные имена. Выбор значения 'none' как для 'sort-by', так и для 'group-by' ничего не даст

source: group settings
es: ajustes de grupo
kr: 그룹 설정
ru: настройки группировки

source: Whether to keep the original files in their original location. Choosing a 'sort-by' method means that the files have to be renamed. Selecting 'keep' means that the original files will be kept, and the renamed files will be created in the specified output folder. Unselecting keep means that the original files will be moved and renamed based on the selected sort/group criteria.
es: Ya sea para mantener los archivos originales en su ubicación original. Elegir un método de 'sort-by' significa que los archivos tienen que ser renombrados. Seleccionar 'keep' significa que los archivos originales se mantendrán y los archivos renombrados se crearán en la carpeta de salida especificada. Deseleccionar 'keep' significa que los archivos originales se moverán y cambiarán de nombre en función de los criterios de clasificación/grupo seleccionados.
kr: 원본 파일을 원래 위치에 유지할지 여부입니다. '정렬 기준' 방법을 선택하면 파일 이름을 변경해야 합니다. 'keep'을 선택하면 원래 파일이 유지되고 이름이 변경된 파일이 지정된 출력 폴더에 생성됩니다. keep을 선택취소하면 선택한 정렬/그룹 기준에 따라 원래 파일이 이동되고 이름이 변경됩니다.
ru: Сохранять ли исходные файлы в их первоначальном расположении. Выбор метода "сортировать по" означает, что файлы должны быть переименованы. Выбор 'keep' означает, что исходные файлы будут сохранены, а переименованные файлы будут созданы в указанной выходной папке. Отмена выбора "keep" означает, что исходные файлы будут перемещены и переименованы в соответствии с выбранными критериями сортировки/группировки.

source: R|Float value. Minimum threshold to use for grouping comparison with 'face-cnn' 'hist' and 'face' methods. The lower the value the more discriminating the grouping is. Leaving -1.0 will allow Faceswap to choose the default value. L|For 'face-cnn' 7.2 should be enough, with 4 being very discriminating. L|For 'hist' 0.3 should be enough, with 0.2 being very discriminating. L|For 'face' between 0.1 (more bins) to 0.5 (fewer bins) should be about right. Be careful setting a value that's too extrene in a directory with many images, as this could result in a lot of folders being created. Defaults: face-cnn 7.2, hist 0.3, face 0.25
es: R|Valor flotante. Umbral mínimo a usar para agrupar la comparación con los métodos 'face-cnn' 'hist' y 'face'. Cuanto más bajo es el valor, más discriminatoria es la agrupación. Dejar -1.0 permitirá que Faceswap elija el valor predeterminado. L|Para 'face-cnn' 7.2 debería ser suficiente, siendo 4 muy discriminatorio. L|Para 'hist' 0.3 debería ser suficiente, siendo 0.2 muy discriminatorio. L|Para 'face', entre 0,1 (más contenedores) y 0,4 (pocos contenedores) debería ser correcto. Tenga cuidado al establecer un valor que sea demasiado extremo en un directorio con muchas imágenes, ya que esto podría resultar en la creación de muchas carpetas. Valores predeterminados: face-cnn 7.2, hist 0.3, face 0.25
kr: R|float 값. 'face-cnn', 'hist' 및 'face' 메서드와의 그룹 비교에 사용할 최소 임계값입니다. 값이 낮을수록 그룹을 더 잘 구별할 수 있습니다. -1.0을 그대로 두면 Faceswap에서 기본값을 선택할 수 있습니다. L|'face-cnn'의 경우 7.2이면 충분하며, 4는 매우 많이 구별된다. L|'hist'의 경우 0.3이면 충분하며, 0.2는 매우 많이 구별된다. L|0.1(더 많은 빈)에서 0.5(더 적은 빈) 사이의 '얼굴'의 경우는 거의 오른쪽이어야 합니다. 이미지가 많은 디렉터리에서 너무 극단적인 값을 설정하면 폴더가 많이 생성될 수 있으므로 주의하십시오. 기본값: face-cnn 7.2, hist 0.3, face 0.25
ru: R|Плавающее значение. Минимальный порог, используемый для сравнения группировок с методами 'face-cnn' 'hist' и 'face'. Чем меньше значение, тем более дискриминационной является группировка. Если оставить значение -1.0, Faceswap сможет выбрать значение по умолчанию. L|Для 'face-cnn' 7,2 должно быть достаточно, при этом 4 будет очень дискриминационным. L|Для 'hist' 0.3 должно быть достаточно, при этом 0.2 очень хорошо различает. L|For 'face' от 0,1 (больше бинов) до 0,5 (меньше бинов) должно быть достаточно. Будьте осторожны, устанавливая слишком большое значение в каталоге с большим количеством изображений, так как это может привести к созданию большого количества папок. По умолчанию: face-cnn 7.2, hist 0.3, face 0.25

source: settings
es: ajustes
kr: 설정
ru: настройки

source: Logs file renaming changes if grouping by renaming, or it logs the file copying/movement if grouping by folders. If no log file is specified with '--log-file', then a 'sort_log.json' file will be created in the input directory.
es: Registra los cambios en el nombre de los archivos si se agrupa por nombre, o registra la copia o movimiento de archivos si se agrupa por carpetas. Si no se especifica ningún archivo de registro con '--log-file', se creará un archivo 'sort_log.json' en el directorio de entrada.
kr: 만약 renaming별로 그룹화하면 로그 파일에서 renaming이 변경됩니다. 또는 폴더별로 그룹화하는 경우 파일 복사/이동을 기록합니다. '--log-file'로 로그 파일을 지정하지 않으면 'sort_log.json' 파일이 입력 디렉토리에 생성됩니다.
ru: Ведет журнал изменений переименования файлов при группировке по переименованию, или журнал копирования/перемещения файлов при группировке по папкам. Если файл журнала не указан с помощью '--log-file', то в каталоге ввода будет создан файл 'sort_log.json'.

source: Specify a log file to use for saving the renaming or grouping information. If specified extension isn't 'json' or 'yaml', then json will be used as the serializer, with the supplied filename. Default: sort_log.json
es: Especifica un archivo de registro que se utilizará para guardar la información de renombrado o agrupación. Si la extensión especificada no es 'json' o 'yaml', se utilizará json como serializador, con el nombre de archivo suministrado. Por defecto: sort_log.json
kr: _renaming 또는 grouping 정보를 저장하는 데 사용할 로그 파일을 지정합니다. 지정된 확장자가 'json' 또는 'yaml'이 아니면 json이 제공된 파일 이름과 함께 직렬화기로 사용됩니다. 기본값: sort_log.json
ru: Укажите файл журнала, который будет использоваться для сохранения информации о переименовании или группировке. Если указанное расширение не 'json' или 'yaml', то в качестве сериализатора будет использоваться json, с указанным именем файла. По умолчанию: sort_log.json
