Repository: deepfakes/faceswap
Catalog: locales/*/LC_MESSAGES/tools.mask.cli.po
Languages: es, kr, ru

source: This tool allows you to generate, import, export or preview masks for existing alignments.
es: Esta herramienta le permite generar, importar, exportar o obtener una vista previa de máscaras para alineaciones existentes. Genere, importe, exporte o obtenga una vista previa de máscaras para archivos de alineaciones existentes.
kr: 이 도구를 사용하면 기존 정렬에 대한 마스크를 생성, 가져오기, 내보내기 또는 미리 볼 수 있습니다.
ru: Этот инструмент позволяет создавать, импортировать, экспортировать или просматривать маски для существующих трасс.

source: Mask tool Generate, import, export or preview masks for existing alignments files.
es: Herramienta de máscara Genere, importe, exporte o obtenga una vista previa de máscaras para archivos de alineaciones existentes.
kr: 마스크 도구 기존 alignments 파일에 대한 마스크를 생성, 가져오기, 내보내기 또는 미리 봅니다.
ru: Инструмент "Маска" Создавайте, импортируйте, экспортируйте или просматривайте маски для существующих файлов трасс.

source: data
es: datos
kr: 데이터
ru: данные

source: Full path to the alignments file that contains the masks if not at the default location. NB: If the input-type is faces and you wish to update the corresponding alignments file, then you must provide a value here as the location cannot be automatically detected.
es: Ruta completa al archivo de alineaciones para agregar la máscara si no está en la ubicación predeterminada. NB: si el tipo de entrada es caras y desea actualizar el archivo de alineaciones correspondiente, debe proporcionar un valor aquí ya que la ubicación no se puede detectar automáticamente.
kr: 기본 위치가 아닌 경우 마스크를 추가할 정렬 파일의 전체 경로입니다. NB: 입력 유형이 얼굴이고 해당 정렬 파일을 업데이트하려는 경우 위치를 자동으로 감지할 수 없으므로 여기에 값을 제공해야 합니다.
ru: Полный путь к файлу выравниваний для добавления маски, если он не находится в месте по умолчанию. Примечание: Если input-type - лица, и вы хотите обновить соответствующий файл выравнивания, то вы должны указать значение здесь, так как местоположение не может быть определено автоматически.

source: Directory containing extracted faces, source frames, or a video file.
es: Directorio que contiene las caras extraídas, los fotogramas de origen o un archivo de vídeo.
kr: 추출된 얼굴들, 원본 프레임들, 또는 비디오 파일이 존재하는 디렉토리.
ru: Папка, содержащая извлеченные лица, исходные кадры или видеофайл.

source: R|Whether the `input` is a folder of faces or a folder frames/video L|faces: The input is a folder containing extracted faces. L|frames: The input is a folder containing frames or is a video
es: R|Si la entrada es una carpeta de caras o una carpeta frames o vídeo L|faces: La entrada es una carpeta que contiene caras extraídas. L|frames: La entrada es una carpeta que contiene fotogramas o es un vídeo
kr: R|'입력'이 얼굴의 폴더인지 아니면 폴더 프레임/비디오인지 L|faces: 입력은 추출된 얼굴을 포함된 폴더입니다. L|frames: 입력이 프레임을 포함된 폴더이거나 비디오입니다
ru: R|Выбирается ли "вход" как папка лиц или как папка кадров/видео L|faces: Входом является папка, содержащая извлеченные лица. L|frames: Входом является папка с кадрами или видео

source: R|Run the mask tool on multiple sources. If selected then the other options should be set as follows: L|input: A parent folder containing either all of the video files to be processed, or containing sub-folders of frames/faces. L|output-folder: If provided, then sub-folders will be created within the given location to hold the previews for each input. L|alignments: Alignments field will be ignored for batch processing. The alignments files must exist at the default location (for frames). For batch processing of masks with 'faces' as the input type, then only the PNG header within the extracted faces will be updated.
es: R|Ejecute la herramienta de máscara en varias fuentes. Si se selecciona, las otras opciones deben configurarse de la siguiente manera: L|input: una carpeta principal que contiene todos los archivos de video que se procesarán o que contiene subcarpetas de marcos/caras. L|output-folder: si se proporciona, se crearán subcarpetas dentro de la ubicación dada para contener las vistas previas de cada entrada. L|alignments: el campo de alineaciones se ignorará para el procesamiento por lotes. Los archivos de alineaciones deben existir en la ubicación predeterminada (para marcos). Para el procesamiento por lotes de máscaras con 'caras' como tipo de entrada, solo se actualizará el encabezado PNG dentro de las caras extraídas.
kr: R|여러 소스에서 마스크 도구를 실행합니다. 선택한 경우 다른 옵션을 다음과 같이 설정해야 합니다. L|input: 처리할 모든 비디오 파일을 포함하거나 프레임/얼굴의 하위 폴더를 포함하는 상위 폴더입니다. L|output-folder: 제공된 경우 각 입력에 대한 미리 보기를 보관하기 위해 지정된 위치 내에 하위 폴더가 생성됩니다. L|alignments: 일괄 처리에서는 정렬 필드가 무시됩니다. 정렬 파일은 기본 위치(프레임용)에 있어야 합니다. 입력 유형이 '얼굴'인 마스크를 일괄 처리하는 경우 추출된 얼굴 내의 PNG 헤더만 업데이트됩니다.
ru: R|Запустить инструмент маски на нескольких источниках. Если выбрано, то остальные параметры должны быть установлены следующим образом: L|input: Родительская папка, содержащая либо все видеофайлы для обработки, либо содержащая вложенные папки кадров/лиц. L|output-folder: Если указано, то в заданном месте будут созданы вложенные папки для хранения превью для каждого входа. L|alignments: Поле выравнивания будет игнорироваться при пакетной обработке. Файлы выравнивания должны существовать в месте по умолчанию (для кадров). При пакетной обработке масок с типом входа "лица" будут обновлены только заголовки PNG в извлеченных лицах.

source: process
es: proceso
kr: 진행
ru: обработка

source: R|Masker to use. L|bisenet-fp: Relatively lightweight NN based mask that provides more refined control over the area to be masked including full head masking (configurable in mask settings). L|components: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks to create a mask. L|custom: A dummy mask that fills the mask area with all 1s or 0s (configurable in settings). This is only required if you intend to manually edit the custom masks yourself in the manual tool. This mask does not use the GPU. L|extended: Mask designed to provide facial segmentation based on the positioning of landmark locations. A convex hull is constructed around the exterior of the landmarks and the mask is extended upwards onto the forehead. L|vgg-clear: Mask designed to provide smart segmentation of mostly frontal faces clear of obstructions. Profile faces and obstructions may result in sub-par performance. L|vgg-obstructed: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been specifically trained to recognize some facial obstructions (hands and eyeglasses). Profile faces may result in sub-par performance. L|unet-dfl: Mask designed to provide smart segmentation of mostly frontal faces. The mask model has been trained by community members. Profile faces may result in sub-par performance.
es: R|Máscara a utilizar. L|bisenet-fp: Máscara relativamente ligera basada en NN que proporciona un control más refinado sobre el área a enmascarar, incluido el enmascaramiento completo de la cabeza (configurable en la configuración de la máscara). L|components: Máscara diseñada para proporcionar una segmentación facial basada en la posición de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia para crear una máscara. L|custom: Una máscara ficticia que llena el área de la máscara con 1 o 0 (configurable en la configuración). Esto solo es necesario si tiene la intención de editar manualmente las máscaras personalizadas usted mismo en la herramienta manual. Esta máscara no utiliza la GPU. L|extended: Máscara diseñada para proporcionar una segmentación facial basada en el posicionamiento de las ubicaciones de los puntos de referencia. Se construye un casco convexo alrededor del exterior de los puntos de referencia y la máscara se extiende hacia arriba en la frente. L|vgg-clear: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales y libres de obstrucciones. Los rostros de perfil y las obstrucciones pueden dar lugar a un rendimiento inferior. L|vgg-obstructed: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de máscara ha sido entrenado específicamente para reconocer algunas obstrucciones faciales (manos y gafas). Los rostros de perfil pueden dar lugar a un rendimiento inferior. L|unet-dfl: Máscara diseñada para proporcionar una segmentación inteligente de rostros principalmente frontales. El modelo de máscara ha sido entrenado por los miembros de la comunidad y necesitará ser probado para una mayor descripción. Los rostros de perfil pueden dar lugar a un rendimiento inferior.
kr: R|사용할 마스크. L|bisnet-fp: 전체 얼굴 마스킹(마스크 설정에서 구성 가능)을 포함하여 마스킹할 영역에 대한 보다 정교한 제어를 제공하는 비교적 가벼운 NN 기반 마스크입니다. L|components: 특징점 위치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 특징점의 외부에는 마스크를 만들기 위해 convex hull이가 형성되어 있습니다. L|custom: 마스크 영역을 모든 1 또는 0으로 채우는 더미 마스크입니다(설정에서 구성 가능). 수동 도구에서 사용자 정의 마스크를 직접 수동으로 편집하려는 경우에만 필요합니다. 이 마스크는 GPU를 사용하지 않습니다. L|extended: 특징점 위치를 기반으로 얼굴 분할을 제공하도록 설계된 마스크입니다. 지형지물의 외부에는 convex hull이 형성되어 있으며, 마스크는 이마 위로 뻗어 있습니다. L|vgg-clear: 대부분의 정면에 장애물이 없는 스마트한 분할을 제공하도록 설계된 마스크입니다. 프로필 면 및 장애물로 인해 성능이 저하될 수 있습니다. L|vgg-obstructed: 대부분의 정면 얼굴을 스마트하게 분할할 수 있도록 설계된 마스크입니다. 마스크 모델은 일부 안면 장애물(손과 안경)을 인식하도록 특별히 훈련되었습니다. 옆 얼굴은 평균 이하의 성능을 초래할 수 있습니다. L|unet-dfl: 대부분 정면 얼굴을 스마트하게 분할하도록 설계된 마스크. 마스크 모델은 커뮤니티 구성원들에 의해 훈련되었으며 추가 설명을 위해 테스트가 필요합니다. 옆 얼굴은 평균 이하의 성능을 초래할 수 있습니다.
ru: R|Маскер для использования. L|bisenet-fp: Относительно легкая маска на основе NN, которая обеспечивает более точный контроль над маскируемой областью, включая полное маскирование головы (настраивается в настройках маски). L|components: Маска, разработанная для сегментации лица на основе расположения ориентиров. Для создания маски вокруг внешних ориентиров строится выпуклая оболочка. L|custom (пользовательская): Фиктивная маска, которая заполняет область маски всеми 1 или 0 (настраивается в настройках). Она необходима только в том случае, если вы собираетесь вручную редактировать пользовательские маски в ручном инструменте. Эта маска не использует GPU. L|extended: Маска предназначена для сегментации лица на основе расположения ориентиров. Выпуклая оболочка строится вокруг внешних ориентиров, и маска расширяется вверх на лоб. L|vgg-clear: Маска предназначена для интеллектуальной сегментации преимущественно фронтальных лиц без препятствий. Профильные лица и препятствия могут привести к снижению производительности. L|vgg-obstructed: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была специально обучена распознавать некоторые препятствия на лице (руки и очки). Лица в профиль могут иметь низкую производительность. L|unet-dfl: Маска, разработанная для интеллектуальной сегментации преимущественно фронтальных лиц. Модель маски была обучена членами сообщества и для дальнейшего описания нуждается в тестировании. Профильные лица могут иметь низкую производительность.

source: R|The Mask tool process to perform. L|all: Update the mask for all faces in the alignments file for the selected 'masker'. L|missing: Create a mask for all faces in the alignments file where a mask does not previously exist for the selected 'masker'. L|output: Don't update the masks, just output the selected 'masker' for review/editing in external tools to the given output folder. L|import: Import masks that have been edited outside of faceswap into the alignments file. Note: 'custom' must be the selected 'masker' and the masks must be in the same format as the 'input-type' (frames or faces)
es: R|Процесс инструмента «Маска», который необходимо выполнить. L|all: обновить маску для всех лиц в файле выравниваний для выбранного «masker». L|missing: создать маску для всех граней в файле выравниваний, где маска ранее не существовала для выбранного «masker». L|output: не обновляйте маски, просто выведите выбранный «masker» для просмотра/редактирования во внешних инструментах в данную выходную папку. L|import: импортируйте маски, которые были отредактированы вне Facewap, в файл выравниваний. Примечание. «custom» должен быть выбранным «masker», а маски должны быть в том же формате, что и «input-type» (frames или faces).
kr: R|수행할 마스크 도구 프로세스입니다. L|all: 선택한 'masker'에 대한 정렬 파일의 모든 면에 대한 마스크를 업데이트합니다. L|missing: 선택한 'masker'에 대해 이전에 마스크가 존재하지 않았던 정렬 파일의 모든 면에 대한 마스크를 생성합니다. L|output: 마스크를 업데이트하지 않고 외부 도구에서 검토/편집하기 위해 선택한 'masker'를 지정된 출력 폴더로 출력합니다. L|import: Faceswap 외부에서 편집된 마스크를 정렬 파일로 가져옵니다. 참고: 'custom'은 선택된 'masker'여야 하며 마스크는 'input-type'(frames 또는 faces)과 동일한 형식이어야 합니다.
ru: R|El proceso de la herramienta Máscara a realizar. L|all: actualiza la máscara de todas las caras en el archivo de alineaciones para el 'masker' seleccionado. L|missing: crea una máscara para todas las caras en el archivo de alineaciones donde no existe previamente una máscara para el 'masker' seleccionado. L|output: no actualice las máscaras, simplemente envíe el 'masker' seleccionado para su revisión/edición en herramientas externas a la carpeta de salida proporcionada. L|import: importa máscaras que se han editado fuera de faceswap al archivo de alineaciones. Nota: 'custom' debe ser el 'masker' seleccionado y las máscaras deben tener el mismo formato que el 'input-type' (frames o faces)

source: import
es: importar
kr: 수입
ru: Импортировать

source: R|Import only. The path to the folder that contains masks to be imported. L|How the masks are provided is not important, but they will be stored, internally, as 8-bit grayscale images. L|If the input are images, then the masks must be named exactly the same as input frames/faces (excluding the file extension). L|If the input is a video file, then the filename of the masks is not important but should contain the frame number at the end of the filename (but before the file extension). The frame number can be separated from the rest of the filename by any non-numeric character and can be padded by any number of zeros. The frame number must correspond correctly to the frame number in the original video (starting from frame 1).
es: R|Sólo importar. La ruta a la carpeta que contiene las máscaras que se importarán. L|Cómo se proporcionan las máscaras no es importante, pero se almacenarán internamente como imágenes en escala de grises de 8 bits. L|Si la entrada son imágenes, entonces las máscaras deben tener el mismo nombre que los cuadros/caras de entrada (excluyendo la extensión del archivo). L|Si la entrada es un archivo de vídeo, entonces el nombre del archivo de las máscaras no es importante pero debe contener el número de fotograma al final del nombre del archivo (pero antes de la extensión del archivo). El número de fotograma se puede separar del resto del nombre del archivo mediante cualquier carácter no numérico y se puede rellenar con cualquier número de ceros. El número de fotograma debe corresponder correctamente al número de fotograma del vídeo original (a partir del fotograma 1).
kr: R|가져오기만 가능합니다. 가져올 마스크가 포함된 폴더의 경로입니다. L|마스크 제공 방법은 중요하지 않지만 내부적으로 8비트 회색조 이미지로 저장됩니다. L|입력이 이미지인 경우 마스크 이름은 입력 프레임/얼굴과 정확히 동일하게 지정되어야 합니다(파일 확장자 제외). L|입력이 비디오 파일인 경우 마스크의 파일 이름은 중요하지 않지만 파일 이름 끝에(파일 확장자 앞에) 프레임 번호가 포함되어야 합니다. 프레임 번호는 숫자가 아닌 문자로 파일 이름의 나머지 부분과 구분될 수 있으며 임의 개수의 0으로 채워질 수 있습니다. 프레임 번호는 원본 비디오의 프레임 번호(프레임 1부터 시작)와 정확하게 일치해야 합니다.
ru: R|Только импорт. Путь к папке, содержащей маски для импорта. L|Как предоставляются маски, не важно, но они будут храниться внутри как 8-битные изображения в оттенках серого. L|Если входными данными являются изображения, то имена масок должны быть точно такими же, как у входных кадров/лиц (за исключением расширения файла). L|Если входной файл представляет собой видеофайл, то имя файла масок не важно, но должно содержать номер кадра в конце имени файла (но перед расширением файла). Номер кадра может быть отделен от остальной части имени файла любым нечисловым символом и дополнен любым количеством нулей. Номер кадра должен правильно соответствовать номеру кадра в исходном видео (начиная с кадра 1).

source: R|Import/Output only. When importing masks, this is the centering to use. For output this is only used for outputting custom imported masks, and should correspond to the centering used when importing the mask. Note: For any job other than 'import' and 'output' this option is ignored as mask centering is handled internally. L|face: Centers the mask on the center of the face, adjusting for pitch and yaw. Outside of requirements for full head masking/training, this is likely to be the best choice. L|head: Centers the mask on the center of the head, adjusting for pitch and yaw. Note: You should only select head centering if you intend to include the full head (including hair) within the mask and are looking to train a full head model. L|legacy: The 'original' extraction technique. Centers the mask near the of the nose with and crops closely to the face. Can result in the edges of the mask appearing outside of the training area.
es: R|Solo importación/salida. Al importar máscaras, este es el centrado que se debe utilizar. Para la salida, esto solo se utiliza para generar máscaras importadas personalizadas y debe corresponder al centrado utilizado al importar la máscara. Nota: Para cualquier trabajo que no sea "importación" y "salida", esta opción se ignora ya que el centrado de la máscara se maneja internamente. L|cara: centra la máscara en el centro de la cara, ajustando el tono y la orientación. Aparte de los requisitos para el entrenamiento/enmascaramiento de cabeza completa, esta probablemente sea la mejor opción. L|head: centra la máscara en el centro de la cabeza, ajustando el cabeceo y la guiñada. Nota: Sólo debe seleccionar el centrado de la cabeza si desea incluir la cabeza completa (incluido el cabello) dentro de la máscara y desea entrenar un modelo de cabeza completa. L|legacy: La técnica de extracción 'original'. Centra la máscara cerca de la nariz y la recorta cerca de la cara. Puede provocar que los bordes de la máscara aparezcan fuera del área de entrenamiento.
kr: R|Import/Output only. 마스크를 가져올 때, 이것은 사용할 중앙 정렬입니다. 출력의 경우, 이것은 사용자 지정 가져온 마스크를 출력하는 데만 사용되며, 마스크를 가져올 때 사용된 중앙 정렬과 일치해야 합니다. 참고: 'import' 및 'output' 이외의 모든 작업의 ​​경우 마스크 중앙 정렬이 내부적으로 처리되므로 이 옵션은 무시됩니다. L|면: 피치와 요를 조정하여 마스크를 얼굴 중앙에 배치합니다. 머리 전체 마스킹/훈련에 대한 요구 사항을 제외하면 이것이 최선의 선택일 가능성이 높습니다. L|head: 마스크를 머리 중앙에 배치하여 피치와 요를 조정합니다. 참고: 마스크 내에 머리 전체(머리카락 포함)를 포함하고 머리 전체 모델을 훈련시키려는 경우 머리 중심 맞추기만 선택해야 합니다. L|레거시: '원래' 추출 기술입니다. 마스크를 코 근처 중앙에 배치하고 얼굴에 가깝게 자릅니다. 마스크 가장자리가 훈련 영역 외부에 나타날 수 있습니다.
ru: R|Только импорт/вывод. При импорте масок это центрирование для использования. Для вывода это используется только для вывода пользовательских импортированных масок и должно соответствовать центрированию, используемому при импорте маски. Примечание: для любого задания, кроме «импорта» и «вывода», эта опция игнорируется, поскольку центрирование маски обрабатывается внутренне. L|face: центрирует маску по центру лица с регулировкой угла наклона и отклонения от курса. Помимо требований к полной маскировке/тренировке головы, это, вероятно, будет лучшим выбором. L|head: центрирует маску по центру головы с регулировкой угла наклона и отклонения от курса. Примечание. Выбирать центрирование головы следует только в том случае, если вы собираетесь включить в маску всю голову (включая волосы) и хотите обучить модель полной головы. L|legacy: «Оригинальная» техника извлечения. Центрирует маску возле носа и приближает ее к лицу. Это может привести к тому, что края маски окажутся за пределами тренировочной зоны.

source: Import only. The size, in pixels to internally store the mask at. The default is 128 which is fine for nearly all usecases. Larger sizes will result in larger alignments files and longer processing.
es: Sólo importar. El tamaño, en píxeles, para almacenar internamente la máscara. El valor predeterminado es 128, que está bien para casi todos los casos de uso. Los tamaños más grandes darán como resultado archivos de alineaciones más grandes y un procesamiento más largo.
kr: 가져오기만. 마스크를 내부적으로 저장할 크기(픽셀)입니다. 기본값은 128이며 거의 모든 사용 사례에 적합합니다. 크기가 클수록 정렬 파일도 커지고 처리 시간도 길어집니다.
ru: Только импорт. Размер в пикселях для внутреннего хранения маски. Значение по умолчанию — 128, что подходит практически для всех случаев использования. Большие размеры приведут к увеличению размера файлов выравниваний и более длительной обработке.

source: output
es: salida
kr: 출력
ru: вывод

source: Optional output location. If provided, a preview of the masks created will be output in the given folder.
es: Ubicación de salida opcional. Si se proporciona, se obtendrá una vista previa de las máscaras creadas en la carpeta indicada.
kr: 선택적 출력 위치. 만약 값이 제공된다면 생성된 마스크 미리 보기가 주어진 폴더에 출력됩니다.
ru: Необязательное местоположение вывода. Если указано, предварительный просмотр созданных масок будет выведен в указанную папку.

source: Apply gaussian blur to the mask output. Has the effect of smoothing the edges of the mask giving less of a hard edge. the size is in pixels. This value should be odd, if an even number is passed in then it will be rounded to the next odd number. NB: Only effects the output preview. Set to 0 for off
es: Aplica el desenfoque gaussiano a la salida de la máscara. Tiene el efecto de suavizar los bordes de la máscara dando menos de un borde duro. el tamaño está en píxeles. Este valor debe ser impar, si se pasa un número par se redondeará al siguiente número impar. NB: Sólo afecta a la vista previa de salida. Si se ajusta a 0, se desactiva
kr: 마스크 출력에 gaussian blur를 적용합니다. 마스크의 가장자리를 매끄럽게 하여 단단한 가장자리를 덜 제공하는 효과가 있습니다. 크기는 픽셀 단위입니다. 이 값은 홀수여야 하며 짝수가 전달되면 다음 홀수로 반올림됩니다. NB: 출력 미리 보기에만 영향을 줍니다. 0으로 설정하면 꺼집니다
ru: Применяет гауссово размытие к выходу маски. Сглаживает края маски, делая их менее жесткими. размер в пикселях. Это значение должно быть нечетным, если передано четное число, то оно будет округлено до следующего нечетного числа. Примечание: влияет только на предварительный просмотр. Установите значение 0 для выключения

source: Helps reduce 'blotchiness' on some masks by making light shades white and dark shades black. Higher values will impact more of the mask. NB: Only effects the output preview. Set to 0 for off
es: Ayuda a reducir la "mancha" en algunas máscaras haciendo que los tonos claros sean blancos y los oscuros negros. Los valores más altos afectarán más a la máscara. NB: Sólo afecta a la vista previa de salida. Si se ajusta a 0, se desactiva
kr: 밝은 색조를 흰색으로, 어두운 색조를 검은색으로 만들어 일부 마스크의 '흐림'을 줄이는 데 도움이 됩니다. 값이 클수록 마스크에 더 많은 영향을 미칩니다. NB: 출력 미리 보기에만 영향을 줍니다. 0으로 설정하면 꺼집니다
ru: Помогает уменьшить "пятнистость" на некоторых масках, делая светлые оттенки белыми, а темные - черными. Более высокие значения влияют на большую часть маски. Примечание: влияет только на предварительный просмотр. Установите значение 0 для выключения

source: R|How to format the output when processing is set to 'output'. L|combined: The image contains the face/frame, face mask and masked face. L|masked: Output the face/frame as rgba image with the face masked. L|mask: Only output the mask as a single channel image.
es: R|Cómo formatear la salida cuando el procesamiento se establece en 'salida'. L|combined: La imagen contiene la cara o fotograma, la máscara facial y la cara enmascarada. L|masked: Da salida a la cara o fotograma como imagen rgba con la cara enmascarada. L|mask: Sólo emite la máscara como una imagen de un solo canal.
kr: R|처리가 'output'으로 설정되어 있을 때 출력을 구성하는 방법. L|combined: 이미지에는 얼굴/프레임, 얼굴 마스크 및 마스크된 얼굴이 포함됩니다. L|masked: 마스크된 얼굴/프레임을 Rgba 이미지로 출력합니다. L|mask: 마스크를 단일 채널 이미지로만 출력합니다.
ru: R|Как форматировать вывод, когда обработка установлена на 'output'. L|combined: Изображение содержит лицо/кадр, маску лица и маскированное лицо. L|masked: Вывести лицо/кадр как изображение rgba с маскированным лицом. L|mask: Выводить только маску как одноканальное изображение.
